Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f1x/mcumap_stm32f1x.h
/*
        Name: mcumap_stm32f10x.h
        Description: Contains all MCU and PIN definitions for STM32F10x to run
   µCNC.

        Copyright: Copyright (c) João Martins
        Author: João Martins
        Date: 04-02-2020

        µCNC is free software: you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
        the Free Software Foundation, either version 3 of the License, or
        (at your option) any later version. Please see
   <http://www.gnu.org/licenses/>

        µCNC is distributed WITHOUT ANY WARRANTY;
        Also without the implied warranty of	MERCHANTABILITY or FITNESS FOR A
   PARTICULAR PURPOSE. See the	GNU General Public License for more details.
*/

#ifndef MCUMAP_STM32F10x_H
#define MCUMAP_STM32F10x_H

#ifdef __cplusplus
extern "C" {
#endif

/*
        Generates all the interface definitions.
        This creates a middle HAL layer between the board IO pins and the AVR
   funtionalities
*/
/*
        MCU specific definitions and replacements
*/
#include <stdbool.h>
#include <stm32f1xx.h>
#include <stm32f1xx_hal_rcc.h>

// defines the frequency of the mcu
#ifndef F_CPU
#define F_CPU SystemCoreClock
#warning                                                                       \
    "F_CPU not defined as a constant. Cycle/Nanoseconds delays will be take longer then expected"
#endif

// defines the maximum and minimum step rates
#ifndef F_STEP_MAX
#define F_STEP_MAX 100000
#endif
#ifndef F_STEP_MIN
#define F_STEP_MIN 4
#endif
// defines special mcu to access flash strings and arrays
#define __rom__
#define __romstr__
#define __romarr__ const uint8_t
#define rom_strptr *
#define rom_strcpy strcpy
#define rom_strncpy strncpy
#define rom_memcpy memcpy
#define rom_read_byte *

// NVIC Priority levels
#define NVIC_INPUT_IRQ_Pri 1
#define NVIC_SPI_IRQ_Pri 3
#define NVIC_UART_IRQ_Pri 4
#define NVIC_ITP_IRQ_Pri 5
#define NVIC_ONESHOT_IRQ_Pri 6
#define NVIC_SERVO_IRQ_Pri 6
#define NVIC_RTC_IRQ_Pri 8
#define NVIC_I2C_IRQ_Pri 9
#define NVIC_USB_IRQ_Pri 10

#ifndef MCU_CYCLES_PER_LOOP
#define MCU_CYCLES_PER_LOOP 4
#endif
#ifndef MCU_CYCLES_LOOP_OVERHEAD
#define MCU_CYCLES_LOOP_OVERHEAD 1
#endif

#define mcu_delay_loop(X)                                                      \
  do {                                                                         \
    asm volatile("" ::: "memory");                                             \
    register uint16_t __count = (X);                                           \
    __asm__ volatile("1: sub %[cnt], %[cnt], #1\n" /* 1 cycle */               \
                     "   cmp %[cnt], #0\n"         /* 1 cycle */               \
                     "   bne 1b\n"                 /* 1–2 cycles */            \
                     "   nop\n"                    /* 1 cycle */               \
                     : [cnt] "+r"(__count)                                     \
                     :                                                         \
                     : "cc");                                                  \
    asm volatile("" ::: "memory");                                             \
  } while (0)

// Helper macros
#define __helper_ex__(left, mid, right) left##mid##right
#define __helper__(left, mid, right) __helper_ex__(left, mid, right)
#define __iopin_ex__(port, bit) port##bit
#define __iopin__(port, bit) __iopin_ex__(port, bit)

// STM32 internal register names
#define __gpio__(X) (__helper__(GPIO, X, ))
#define __rccapb2gpioen__(X) (__helper__(RCC_APB2ENR_IOP, X, EN))
#define __afioexti__(X) __helper__(EXTI, X, )
#define __extirq__(X) __helper__(EXTI, X, _IRQn)
#define __tim__(X) (__helper__(TIM, X, ))
#define __irq__(X) (__helper__(X, _IRQn, ))
#define __rccapb1timen__(X) (__helper__(RCC_APB1ENR_TIM, X, EN))
#define __ccr__(X) __helper__(CCR, X, )
#define __usart__(X) __helper__(USART, X, )
#define __uart__(X) __helper__(UART, X, )

/**********************************************
 *	Autogenerated macros
 **********************************************/

/**********************************************
 *	IO Pins
 **********************************************/
#if (defined(STEP0_PORT) && defined(STEP0_BIT))
#define STEP0 1
#define STEP0_APB2EN (__rccapb2gpioen__(STEP0_PORT))
#define STEP0_GPIO (__gpio__(STEP0_PORT))
#if (STEP0_BIT < 8)
#define STEP0_CROFF STEP0_BIT
#define STEP0_CR CRL
#else
#define STEP0_CROFF (STEP0_BIT & 0x07)
#define STEP0_CR CRH
#endif
#define DIO1 1
#define DIO1_PORT STEP0_PORT
#define DIO1_BIT STEP0_BIT
#define DIO1_APB2EN STEP0_APB2EN
#define DIO1_GPIO STEP0_GPIO
#define DIO1_CR STEP0_CR
#define DIO1_CROFF STEP0_CROFF
#endif
#if (defined(STEP1_PORT) && defined(STEP1_BIT))
#define STEP1 2
#define STEP1_APB2EN (__rccapb2gpioen__(STEP1_PORT))
#define STEP1_GPIO (__gpio__(STEP1_PORT))
#if (STEP1_BIT < 8)
#define STEP1_CROFF STEP1_BIT
#define STEP1_CR CRL
#else
#define STEP1_CROFF (STEP1_BIT & 0x07)
#define STEP1_CR CRH
#endif
#define DIO2 2
#define DIO2_PORT STEP1_PORT
#define DIO2_BIT STEP1_BIT
#define DIO2_APB2EN STEP1_APB2EN
#define DIO2_GPIO STEP1_GPIO
#define DIO2_CR STEP1_CR
#define DIO2_CROFF STEP1_CROFF
#endif
#if (defined(STEP2_PORT) && defined(STEP2_BIT))
#define STEP2 3
#define STEP2_APB2EN (__rccapb2gpioen__(STEP2_PORT))
#define STEP2_GPIO (__gpio__(STEP2_PORT))
#if (STEP2_BIT < 8)
#define STEP2_CROFF STEP2_BIT
#define STEP2_CR CRL
#else
#define STEP2_CROFF (STEP2_BIT & 0x07)
#define STEP2_CR CRH
#endif
#define DIO3 3
#define DIO3_PORT STEP2_PORT
#define DIO3_BIT STEP2_BIT
#define DIO3_APB2EN STEP2_APB2EN
#define DIO3_GPIO STEP2_GPIO
#define DIO3_CR STEP2_CR
#define DIO3_CROFF STEP2_CROFF
#endif
#if (defined(STEP3_PORT) && defined(STEP3_BIT))
#define STEP3 4
#define STEP3_APB2EN (__rccapb2gpioen__(STEP3_PORT))
#define STEP3_GPIO (__gpio__(STEP3_PORT))
#if (STEP3_BIT < 8)
#define STEP3_CROFF STEP3_BIT
#define STEP3_CR CRL
#else
#define STEP3_CROFF (STEP3_BIT & 0x07)
#define STEP3_CR CRH
#endif
#define DIO4 4
#define DIO4_PORT STEP3_PORT
#define DIO4_BIT STEP3_BIT
#define DIO4_APB2EN STEP3_APB2EN
#define DIO4_GPIO STEP3_GPIO
#define DIO4_CR STEP3_CR
#define DIO4_CROFF STEP3_CROFF
#endif
#if (defined(STEP4_PORT) && defined(STEP4_BIT))
#define STEP4 5
#define STEP4_APB2EN (__rccapb2gpioen__(STEP4_PORT))
#define STEP4_GPIO (__gpio__(STEP4_PORT))
#if (STEP4_BIT < 8)
#define STEP4_CROFF STEP4_BIT
#define STEP4_CR CRL
#else
#define STEP4_CROFF (STEP4_BIT & 0x07)
#define STEP4_CR CRH
#endif
#define DIO5 5
#define DIO5_PORT STEP4_PORT
#define DIO5_BIT STEP4_BIT
#define DIO5_APB2EN STEP4_APB2EN
#define DIO5_GPIO STEP4_GPIO
#define DIO5_CR STEP4_CR
#define DIO5_CROFF STEP4_CROFF
#endif
#if (defined(STEP5_PORT) && defined(STEP5_BIT))
#define STEP5 6
#define STEP5_APB2EN (__rccapb2gpioen__(STEP5_PORT))
#define STEP5_GPIO (__gpio__(STEP5_PORT))
#if (STEP5_BIT < 8)
#define STEP5_CROFF STEP5_BIT
#define STEP5_CR CRL
#else
#define STEP5_CROFF (STEP5_BIT & 0x07)
#define STEP5_CR CRH
#endif
#define DIO6 6
#define DIO6_PORT STEP5_PORT
#define DIO6_BIT STEP5_BIT
#define DIO6_APB2EN STEP5_APB2EN
#define DIO6_GPIO STEP5_GPIO
#define DIO6_CR STEP5_CR
#define DIO6_CROFF STEP5_CROFF
#endif
#if (defined(STEP6_PORT) && defined(STEP6_BIT))
#define STEP6 7
#define STEP6_APB2EN (__rccapb2gpioen__(STEP6_PORT))
#define STEP6_GPIO (__gpio__(STEP6_PORT))
#if (STEP6_BIT < 8)
#define STEP6_CROFF STEP6_BIT
#define STEP6_CR CRL
#else
#define STEP6_CROFF (STEP6_BIT & 0x07)
#define STEP6_CR CRH
#endif
#define DIO7 7
#define DIO7_PORT STEP6_PORT
#define DIO7_BIT STEP6_BIT
#define DIO7_APB2EN STEP6_APB2EN
#define DIO7_GPIO STEP6_GPIO
#define DIO7_CR STEP6_CR
#define DIO7_CROFF STEP6_CROFF
#endif
#if (defined(STEP7_PORT) && defined(STEP7_BIT))
#define STEP7 8
#define STEP7_APB2EN (__rccapb2gpioen__(STEP7_PORT))
#define STEP7_GPIO (__gpio__(STEP7_PORT))
#if (STEP7_BIT < 8)
#define STEP7_CROFF STEP7_BIT
#define STEP7_CR CRL
#else
#define STEP7_CROFF (STEP7_BIT & 0x07)
#define STEP7_CR CRH
#endif
#define DIO8 8
#define DIO8_PORT STEP7_PORT
#define DIO8_BIT STEP7_BIT
#define DIO8_APB2EN STEP7_APB2EN
#define DIO8_GPIO STEP7_GPIO
#define DIO8_CR STEP7_CR
#define DIO8_CROFF STEP7_CROFF
#endif
#if (defined(DIR0_PORT) && defined(DIR0_BIT))
#define DIR0 9
#define DIR0_APB2EN (__rccapb2gpioen__(DIR0_PORT))
#define DIR0_GPIO (__gpio__(DIR0_PORT))
#if (DIR0_BIT < 8)
#define DIR0_CROFF DIR0_BIT
#define DIR0_CR CRL
#else
#define DIR0_CROFF (DIR0_BIT & 0x07)
#define DIR0_CR CRH
#endif
#define DIO9 9
#define DIO9_PORT DIR0_PORT
#define DIO9_BIT DIR0_BIT
#define DIO9_APB2EN DIR0_APB2EN
#define DIO9_GPIO DIR0_GPIO
#define DIO9_CR DIR0_CR
#define DIO9_CROFF DIR0_CROFF
#endif
#if (defined(DIR1_PORT) && defined(DIR1_BIT))
#define DIR1 10
#define DIR1_APB2EN (__rccapb2gpioen__(DIR1_PORT))
#define DIR1_GPIO (__gpio__(DIR1_PORT))
#if (DIR1_BIT < 8)
#define DIR1_CROFF DIR1_BIT
#define DIR1_CR CRL
#else
#define DIR1_CROFF (DIR1_BIT & 0x07)
#define DIR1_CR CRH
#endif
#define DIO10 10
#define DIO10_PORT DIR1_PORT
#define DIO10_BIT DIR1_BIT
#define DIO10_APB2EN DIR1_APB2EN
#define DIO10_GPIO DIR1_GPIO
#define DIO10_CR DIR1_CR
#define DIO10_CROFF DIR1_CROFF
#endif
#if (defined(DIR2_PORT) && defined(DIR2_BIT))
#define DIR2 11
#define DIR2_APB2EN (__rccapb2gpioen__(DIR2_PORT))
#define DIR2_GPIO (__gpio__(DIR2_PORT))
#if (DIR2_BIT < 8)
#define DIR2_CROFF DIR2_BIT
#define DIR2_CR CRL
#else
#define DIR2_CROFF (DIR2_BIT & 0x07)
#define DIR2_CR CRH
#endif
#define DIO11 11
#define DIO11_PORT DIR2_PORT
#define DIO11_BIT DIR2_BIT
#define DIO11_APB2EN DIR2_APB2EN
#define DIO11_GPIO DIR2_GPIO
#define DIO11_CR DIR2_CR
#define DIO11_CROFF DIR2_CROFF
#endif
#if (defined(DIR3_PORT) && defined(DIR3_BIT))
#define DIR3 12
#define DIR3_APB2EN (__rccapb2gpioen__(DIR3_PORT))
#define DIR3_GPIO (__gpio__(DIR3_PORT))
#if (DIR3_BIT < 8)
#define DIR3_CROFF DIR3_BIT
#define DIR3_CR CRL
#else
#define DIR3_CROFF (DIR3_BIT & 0x07)
#define DIR3_CR CRH
#endif
#define DIO12 12
#define DIO12_PORT DIR3_PORT
#define DIO12_BIT DIR3_BIT
#define DIO12_APB2EN DIR3_APB2EN
#define DIO12_GPIO DIR3_GPIO
#define DIO12_CR DIR3_CR
#define DIO12_CROFF DIR3_CROFF
#endif
#if (defined(DIR4_PORT) && defined(DIR4_BIT))
#define DIR4 13
#define DIR4_APB2EN (__rccapb2gpioen__(DIR4_PORT))
#define DIR4_GPIO (__gpio__(DIR4_PORT))
#if (DIR4_BIT < 8)
#define DIR4_CROFF DIR4_BIT
#define DIR4_CR CRL
#else
#define DIR4_CROFF (DIR4_BIT & 0x07)
#define DIR4_CR CRH
#endif
#define DIO13 13
#define DIO13_PORT DIR4_PORT
#define DIO13_BIT DIR4_BIT
#define DIO13_APB2EN DIR4_APB2EN
#define DIO13_GPIO DIR4_GPIO
#define DIO13_CR DIR4_CR
#define DIO13_CROFF DIR4_CROFF
#endif
#if (defined(DIR5_PORT) && defined(DIR5_BIT))
#define DIR5 14
#define DIR5_APB2EN (__rccapb2gpioen__(DIR5_PORT))
#define DIR5_GPIO (__gpio__(DIR5_PORT))
#if (DIR5_BIT < 8)
#define DIR5_CROFF DIR5_BIT
#define DIR5_CR CRL
#else
#define DIR5_CROFF (DIR5_BIT & 0x07)
#define DIR5_CR CRH
#endif
#define DIO14 14
#define DIO14_PORT DIR5_PORT
#define DIO14_BIT DIR5_BIT
#define DIO14_APB2EN DIR5_APB2EN
#define DIO14_GPIO DIR5_GPIO
#define DIO14_CR DIR5_CR
#define DIO14_CROFF DIR5_CROFF
#endif
#if (defined(DIR6_PORT) && defined(DIR6_BIT))
#define DIR6 15
#define DIR6_APB2EN (__rccapb2gpioen__(DIR6_PORT))
#define DIR6_GPIO (__gpio__(DIR6_PORT))
#if (DIR6_BIT < 8)
#define DIR6_CROFF DIR6_BIT
#define DIR6_CR CRL
#else
#define DIR6_CROFF (DIR6_BIT & 0x07)
#define DIR6_CR CRH
#endif
#define DIO15 15
#define DIO15_PORT DIR6_PORT
#define DIO15_BIT DIR6_BIT
#define DIO15_APB2EN DIR6_APB2EN
#define DIO15_GPIO DIR6_GPIO
#define DIO15_CR DIR6_CR
#define DIO15_CROFF DIR6_CROFF
#endif
#if (defined(DIR7_PORT) && defined(DIR7_BIT))
#define DIR7 16
#define DIR7_APB2EN (__rccapb2gpioen__(DIR7_PORT))
#define DIR7_GPIO (__gpio__(DIR7_PORT))
#if (DIR7_BIT < 8)
#define DIR7_CROFF DIR7_BIT
#define DIR7_CR CRL
#else
#define DIR7_CROFF (DIR7_BIT & 0x07)
#define DIR7_CR CRH
#endif
#define DIO16 16
#define DIO16_PORT DIR7_PORT
#define DIO16_BIT DIR7_BIT
#define DIO16_APB2EN DIR7_APB2EN
#define DIO16_GPIO DIR7_GPIO
#define DIO16_CR DIR7_CR
#define DIO16_CROFF DIR7_CROFF
#endif
#if (defined(STEP0_EN_PORT) && defined(STEP0_EN_BIT))
#define STEP0_EN 17
#define STEP0_EN_APB2EN (__rccapb2gpioen__(STEP0_EN_PORT))
#define STEP0_EN_GPIO (__gpio__(STEP0_EN_PORT))
#if (STEP0_EN_BIT < 8)
#define STEP0_EN_CROFF STEP0_EN_BIT
#define STEP0_EN_CR CRL
#else
#define STEP0_EN_CROFF (STEP0_EN_BIT & 0x07)
#define STEP0_EN_CR CRH
#endif
#define DIO17 17
#define DIO17_PORT STEP0_EN_PORT
#define DIO17_BIT STEP0_EN_BIT
#define DIO17_APB2EN STEP0_EN_APB2EN
#define DIO17_GPIO STEP0_EN_GPIO
#define DIO17_CR STEP0_EN_CR
#define DIO17_CROFF STEP0_EN_CROFF
#endif
#if (defined(STEP1_EN_PORT) && defined(STEP1_EN_BIT))
#define STEP1_EN 18
#define STEP1_EN_APB2EN (__rccapb2gpioen__(STEP1_EN_PORT))
#define STEP1_EN_GPIO (__gpio__(STEP1_EN_PORT))
#if (STEP1_EN_BIT < 8)
#define STEP1_EN_CROFF STEP1_EN_BIT
#define STEP1_EN_CR CRL
#else
#define STEP1_EN_CROFF (STEP1_EN_BIT & 0x07)
#define STEP1_EN_CR CRH
#endif
#define DIO18 18
#define DIO18_PORT STEP1_EN_PORT
#define DIO18_BIT STEP1_EN_BIT
#define DIO18_APB2EN STEP1_EN_APB2EN
#define DIO18_GPIO STEP1_EN_GPIO
#define DIO18_CR STEP1_EN_CR
#define DIO18_CROFF STEP1_EN_CROFF
#endif
#if (defined(STEP2_EN_PORT) && defined(STEP2_EN_BIT))
#define STEP2_EN 19
#define STEP2_EN_APB2EN (__rccapb2gpioen__(STEP2_EN_PORT))
#define STEP2_EN_GPIO (__gpio__(STEP2_EN_PORT))
#if (STEP2_EN_BIT < 8)
#define STEP2_EN_CROFF STEP2_EN_BIT
#define STEP2_EN_CR CRL
#else
#define STEP2_EN_CROFF (STEP2_EN_BIT & 0x07)
#define STEP2_EN_CR CRH
#endif
#define DIO19 19
#define DIO19_PORT STEP2_EN_PORT
#define DIO19_BIT STEP2_EN_BIT
#define DIO19_APB2EN STEP2_EN_APB2EN
#define DIO19_GPIO STEP2_EN_GPIO
#define DIO19_CR STEP2_EN_CR
#define DIO19_CROFF STEP2_EN_CROFF
#endif
#if (defined(STEP3_EN_PORT) && defined(STEP3_EN_BIT))
#define STEP3_EN 20
#define STEP3_EN_APB2EN (__rccapb2gpioen__(STEP3_EN_PORT))
#define STEP3_EN_GPIO (__gpio__(STEP3_EN_PORT))
#if (STEP3_EN_BIT < 8)
#define STEP3_EN_CROFF STEP3_EN_BIT
#define STEP3_EN_CR CRL
#else
#define STEP3_EN_CROFF (STEP3_EN_BIT & 0x07)
#define STEP3_EN_CR CRH
#endif
#define DIO20 20
#define DIO20_PORT STEP3_EN_PORT
#define DIO20_BIT STEP3_EN_BIT
#define DIO20_APB2EN STEP3_EN_APB2EN
#define DIO20_GPIO STEP3_EN_GPIO
#define DIO20_CR STEP3_EN_CR
#define DIO20_CROFF STEP3_EN_CROFF
#endif
#if (defined(STEP4_EN_PORT) && defined(STEP4_EN_BIT))
#define STEP4_EN 21
#define STEP4_EN_APB2EN (__rccapb2gpioen__(STEP4_EN_PORT))
#define STEP4_EN_GPIO (__gpio__(STEP4_EN_PORT))
#if (STEP4_EN_BIT < 8)
#define STEP4_EN_CROFF STEP4_EN_BIT
#define STEP4_EN_CR CRL
#else
#define STEP4_EN_CROFF (STEP4_EN_BIT & 0x07)
#define STEP4_EN_CR CRH
#endif
#define DIO21 21
#define DIO21_PORT STEP4_EN_PORT
#define DIO21_BIT STEP4_EN_BIT
#define DIO21_APB2EN STEP4_EN_APB2EN
#define DIO21_GPIO STEP4_EN_GPIO
#define DIO21_CR STEP4_EN_CR
#define DIO21_CROFF STEP4_EN_CROFF
#endif
#if (defined(STEP5_EN_PORT) && defined(STEP5_EN_BIT))
#define STEP5_EN 22
#define STEP5_EN_APB2EN (__rccapb2gpioen__(STEP5_EN_PORT))
#define STEP5_EN_GPIO (__gpio__(STEP5_EN_PORT))
#if (STEP5_EN_BIT < 8)
#define STEP5_EN_CROFF STEP5_EN_BIT
#define STEP5_EN_CR CRL
#else
#define STEP5_EN_CROFF (STEP5_EN_BIT & 0x07)
#define STEP5_EN_CR CRH
#endif
#define DIO22 22
#define DIO22_PORT STEP5_EN_PORT
#define DIO22_BIT STEP5_EN_BIT
#define DIO22_APB2EN STEP5_EN_APB2EN
#define DIO22_GPIO STEP5_EN_GPIO
#define DIO22_CR STEP5_EN_CR
#define DIO22_CROFF STEP5_EN_CROFF
#endif
#if (defined(STEP6_EN_PORT) && defined(STEP6_EN_BIT))
#define STEP6_EN 23
#define STEP6_EN_APB2EN (__rccapb2gpioen__(STEP6_EN_PORT))
#define STEP6_EN_GPIO (__gpio__(STEP6_EN_PORT))
#if (STEP6_EN_BIT < 8)
#define STEP6_EN_CROFF STEP6_EN_BIT
#define STEP6_EN_CR CRL
#else
#define STEP6_EN_CROFF (STEP6_EN_BIT & 0x07)
#define STEP6_EN_CR CRH
#endif
#define DIO23 23
#define DIO23_PORT STEP6_EN_PORT
#define DIO23_BIT STEP6_EN_BIT
#define DIO23_APB2EN STEP6_EN_APB2EN
#define DIO23_GPIO STEP6_EN_GPIO
#define DIO23_CR STEP6_EN_CR
#define DIO23_CROFF STEP6_EN_CROFF
#endif
#if (defined(STEP7_EN_PORT) && defined(STEP7_EN_BIT))
#define STEP7_EN 24
#define STEP7_EN_APB2EN (__rccapb2gpioen__(STEP7_EN_PORT))
#define STEP7_EN_GPIO (__gpio__(STEP7_EN_PORT))
#if (STEP7_EN_BIT < 8)
#define STEP7_EN_CROFF STEP7_EN_BIT
#define STEP7_EN_CR CRL
#else
#define STEP7_EN_CROFF (STEP7_EN_BIT & 0x07)
#define STEP7_EN_CR CRH
#endif
#define DIO24 24
#define DIO24_PORT STEP7_EN_PORT
#define DIO24_BIT STEP7_EN_BIT
#define DIO24_APB2EN STEP7_EN_APB2EN
#define DIO24_GPIO STEP7_EN_GPIO
#define DIO24_CR STEP7_EN_CR
#define DIO24_CROFF STEP7_EN_CROFF
#endif
#if (defined(PWM0_PORT) && defined(PWM0_BIT))
#define PWM0 25
#define PWM0_APB2EN (__rccapb2gpioen__(PWM0_PORT))
#define PWM0_GPIO (__gpio__(PWM0_PORT))
#if (PWM0_BIT < 8)
#define PWM0_CROFF PWM0_BIT
#define PWM0_CR CRL
#else
#define PWM0_CROFF (PWM0_BIT & 0x07)
#define PWM0_CR CRH
#endif
#define DIO25 25
#define DIO25_PORT PWM0_PORT
#define DIO25_BIT PWM0_BIT
#define DIO25_APB2EN PWM0_APB2EN
#define DIO25_GPIO PWM0_GPIO
#define DIO25_CR PWM0_CR
#define DIO25_CROFF PWM0_CROFF
#endif
#if (defined(PWM1_PORT) && defined(PWM1_BIT))
#define PWM1 26
#define PWM1_APB2EN (__rccapb2gpioen__(PWM1_PORT))
#define PWM1_GPIO (__gpio__(PWM1_PORT))
#if (PWM1_BIT < 8)
#define PWM1_CROFF PWM1_BIT
#define PWM1_CR CRL
#else
#define PWM1_CROFF (PWM1_BIT & 0x07)
#define PWM1_CR CRH
#endif
#define DIO26 26
#define DIO26_PORT PWM1_PORT
#define DIO26_BIT PWM1_BIT
#define DIO26_APB2EN PWM1_APB2EN
#define DIO26_GPIO PWM1_GPIO
#define DIO26_CR PWM1_CR
#define DIO26_CROFF PWM1_CROFF
#endif
#if (defined(PWM2_PORT) && defined(PWM2_BIT))
#define PWM2 27
#define PWM2_APB2EN (__rccapb2gpioen__(PWM2_PORT))
#define PWM2_GPIO (__gpio__(PWM2_PORT))
#if (PWM2_BIT < 8)
#define PWM2_CROFF PWM2_BIT
#define PWM2_CR CRL
#else
#define PWM2_CROFF (PWM2_BIT & 0x07)
#define PWM2_CR CRH
#endif
#define DIO27 27
#define DIO27_PORT PWM2_PORT
#define DIO27_BIT PWM2_BIT
#define DIO27_APB2EN PWM2_APB2EN
#define DIO27_GPIO PWM2_GPIO
#define DIO27_CR PWM2_CR
#define DIO27_CROFF PWM2_CROFF
#endif
#if (defined(PWM3_PORT) && defined(PWM3_BIT))
#define PWM3 28
#define PWM3_APB2EN (__rccapb2gpioen__(PWM3_PORT))
#define PWM3_GPIO (__gpio__(PWM3_PORT))
#if (PWM3_BIT < 8)
#define PWM3_CROFF PWM3_BIT
#define PWM3_CR CRL
#else
#define PWM3_CROFF (PWM3_BIT & 0x07)
#define PWM3_CR CRH
#endif
#define DIO28 28
#define DIO28_PORT PWM3_PORT
#define DIO28_BIT PWM3_BIT
#define DIO28_APB2EN PWM3_APB2EN
#define DIO28_GPIO PWM3_GPIO
#define DIO28_CR PWM3_CR
#define DIO28_CROFF PWM3_CROFF
#endif
#if (defined(PWM4_PORT) && defined(PWM4_BIT))
#define PWM4 29
#define PWM4_APB2EN (__rccapb2gpioen__(PWM4_PORT))
#define PWM4_GPIO (__gpio__(PWM4_PORT))
#if (PWM4_BIT < 8)
#define PWM4_CROFF PWM4_BIT
#define PWM4_CR CRL
#else
#define PWM4_CROFF (PWM4_BIT & 0x07)
#define PWM4_CR CRH
#endif
#define DIO29 29
#define DIO29_PORT PWM4_PORT
#define DIO29_BIT PWM4_BIT
#define DIO29_APB2EN PWM4_APB2EN
#define DIO29_GPIO PWM4_GPIO
#define DIO29_CR PWM4_CR
#define DIO29_CROFF PWM4_CROFF
#endif
#if (defined(PWM5_PORT) && defined(PWM5_BIT))
#define PWM5 30
#define PWM5_APB2EN (__rccapb2gpioen__(PWM5_PORT))
#define PWM5_GPIO (__gpio__(PWM5_PORT))
#if (PWM5_BIT < 8)
#define PWM5_CROFF PWM5_BIT
#define PWM5_CR CRL
#else
#define PWM5_CROFF (PWM5_BIT & 0x07)
#define PWM5_CR CRH
#endif
#define DIO30 30
#define DIO30_PORT PWM5_PORT
#define DIO30_BIT PWM5_BIT
#define DIO30_APB2EN PWM5_APB2EN
#define DIO30_GPIO PWM5_GPIO
#define DIO30_CR PWM5_CR
#define DIO30_CROFF PWM5_CROFF
#endif
#if (defined(PWM6_PORT) && defined(PWM6_BIT))
#define PWM6 31
#define PWM6_APB2EN (__rccapb2gpioen__(PWM6_PORT))
#define PWM6_GPIO (__gpio__(PWM6_PORT))
#if (PWM6_BIT < 8)
#define PWM6_CROFF PWM6_BIT
#define PWM6_CR CRL
#else
#define PWM6_CROFF (PWM6_BIT & 0x07)
#define PWM6_CR CRH
#endif
#define DIO31 31
#define DIO31_PORT PWM6_PORT
#define DIO31_BIT PWM6_BIT
#define DIO31_APB2EN PWM6_APB2EN
#define DIO31_GPIO PWM6_GPIO
#define DIO31_CR PWM6_CR
#define DIO31_CROFF PWM6_CROFF
#endif
#if (defined(PWM7_PORT) && defined(PWM7_BIT))
#define PWM7 32
#define PWM7_APB2EN (__rccapb2gpioen__(PWM7_PORT))
#define PWM7_GPIO (__gpio__(PWM7_PORT))
#if (PWM7_BIT < 8)
#define PWM7_CROFF PWM7_BIT
#define PWM7_CR CRL
#else
#define PWM7_CROFF (PWM7_BIT & 0x07)
#define PWM7_CR CRH
#endif
#define DIO32 32
#define DIO32_PORT PWM7_PORT
#define DIO32_BIT PWM7_BIT
#define DIO32_APB2EN PWM7_APB2EN
#define DIO32_GPIO PWM7_GPIO
#define DIO32_CR PWM7_CR
#define DIO32_CROFF PWM7_CROFF
#endif
#if (defined(PWM8_PORT) && defined(PWM8_BIT))
#define PWM8 33
#define PWM8_APB2EN (__rccapb2gpioen__(PWM8_PORT))
#define PWM8_GPIO (__gpio__(PWM8_PORT))
#if (PWM8_BIT < 8)
#define PWM8_CROFF PWM8_BIT
#define PWM8_CR CRL
#else
#define PWM8_CROFF (PWM8_BIT & 0x07)
#define PWM8_CR CRH
#endif
#define DIO33 33
#define DIO33_PORT PWM8_PORT
#define DIO33_BIT PWM8_BIT
#define DIO33_APB2EN PWM8_APB2EN
#define DIO33_GPIO PWM8_GPIO
#define DIO33_CR PWM8_CR
#define DIO33_CROFF PWM8_CROFF
#endif
#if (defined(PWM9_PORT) && defined(PWM9_BIT))
#define PWM9 34
#define PWM9_APB2EN (__rccapb2gpioen__(PWM9_PORT))
#define PWM9_GPIO (__gpio__(PWM9_PORT))
#if (PWM9_BIT < 8)
#define PWM9_CROFF PWM9_BIT
#define PWM9_CR CRL
#else
#define PWM9_CROFF (PWM9_BIT & 0x07)
#define PWM9_CR CRH
#endif
#define DIO34 34
#define DIO34_PORT PWM9_PORT
#define DIO34_BIT PWM9_BIT
#define DIO34_APB2EN PWM9_APB2EN
#define DIO34_GPIO PWM9_GPIO
#define DIO34_CR PWM9_CR
#define DIO34_CROFF PWM9_CROFF
#endif
#if (defined(PWM10_PORT) && defined(PWM10_BIT))
#define PWM10 35
#define PWM10_APB2EN (__rccapb2gpioen__(PWM10_PORT))
#define PWM10_GPIO (__gpio__(PWM10_PORT))
#if (PWM10_BIT < 8)
#define PWM10_CROFF PWM10_BIT
#define PWM10_CR CRL
#else
#define PWM10_CROFF (PWM10_BIT & 0x07)
#define PWM10_CR CRH
#endif
#define DIO35 35
#define DIO35_PORT PWM10_PORT
#define DIO35_BIT PWM10_BIT
#define DIO35_APB2EN PWM10_APB2EN
#define DIO35_GPIO PWM10_GPIO
#define DIO35_CR PWM10_CR
#define DIO35_CROFF PWM10_CROFF
#endif
#if (defined(PWM11_PORT) && defined(PWM11_BIT))
#define PWM11 36
#define PWM11_APB2EN (__rccapb2gpioen__(PWM11_PORT))
#define PWM11_GPIO (__gpio__(PWM11_PORT))
#if (PWM11_BIT < 8)
#define PWM11_CROFF PWM11_BIT
#define PWM11_CR CRL
#else
#define PWM11_CROFF (PWM11_BIT & 0x07)
#define PWM11_CR CRH
#endif
#define DIO36 36
#define DIO36_PORT PWM11_PORT
#define DIO36_BIT PWM11_BIT
#define DIO36_APB2EN PWM11_APB2EN
#define DIO36_GPIO PWM11_GPIO
#define DIO36_CR PWM11_CR
#define DIO36_CROFF PWM11_CROFF
#endif
#if (defined(PWM12_PORT) && defined(PWM12_BIT))
#define PWM12 37
#define PWM12_APB2EN (__rccapb2gpioen__(PWM12_PORT))
#define PWM12_GPIO (__gpio__(PWM12_PORT))
#if (PWM12_BIT < 8)
#define PWM12_CROFF PWM12_BIT
#define PWM12_CR CRL
#else
#define PWM12_CROFF (PWM12_BIT & 0x07)
#define PWM12_CR CRH
#endif
#define DIO37 37
#define DIO37_PORT PWM12_PORT
#define DIO37_BIT PWM12_BIT
#define DIO37_APB2EN PWM12_APB2EN
#define DIO37_GPIO PWM12_GPIO
#define DIO37_CR PWM12_CR
#define DIO37_CROFF PWM12_CROFF
#endif
#if (defined(PWM13_PORT) && defined(PWM13_BIT))
#define PWM13 38
#define PWM13_APB2EN (__rccapb2gpioen__(PWM13_PORT))
#define PWM13_GPIO (__gpio__(PWM13_PORT))
#if (PWM13_BIT < 8)
#define PWM13_CROFF PWM13_BIT
#define PWM13_CR CRL
#else
#define PWM13_CROFF (PWM13_BIT & 0x07)
#define PWM13_CR CRH
#endif
#define DIO38 38
#define DIO38_PORT PWM13_PORT
#define DIO38_BIT PWM13_BIT
#define DIO38_APB2EN PWM13_APB2EN
#define DIO38_GPIO PWM13_GPIO
#define DIO38_CR PWM13_CR
#define DIO38_CROFF PWM13_CROFF
#endif
#if (defined(PWM14_PORT) && defined(PWM14_BIT))
#define PWM14 39
#define PWM14_APB2EN (__rccapb2gpioen__(PWM14_PORT))
#define PWM14_GPIO (__gpio__(PWM14_PORT))
#if (PWM14_BIT < 8)
#define PWM14_CROFF PWM14_BIT
#define PWM14_CR CRL
#else
#define PWM14_CROFF (PWM14_BIT & 0x07)
#define PWM14_CR CRH
#endif
#define DIO39 39
#define DIO39_PORT PWM14_PORT
#define DIO39_BIT PWM14_BIT
#define DIO39_APB2EN PWM14_APB2EN
#define DIO39_GPIO PWM14_GPIO
#define DIO39_CR PWM14_CR
