Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f1x/mcumap_stm32f1x.h
#define DIO39_CROFF PWM14_CROFF
#endif
#if (defined(PWM15_PORT) && defined(PWM15_BIT))
#define PWM15 40
#define PWM15_APB2EN (__rccapb2gpioen__(PWM15_PORT))
#define PWM15_GPIO (__gpio__(PWM15_PORT))
#if (PWM15_BIT < 8)
#define PWM15_CROFF PWM15_BIT
#define PWM15_CR CRL
#else
#define PWM15_CROFF (PWM15_BIT & 0x07)
#define PWM15_CR CRH
#endif
#define DIO40 40
#define DIO40_PORT PWM15_PORT
#define DIO40_BIT PWM15_BIT
#define DIO40_APB2EN PWM15_APB2EN
#define DIO40_GPIO PWM15_GPIO
#define DIO40_CR PWM15_CR
#define DIO40_CROFF PWM15_CROFF
#endif
#if (defined(SERVO0_PORT) && defined(SERVO0_BIT))
#define SERVO0 41
#define SERVO0_APB2EN (__rccapb2gpioen__(SERVO0_PORT))
#define SERVO0_GPIO (__gpio__(SERVO0_PORT))
#if (SERVO0_BIT < 8)
#define SERVO0_CROFF SERVO0_BIT
#define SERVO0_CR CRL
#else
#define SERVO0_CROFF (SERVO0_BIT & 0x07)
#define SERVO0_CR CRH
#endif
#define DIO41 41
#define DIO41_PORT SERVO0_PORT
#define DIO41_BIT SERVO0_BIT
#define DIO41_APB2EN SERVO0_APB2EN
#define DIO41_GPIO SERVO0_GPIO
#define DIO41_CR SERVO0_CR
#define DIO41_CROFF SERVO0_CROFF
#endif
#if (defined(SERVO1_PORT) && defined(SERVO1_BIT))
#define SERVO1 42
#define SERVO1_APB2EN (__rccapb2gpioen__(SERVO1_PORT))
#define SERVO1_GPIO (__gpio__(SERVO1_PORT))
#if (SERVO1_BIT < 8)
#define SERVO1_CROFF SERVO1_BIT
#define SERVO1_CR CRL
#else
#define SERVO1_CROFF (SERVO1_BIT & 0x07)
#define SERVO1_CR CRH
#endif
#define DIO42 42
#define DIO42_PORT SERVO1_PORT
#define DIO42_BIT SERVO1_BIT
#define DIO42_APB2EN SERVO1_APB2EN
#define DIO42_GPIO SERVO1_GPIO
#define DIO42_CR SERVO1_CR
#define DIO42_CROFF SERVO1_CROFF
#endif
#if (defined(SERVO2_PORT) && defined(SERVO2_BIT))
#define SERVO2 43
#define SERVO2_APB2EN (__rccapb2gpioen__(SERVO2_PORT))
#define SERVO2_GPIO (__gpio__(SERVO2_PORT))
#if (SERVO2_BIT < 8)
#define SERVO2_CROFF SERVO2_BIT
#define SERVO2_CR CRL
#else
#define SERVO2_CROFF (SERVO2_BIT & 0x07)
#define SERVO2_CR CRH
#endif
#define DIO43 43
#define DIO43_PORT SERVO2_PORT
#define DIO43_BIT SERVO2_BIT
#define DIO43_APB2EN SERVO2_APB2EN
#define DIO43_GPIO SERVO2_GPIO
#define DIO43_CR SERVO2_CR
#define DIO43_CROFF SERVO2_CROFF
#endif
#if (defined(SERVO3_PORT) && defined(SERVO3_BIT))
#define SERVO3 44
#define SERVO3_APB2EN (__rccapb2gpioen__(SERVO3_PORT))
#define SERVO3_GPIO (__gpio__(SERVO3_PORT))
#if (SERVO3_BIT < 8)
#define SERVO3_CROFF SERVO3_BIT
#define SERVO3_CR CRL
#else
#define SERVO3_CROFF (SERVO3_BIT & 0x07)
#define SERVO3_CR CRH
#endif
#define DIO44 44
#define DIO44_PORT SERVO3_PORT
#define DIO44_BIT SERVO3_BIT
#define DIO44_APB2EN SERVO3_APB2EN
#define DIO44_GPIO SERVO3_GPIO
#define DIO44_CR SERVO3_CR
#define DIO44_CROFF SERVO3_CROFF
#endif
#if (defined(SERVO4_PORT) && defined(SERVO4_BIT))
#define SERVO4 45
#define SERVO4_APB2EN (__rccapb2gpioen__(SERVO4_PORT))
#define SERVO4_GPIO (__gpio__(SERVO4_PORT))
#if (SERVO4_BIT < 8)
#define SERVO4_CROFF SERVO4_BIT
#define SERVO4_CR CRL
#else
#define SERVO4_CROFF (SERVO4_BIT & 0x07)
#define SERVO4_CR CRH
#endif
#define DIO45 45
#define DIO45_PORT SERVO4_PORT
#define DIO45_BIT SERVO4_BIT
#define DIO45_APB2EN SERVO4_APB2EN
#define DIO45_GPIO SERVO4_GPIO
#define DIO45_CR SERVO4_CR
#define DIO45_CROFF SERVO4_CROFF
#endif
#if (defined(SERVO5_PORT) && defined(SERVO5_BIT))
#define SERVO5 46
#define SERVO5_APB2EN (__rccapb2gpioen__(SERVO5_PORT))
#define SERVO5_GPIO (__gpio__(SERVO5_PORT))
#if (SERVO5_BIT < 8)
#define SERVO5_CROFF SERVO5_BIT
#define SERVO5_CR CRL
#else
#define SERVO5_CROFF (SERVO5_BIT & 0x07)
#define SERVO5_CR CRH
#endif
#define DIO46 46
#define DIO46_PORT SERVO5_PORT
#define DIO46_BIT SERVO5_BIT
#define DIO46_APB2EN SERVO5_APB2EN
#define DIO46_GPIO SERVO5_GPIO
#define DIO46_CR SERVO5_CR
#define DIO46_CROFF SERVO5_CROFF
#endif
#if (defined(DOUT0_PORT) && defined(DOUT0_BIT))
#define DOUT0 47
#define DOUT0_APB2EN (__rccapb2gpioen__(DOUT0_PORT))
#define DOUT0_GPIO (__gpio__(DOUT0_PORT))
#if (DOUT0_BIT < 8)
#define DOUT0_CROFF DOUT0_BIT
#define DOUT0_CR CRL
#else
#define DOUT0_CROFF (DOUT0_BIT & 0x07)
#define DOUT0_CR CRH
#endif
#define DIO47 47
#define DIO47_PORT DOUT0_PORT
#define DIO47_BIT DOUT0_BIT
#define DIO47_APB2EN DOUT0_APB2EN
#define DIO47_GPIO DOUT0_GPIO
#define DIO47_CR DOUT0_CR
#define DIO47_CROFF DOUT0_CROFF
#endif
#if (defined(DOUT1_PORT) && defined(DOUT1_BIT))
#define DOUT1 48
#define DOUT1_APB2EN (__rccapb2gpioen__(DOUT1_PORT))
#define DOUT1_GPIO (__gpio__(DOUT1_PORT))
#if (DOUT1_BIT < 8)
#define DOUT1_CROFF DOUT1_BIT
#define DOUT1_CR CRL
#else
#define DOUT1_CROFF (DOUT1_BIT & 0x07)
#define DOUT1_CR CRH
#endif
#define DIO48 48
#define DIO48_PORT DOUT1_PORT
#define DIO48_BIT DOUT1_BIT
#define DIO48_APB2EN DOUT1_APB2EN
#define DIO48_GPIO DOUT1_GPIO
#define DIO48_CR DOUT1_CR
#define DIO48_CROFF DOUT1_CROFF
#endif
#if (defined(DOUT2_PORT) && defined(DOUT2_BIT))
#define DOUT2 49
#define DOUT2_APB2EN (__rccapb2gpioen__(DOUT2_PORT))
#define DOUT2_GPIO (__gpio__(DOUT2_PORT))
#if (DOUT2_BIT < 8)
#define DOUT2_CROFF DOUT2_BIT
#define DOUT2_CR CRL
#else
#define DOUT2_CROFF (DOUT2_BIT & 0x07)
#define DOUT2_CR CRH
#endif
#define DIO49 49
#define DIO49_PORT DOUT2_PORT
#define DIO49_BIT DOUT2_BIT
#define DIO49_APB2EN DOUT2_APB2EN
#define DIO49_GPIO DOUT2_GPIO
#define DIO49_CR DOUT2_CR
#define DIO49_CROFF DOUT2_CROFF
#endif
#if (defined(DOUT3_PORT) && defined(DOUT3_BIT))
#define DOUT3 50
#define DOUT3_APB2EN (__rccapb2gpioen__(DOUT3_PORT))
#define DOUT3_GPIO (__gpio__(DOUT3_PORT))
#if (DOUT3_BIT < 8)
#define DOUT3_CROFF DOUT3_BIT
#define DOUT3_CR CRL
#else
#define DOUT3_CROFF (DOUT3_BIT & 0x07)
#define DOUT3_CR CRH
#endif
#define DIO50 50
#define DIO50_PORT DOUT3_PORT
#define DIO50_BIT DOUT3_BIT
#define DIO50_APB2EN DOUT3_APB2EN
#define DIO50_GPIO DOUT3_GPIO
#define DIO50_CR DOUT3_CR
#define DIO50_CROFF DOUT3_CROFF
#endif
#if (defined(DOUT4_PORT) && defined(DOUT4_BIT))
#define DOUT4 51
#define DOUT4_APB2EN (__rccapb2gpioen__(DOUT4_PORT))
#define DOUT4_GPIO (__gpio__(DOUT4_PORT))
#if (DOUT4_BIT < 8)
#define DOUT4_CROFF DOUT4_BIT
#define DOUT4_CR CRL
#else
#define DOUT4_CROFF (DOUT4_BIT & 0x07)
#define DOUT4_CR CRH
#endif
#define DIO51 51
#define DIO51_PORT DOUT4_PORT
#define DIO51_BIT DOUT4_BIT
#define DIO51_APB2EN DOUT4_APB2EN
#define DIO51_GPIO DOUT4_GPIO
#define DIO51_CR DOUT4_CR
#define DIO51_CROFF DOUT4_CROFF
#endif
#if (defined(DOUT5_PORT) && defined(DOUT5_BIT))
#define DOUT5 52
#define DOUT5_APB2EN (__rccapb2gpioen__(DOUT5_PORT))
#define DOUT5_GPIO (__gpio__(DOUT5_PORT))
#if (DOUT5_BIT < 8)
#define DOUT5_CROFF DOUT5_BIT
#define DOUT5_CR CRL
#else
#define DOUT5_CROFF (DOUT5_BIT & 0x07)
#define DOUT5_CR CRH
#endif
#define DIO52 52
#define DIO52_PORT DOUT5_PORT
#define DIO52_BIT DOUT5_BIT
#define DIO52_APB2EN DOUT5_APB2EN
#define DIO52_GPIO DOUT5_GPIO
#define DIO52_CR DOUT5_CR
#define DIO52_CROFF DOUT5_CROFF
#endif
#if (defined(DOUT6_PORT) && defined(DOUT6_BIT))
#define DOUT6 53
#define DOUT6_APB2EN (__rccapb2gpioen__(DOUT6_PORT))
#define DOUT6_GPIO (__gpio__(DOUT6_PORT))
#if (DOUT6_BIT < 8)
#define DOUT6_CROFF DOUT6_BIT
#define DOUT6_CR CRL
#else
#define DOUT6_CROFF (DOUT6_BIT & 0x07)
#define DOUT6_CR CRH
#endif
#define DIO53 53
#define DIO53_PORT DOUT6_PORT
#define DIO53_BIT DOUT6_BIT
#define DIO53_APB2EN DOUT6_APB2EN
#define DIO53_GPIO DOUT6_GPIO
#define DIO53_CR DOUT6_CR
#define DIO53_CROFF DOUT6_CROFF
#endif
#if (defined(DOUT7_PORT) && defined(DOUT7_BIT))
#define DOUT7 54
#define DOUT7_APB2EN (__rccapb2gpioen__(DOUT7_PORT))
#define DOUT7_GPIO (__gpio__(DOUT7_PORT))
#if (DOUT7_BIT < 8)
#define DOUT7_CROFF DOUT7_BIT
#define DOUT7_CR CRL
#else
#define DOUT7_CROFF (DOUT7_BIT & 0x07)
#define DOUT7_CR CRH
#endif
#define DIO54 54
#define DIO54_PORT DOUT7_PORT
#define DIO54_BIT DOUT7_BIT
#define DIO54_APB2EN DOUT7_APB2EN
#define DIO54_GPIO DOUT7_GPIO
#define DIO54_CR DOUT7_CR
#define DIO54_CROFF DOUT7_CROFF
#endif
#if (defined(DOUT8_PORT) && defined(DOUT8_BIT))
#define DOUT8 55
#define DOUT8_APB2EN (__rccapb2gpioen__(DOUT8_PORT))
#define DOUT8_GPIO (__gpio__(DOUT8_PORT))
#if (DOUT8_BIT < 8)
#define DOUT8_CROFF DOUT8_BIT
#define DOUT8_CR CRL
#else
#define DOUT8_CROFF (DOUT8_BIT & 0x07)
#define DOUT8_CR CRH
#endif
#define DIO55 55
#define DIO55_PORT DOUT8_PORT
#define DIO55_BIT DOUT8_BIT
#define DIO55_APB2EN DOUT8_APB2EN
#define DIO55_GPIO DOUT8_GPIO
#define DIO55_CR DOUT8_CR
#define DIO55_CROFF DOUT8_CROFF
#endif
#if (defined(DOUT9_PORT) && defined(DOUT9_BIT))
#define DOUT9 56
#define DOUT9_APB2EN (__rccapb2gpioen__(DOUT9_PORT))
#define DOUT9_GPIO (__gpio__(DOUT9_PORT))
#if (DOUT9_BIT < 8)
#define DOUT9_CROFF DOUT9_BIT
#define DOUT9_CR CRL
#else
#define DOUT9_CROFF (DOUT9_BIT & 0x07)
#define DOUT9_CR CRH
#endif
#define DIO56 56
#define DIO56_PORT DOUT9_PORT
#define DIO56_BIT DOUT9_BIT
#define DIO56_APB2EN DOUT9_APB2EN
#define DIO56_GPIO DOUT9_GPIO
#define DIO56_CR DOUT9_CR
#define DIO56_CROFF DOUT9_CROFF
#endif
#if (defined(DOUT10_PORT) && defined(DOUT10_BIT))
#define DOUT10 57
#define DOUT10_APB2EN (__rccapb2gpioen__(DOUT10_PORT))
#define DOUT10_GPIO (__gpio__(DOUT10_PORT))
#if (DOUT10_BIT < 8)
#define DOUT10_CROFF DOUT10_BIT
#define DOUT10_CR CRL
#else
#define DOUT10_CROFF (DOUT10_BIT & 0x07)
#define DOUT10_CR CRH
#endif
#define DIO57 57
#define DIO57_PORT DOUT10_PORT
#define DIO57_BIT DOUT10_BIT
#define DIO57_APB2EN DOUT10_APB2EN
#define DIO57_GPIO DOUT10_GPIO
#define DIO57_CR DOUT10_CR
#define DIO57_CROFF DOUT10_CROFF
#endif
#if (defined(DOUT11_PORT) && defined(DOUT11_BIT))
#define DOUT11 58
#define DOUT11_APB2EN (__rccapb2gpioen__(DOUT11_PORT))
#define DOUT11_GPIO (__gpio__(DOUT11_PORT))
#if (DOUT11_BIT < 8)
#define DOUT11_CROFF DOUT11_BIT
#define DOUT11_CR CRL
#else
#define DOUT11_CROFF (DOUT11_BIT & 0x07)
#define DOUT11_CR CRH
#endif
#define DIO58 58
#define DIO58_PORT DOUT11_PORT
#define DIO58_BIT DOUT11_BIT
#define DIO58_APB2EN DOUT11_APB2EN
#define DIO58_GPIO DOUT11_GPIO
#define DIO58_CR DOUT11_CR
#define DIO58_CROFF DOUT11_CROFF
#endif
#if (defined(DOUT12_PORT) && defined(DOUT12_BIT))
#define DOUT12 59
#define DOUT12_APB2EN (__rccapb2gpioen__(DOUT12_PORT))
#define DOUT12_GPIO (__gpio__(DOUT12_PORT))
#if (DOUT12_BIT < 8)
#define DOUT12_CROFF DOUT12_BIT
#define DOUT12_CR CRL
#else
#define DOUT12_CROFF (DOUT12_BIT & 0x07)
#define DOUT12_CR CRH
#endif
#define DIO59 59
#define DIO59_PORT DOUT12_PORT
#define DIO59_BIT DOUT12_BIT
#define DIO59_APB2EN DOUT12_APB2EN
#define DIO59_GPIO DOUT12_GPIO
#define DIO59_CR DOUT12_CR
#define DIO59_CROFF DOUT12_CROFF
#endif
#if (defined(DOUT13_PORT) && defined(DOUT13_BIT))
#define DOUT13 60
#define DOUT13_APB2EN (__rccapb2gpioen__(DOUT13_PORT))
#define DOUT13_GPIO (__gpio__(DOUT13_PORT))
#if (DOUT13_BIT < 8)
#define DOUT13_CROFF DOUT13_BIT
#define DOUT13_CR CRL
#else
#define DOUT13_CROFF (DOUT13_BIT & 0x07)
#define DOUT13_CR CRH
#endif
#define DIO60 60
#define DIO60_PORT DOUT13_PORT
#define DIO60_BIT DOUT13_BIT
#define DIO60_APB2EN DOUT13_APB2EN
#define DIO60_GPIO DOUT13_GPIO
#define DIO60_CR DOUT13_CR
#define DIO60_CROFF DOUT13_CROFF
#endif
#if (defined(DOUT14_PORT) && defined(DOUT14_BIT))
#define DOUT14 61
#define DOUT14_APB2EN (__rccapb2gpioen__(DOUT14_PORT))
#define DOUT14_GPIO (__gpio__(DOUT14_PORT))
#if (DOUT14_BIT < 8)
#define DOUT14_CROFF DOUT14_BIT
#define DOUT14_CR CRL
#else
#define DOUT14_CROFF (DOUT14_BIT & 0x07)
#define DOUT14_CR CRH
#endif
#define DIO61 61
#define DIO61_PORT DOUT14_PORT
#define DIO61_BIT DOUT14_BIT
#define DIO61_APB2EN DOUT14_APB2EN
#define DIO61_GPIO DOUT14_GPIO
#define DIO61_CR DOUT14_CR
#define DIO61_CROFF DOUT14_CROFF
#endif
#if (defined(DOUT15_PORT) && defined(DOUT15_BIT))
#define DOUT15 62
#define DOUT15_APB2EN (__rccapb2gpioen__(DOUT15_PORT))
#define DOUT15_GPIO (__gpio__(DOUT15_PORT))
#if (DOUT15_BIT < 8)
#define DOUT15_CROFF DOUT15_BIT
#define DOUT15_CR CRL
#else
#define DOUT15_CROFF (DOUT15_BIT & 0x07)
#define DOUT15_CR CRH
#endif
#define DIO62 62
#define DIO62_PORT DOUT15_PORT
#define DIO62_BIT DOUT15_BIT
#define DIO62_APB2EN DOUT15_APB2EN
#define DIO62_GPIO DOUT15_GPIO
#define DIO62_CR DOUT15_CR
#define DIO62_CROFF DOUT15_CROFF
#endif
#if (defined(DOUT16_PORT) && defined(DOUT16_BIT))
#define DOUT16 63
#define DOUT16_APB2EN (__rccapb2gpioen__(DOUT16_PORT))
#define DOUT16_GPIO (__gpio__(DOUT16_PORT))
#if (DOUT16_BIT < 8)
#define DOUT16_CROFF DOUT16_BIT
#define DOUT16_CR CRL
#else
#define DOUT16_CROFF (DOUT16_BIT & 0x07)
#define DOUT16_CR CRH
#endif
#define DIO63 63
#define DIO63_PORT DOUT16_PORT
#define DIO63_BIT DOUT16_BIT
#define DIO63_APB2EN DOUT16_APB2EN
#define DIO63_GPIO DOUT16_GPIO
#define DIO63_CR DOUT16_CR
#define DIO63_CROFF DOUT16_CROFF
#endif
#if (defined(DOUT17_PORT) && defined(DOUT17_BIT))
#define DOUT17 64
#define DOUT17_APB2EN (__rccapb2gpioen__(DOUT17_PORT))
#define DOUT17_GPIO (__gpio__(DOUT17_PORT))
#if (DOUT17_BIT < 8)
#define DOUT17_CROFF DOUT17_BIT
#define DOUT17_CR CRL
#else
#define DOUT17_CROFF (DOUT17_BIT & 0x07)
#define DOUT17_CR CRH
#endif
#define DIO64 64
#define DIO64_PORT DOUT17_PORT
#define DIO64_BIT DOUT17_BIT
#define DIO64_APB2EN DOUT17_APB2EN
#define DIO64_GPIO DOUT17_GPIO
#define DIO64_CR DOUT17_CR
#define DIO64_CROFF DOUT17_CROFF
#endif
#if (defined(DOUT18_PORT) && defined(DOUT18_BIT))
#define DOUT18 65
#define DOUT18_APB2EN (__rccapb2gpioen__(DOUT18_PORT))
#define DOUT18_GPIO (__gpio__(DOUT18_PORT))
#if (DOUT18_BIT < 8)
#define DOUT18_CROFF DOUT18_BIT
#define DOUT18_CR CRL
#else
#define DOUT18_CROFF (DOUT18_BIT & 0x07)
#define DOUT18_CR CRH
#endif
#define DIO65 65
#define DIO65_PORT DOUT18_PORT
#define DIO65_BIT DOUT18_BIT
#define DIO65_APB2EN DOUT18_APB2EN
#define DIO65_GPIO DOUT18_GPIO
#define DIO65_CR DOUT18_CR
#define DIO65_CROFF DOUT18_CROFF
#endif
#if (defined(DOUT19_PORT) && defined(DOUT19_BIT))
#define DOUT19 66
#define DOUT19_APB2EN (__rccapb2gpioen__(DOUT19_PORT))
#define DOUT19_GPIO (__gpio__(DOUT19_PORT))
#if (DOUT19_BIT < 8)
#define DOUT19_CROFF DOUT19_BIT
#define DOUT19_CR CRL
#else
#define DOUT19_CROFF (DOUT19_BIT & 0x07)
#define DOUT19_CR CRH
#endif
#define DIO66 66
#define DIO66_PORT DOUT19_PORT
#define DIO66_BIT DOUT19_BIT
#define DIO66_APB2EN DOUT19_APB2EN
#define DIO66_GPIO DOUT19_GPIO
#define DIO66_CR DOUT19_CR
#define DIO66_CROFF DOUT19_CROFF
#endif
#if (defined(DOUT20_PORT) && defined(DOUT20_BIT))
#define DOUT20 67
#define DOUT20_APB2EN (__rccapb2gpioen__(DOUT20_PORT))
#define DOUT20_GPIO (__gpio__(DOUT20_PORT))
#if (DOUT20_BIT < 8)
#define DOUT20_CROFF DOUT20_BIT
#define DOUT20_CR CRL
#else
#define DOUT20_CROFF (DOUT20_BIT & 0x07)
#define DOUT20_CR CRH
#endif
#define DIO67 67
#define DIO67_PORT DOUT20_PORT
#define DIO67_BIT DOUT20_BIT
#define DIO67_APB2EN DOUT20_APB2EN
#define DIO67_GPIO DOUT20_GPIO
#define DIO67_CR DOUT20_CR
#define DIO67_CROFF DOUT20_CROFF
#endif
#if (defined(DOUT21_PORT) && defined(DOUT21_BIT))
#define DOUT21 68
#define DOUT21_APB2EN (__rccapb2gpioen__(DOUT21_PORT))
#define DOUT21_GPIO (__gpio__(DOUT21_PORT))
#if (DOUT21_BIT < 8)
#define DOUT21_CROFF DOUT21_BIT
#define DOUT21_CR CRL
#else
#define DOUT21_CROFF (DOUT21_BIT & 0x07)
#define DOUT21_CR CRH
#endif
#define DIO68 68
#define DIO68_PORT DOUT21_PORT
#define DIO68_BIT DOUT21_BIT
#define DIO68_APB2EN DOUT21_APB2EN
#define DIO68_GPIO DOUT21_GPIO
#define DIO68_CR DOUT21_CR
#define DIO68_CROFF DOUT21_CROFF
#endif
#if (defined(DOUT22_PORT) && defined(DOUT22_BIT))
#define DOUT22 69
#define DOUT22_APB2EN (__rccapb2gpioen__(DOUT22_PORT))
#define DOUT22_GPIO (__gpio__(DOUT22_PORT))
#if (DOUT22_BIT < 8)
#define DOUT22_CROFF DOUT22_BIT
#define DOUT22_CR CRL
#else
#define DOUT22_CROFF (DOUT22_BIT & 0x07)
#define DOUT22_CR CRH
#endif
#define DIO69 69
#define DIO69_PORT DOUT22_PORT
#define DIO69_BIT DOUT22_BIT
#define DIO69_APB2EN DOUT22_APB2EN
#define DIO69_GPIO DOUT22_GPIO
#define DIO69_CR DOUT22_CR
#define DIO69_CROFF DOUT22_CROFF
#endif
#if (defined(DOUT23_PORT) && defined(DOUT23_BIT))
#define DOUT23 70
#define DOUT23_APB2EN (__rccapb2gpioen__(DOUT23_PORT))
#define DOUT23_GPIO (__gpio__(DOUT23_PORT))
#if (DOUT23_BIT < 8)
#define DOUT23_CROFF DOUT23_BIT
#define DOUT23_CR CRL
#else
#define DOUT23_CROFF (DOUT23_BIT & 0x07)
#define DOUT23_CR CRH
#endif
#define DIO70 70
#define DIO70_PORT DOUT23_PORT
#define DIO70_BIT DOUT23_BIT
#define DIO70_APB2EN DOUT23_APB2EN
#define DIO70_GPIO DOUT23_GPIO
#define DIO70_CR DOUT23_CR
#define DIO70_CROFF DOUT23_CROFF
#endif
#if (defined(DOUT24_PORT) && defined(DOUT24_BIT))
#define DOUT24 71
#define DOUT24_APB2EN (__rccapb2gpioen__(DOUT24_PORT))
#define DOUT24_GPIO (__gpio__(DOUT24_PORT))
#if (DOUT24_BIT < 8)
#define DOUT24_CROFF DOUT24_BIT
#define DOUT24_CR CRL
#else
#define DOUT24_CROFF (DOUT24_BIT & 0x07)
#define DOUT24_CR CRH
#endif
#define DIO71 71
#define DIO71_PORT DOUT24_PORT
#define DIO71_BIT DOUT24_BIT
#define DIO71_APB2EN DOUT24_APB2EN
#define DIO71_GPIO DOUT24_GPIO
#define DIO71_CR DOUT24_CR
#define DIO71_CROFF DOUT24_CROFF
#endif
#if (defined(DOUT25_PORT) && defined(DOUT25_BIT))
#define DOUT25 72
#define DOUT25_APB2EN (__rccapb2gpioen__(DOUT25_PORT))
#define DOUT25_GPIO (__gpio__(DOUT25_PORT))
#if (DOUT25_BIT < 8)
#define DOUT25_CROFF DOUT25_BIT
#define DOUT25_CR CRL
#else
#define DOUT25_CROFF (DOUT25_BIT & 0x07)
#define DOUT25_CR CRH
#endif
#define DIO72 72
#define DIO72_PORT DOUT25_PORT
#define DIO72_BIT DOUT25_BIT
#define DIO72_APB2EN DOUT25_APB2EN
#define DIO72_GPIO DOUT25_GPIO
#define DIO72_CR DOUT25_CR
#define DIO72_CROFF DOUT25_CROFF
#endif
#if (defined(DOUT26_PORT) && defined(DOUT26_BIT))
#define DOUT26 73
#define DOUT26_APB2EN (__rccapb2gpioen__(DOUT26_PORT))
#define DOUT26_GPIO (__gpio__(DOUT26_PORT))
#if (DOUT26_BIT < 8)
#define DOUT26_CROFF DOUT26_BIT
#define DOUT26_CR CRL
#else
#define DOUT26_CROFF (DOUT26_BIT & 0x07)
#define DOUT26_CR CRH
#endif
#define DIO73 73
#define DIO73_PORT DOUT26_PORT
#define DIO73_BIT DOUT26_BIT
#define DIO73_APB2EN DOUT26_APB2EN
#define DIO73_GPIO DOUT26_GPIO
#define DIO73_CR DOUT26_CR
#define DIO73_CROFF DOUT26_CROFF
#endif
#if (defined(DOUT27_PORT) && defined(DOUT27_BIT))
#define DOUT27 74
#define DOUT27_APB2EN (__rccapb2gpioen__(DOUT27_PORT))
#define DOUT27_GPIO (__gpio__(DOUT27_PORT))
#if (DOUT27_BIT < 8)
#define DOUT27_CROFF DOUT27_BIT
#define DOUT27_CR CRL
#else
#define DOUT27_CROFF (DOUT27_BIT & 0x07)
#define DOUT27_CR CRH
#endif
#define DIO74 74
#define DIO74_PORT DOUT27_PORT
#define DIO74_BIT DOUT27_BIT
#define DIO74_APB2EN DOUT27_APB2EN
#define DIO74_GPIO DOUT27_GPIO
#define DIO74_CR DOUT27_CR
#define DIO74_CROFF DOUT27_CROFF
#endif
#if (defined(DOUT28_PORT) && defined(DOUT28_BIT))
#define DOUT28 75
#define DOUT28_APB2EN (__rccapb2gpioen__(DOUT28_PORT))
#define DOUT28_GPIO (__gpio__(DOUT28_PORT))
#if (DOUT28_BIT < 8)
#define DOUT28_CROFF DOUT28_BIT
#define DOUT28_CR CRL
#else
#define DOUT28_CROFF (DOUT28_BIT & 0x07)
#define DOUT28_CR CRH
#endif
#define DIO75 75
#define DIO75_PORT DOUT28_PORT
#define DIO75_BIT DOUT28_BIT
#define DIO75_APB2EN DOUT28_APB2EN
#define DIO75_GPIO DOUT28_GPIO
#define DIO75_CR DOUT28_CR
#define DIO75_CROFF DOUT28_CROFF
#endif
#if (defined(DOUT29_PORT) && defined(DOUT29_BIT))
#define DOUT29 76
#define DOUT29_APB2EN (__rccapb2gpioen__(DOUT29_PORT))
#define DOUT29_GPIO (__gpio__(DOUT29_PORT))
#if (DOUT29_BIT < 8)
#define DOUT29_CROFF DOUT29_BIT
#define DOUT29_CR CRL
#else
#define DOUT29_CROFF (DOUT29_BIT & 0x07)
#define DOUT29_CR CRH
#endif
#define DIO76 76
#define DIO76_PORT DOUT29_PORT
#define DIO76_BIT DOUT29_BIT
#define DIO76_APB2EN DOUT29_APB2EN
#define DIO76_GPIO DOUT29_GPIO
#define DIO76_CR DOUT29_CR
#define DIO76_CROFF DOUT29_CROFF
#endif
#if (defined(DOUT30_PORT) && defined(DOUT30_BIT))
#define DOUT30 77
#define DOUT30_APB2EN (__rccapb2gpioen__(DOUT30_PORT))
#define DOUT30_GPIO (__gpio__(DOUT30_PORT))
#if (DOUT30_BIT < 8)
#define DOUT30_CROFF DOUT30_BIT
#define DOUT30_CR CRL
#else
#define DOUT30_CROFF (DOUT30_BIT & 0x07)
#define DOUT30_CR CRH
#endif
#define DIO77 77
#define DIO77_PORT DOUT30_PORT
#define DIO77_BIT DOUT30_BIT
#define DIO77_APB2EN DOUT30_APB2EN
#define DIO77_GPIO DOUT30_GPIO
#define DIO77_CR DOUT30_CR
#define DIO77_CROFF DOUT30_CROFF
#endif
#if (defined(DOUT31_PORT) && defined(DOUT31_BIT))
#define DOUT31 78
#define DOUT31_APB2EN (__rccapb2gpioen__(DOUT31_PORT))
#define DOUT31_GPIO (__gpio__(DOUT31_PORT))
#if (DOUT31_BIT < 8)
#define DOUT31_CROFF DOUT31_BIT
#define DOUT31_CR CRL
#else
#define DOUT31_CROFF (DOUT31_BIT & 0x07)
#define DOUT31_CR CRH
#endif
#define DIO78 78
#define DIO78_PORT DOUT31_PORT
#define DIO78_BIT DOUT31_BIT
#define DIO78_APB2EN DOUT31_APB2EN
#define DIO78_GPIO DOUT31_GPIO
#define DIO78_CR DOUT31_CR
#define DIO78_CROFF DOUT31_CROFF
#endif
#if (defined(DOUT32_PORT) && defined(DOUT32_BIT))
#define DOUT32 79
#define DOUT32_APB2EN (__rccapb2gpioen__(DOUT32_PORT))
#define DOUT32_GPIO (__gpio__(DOUT32_PORT))
#if (DOUT32_BIT < 8)
#define DOUT32_CROFF DOUT32_BIT
#define DOUT32_CR CRL
#else
#define DOUT32_CROFF (DOUT32_BIT & 0x07)
#define DOUT32_CR CRH
#endif
#define DIO79 79
#define DIO79_PORT DOUT32_PORT
#define DIO79_BIT DOUT32_BIT
#define DIO79_APB2EN DOUT32_APB2EN
#define DIO79_GPIO DOUT32_GPIO
#define DIO79_CR DOUT32_CR
#define DIO79_CROFF DOUT32_CROFF
#endif
#if (defined(DOUT33_PORT) && defined(DOUT33_BIT))
#define DOUT33 80
#define DOUT33_APB2EN (__rccapb2gpioen__(DOUT33_PORT))
#define DOUT33_GPIO (__gpio__(DOUT33_PORT))
#if (DOUT33_BIT < 8)
#define DOUT33_CROFF DOUT33_BIT
#define DOUT33_CR CRL
#else
#define DOUT33_CROFF (DOUT33_BIT & 0x07)
#define DOUT33_CR CRH
#endif
#define DIO80 80
#define DIO80_PORT DOUT33_PORT
#define DIO80_BIT DOUT33_BIT
#define DIO80_APB2EN DOUT33_APB2EN
#define DIO80_GPIO DOUT33_GPIO
#define DIO80_CR DOUT33_CR
#define DIO80_CROFF DOUT33_CROFF
#endif
#if (defined(DOUT34_PORT) && defined(DOUT34_BIT))
#define DOUT34 81
#define DOUT34_APB2EN (__rccapb2gpioen__(DOUT34_PORT))
#define DOUT34_GPIO (__gpio__(DOUT34_PORT))
#if (DOUT34_BIT < 8)
#define DOUT34_CROFF DOUT34_BIT
#define DOUT34_CR CRL
#else
#define DOUT34_CROFF (DOUT34_BIT & 0x07)
#define DOUT34_CR CRH
#endif
#define DIO81 81
#define DIO81_PORT DOUT34_PORT
#define DIO81_BIT DOUT34_BIT
#define DIO81_APB2EN DOUT34_APB2EN
#define DIO81_GPIO DOUT34_GPIO
#define DIO81_CR DOUT34_CR
#define DIO81_CROFF DOUT34_CROFF
#endif
#if (defined(DOUT35_PORT) && defined(DOUT35_BIT))
#define DOUT35 82
#define DOUT35_APB2EN (__rccapb2gpioen__(DOUT35_PORT))
#define DOUT35_GPIO (__gpio__(DOUT35_PORT))
#if (DOUT35_BIT < 8)
#define DOUT35_CROFF DOUT35_BIT
#define DOUT35_CR CRL
#else
#define DOUT35_CROFF (DOUT35_BIT & 0x07)
#define DOUT35_CR CRH
#endif
#define DIO82 82
#define DIO82_PORT DOUT35_PORT
#define DIO82_BIT DOUT35_BIT
#define DIO82_APB2EN DOUT35_APB2EN
#define DIO82_GPIO DOUT35_GPIO
#define DIO82_CR DOUT35_CR
#define DIO82_CROFF DOUT35_CROFF
#endif
#if (defined(DOUT36_PORT) && defined(DOUT36_BIT))
#define DOUT36 83
#define DOUT36_APB2EN (__rccapb2gpioen__(DOUT36_PORT))
#define DOUT36_GPIO (__gpio__(DOUT36_PORT))
#if (DOUT36_BIT < 8)
#define DOUT36_CROFF DOUT36_BIT
#define DOUT36_CR CRL
#else
#define DOUT36_CROFF (DOUT36_BIT & 0x07)
#define DOUT36_CR CRH
#endif
#define DIO83 83
#define DIO83_PORT DOUT36_PORT
#define DIO83_BIT DOUT36_BIT
#define DIO83_APB2EN DOUT36_APB2EN
#define DIO83_GPIO DOUT36_GPIO
#define DIO83_CR DOUT36_CR
#define DIO83_CROFF DOUT36_CROFF
#endif
#if (defined(DOUT37_PORT) && defined(DOUT37_BIT))
#define DOUT37 84
#define DOUT37_APB2EN (__rccapb2gpioen__(DOUT37_PORT))
#define DOUT37_GPIO (__gpio__(DOUT37_PORT))
#if (DOUT37_BIT < 8)
#define DOUT37_CROFF DOUT37_BIT
#define DOUT37_CR CRL
#else
#define DOUT37_CROFF (DOUT37_BIT & 0x07)
#define DOUT37_CR CRH
#endif
#define DIO84 84
#define DIO84_PORT DOUT37_PORT
#define DIO84_BIT DOUT37_BIT
#define DIO84_APB2EN DOUT37_APB2EN
#define DIO84_GPIO DOUT37_GPIO
#define DIO84_CR DOUT37_CR
#define DIO84_CROFF DOUT37_CROFF
#endif
#if (defined(DOUT38_PORT) && defined(DOUT38_BIT))
#define DOUT38 85
#define DOUT38_APB2EN (__rccapb2gpioen__(DOUT38_PORT))
#define DOUT38_GPIO (__gpio__(DOUT38_PORT))
#if (DOUT38_BIT < 8)
#define DOUT38_CROFF DOUT38_BIT
#define DOUT38_CR CRL
#else
#define DOUT38_CROFF (DOUT38_BIT & 0x07)
#define DOUT38_CR CRH
#endif
#define DIO85 85
#define DIO85_PORT DOUT38_PORT
#define DIO85_BIT DOUT38_BIT
