Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f1x/mcumap_stm32f1x.h
#define DIO85_APB2EN DOUT38_APB2EN
#define DIO85_GPIO DOUT38_GPIO
#define DIO85_CR DOUT38_CR
#define DIO85_CROFF DOUT38_CROFF
#endif
#if (defined(DOUT39_PORT) && defined(DOUT39_BIT))
#define DOUT39 86
#define DOUT39_APB2EN (__rccapb2gpioen__(DOUT39_PORT))
#define DOUT39_GPIO (__gpio__(DOUT39_PORT))
#if (DOUT39_BIT < 8)
#define DOUT39_CROFF DOUT39_BIT
#define DOUT39_CR CRL
#else
#define DOUT39_CROFF (DOUT39_BIT & 0x07)
#define DOUT39_CR CRH
#endif
#define DIO86 86
#define DIO86_PORT DOUT39_PORT
#define DIO86_BIT DOUT39_BIT
#define DIO86_APB2EN DOUT39_APB2EN
#define DIO86_GPIO DOUT39_GPIO
#define DIO86_CR DOUT39_CR
#define DIO86_CROFF DOUT39_CROFF
#endif
#if (defined(DOUT40_PORT) && defined(DOUT40_BIT))
#define DOUT40 87
#define DOUT40_APB2EN (__rccapb2gpioen__(DOUT40_PORT))
#define DOUT40_GPIO (__gpio__(DOUT40_PORT))
#if (DOUT40_BIT < 8)
#define DOUT40_CROFF DOUT40_BIT
#define DOUT40_CR CRL
#else
#define DOUT40_CROFF (DOUT40_BIT & 0x07)
#define DOUT40_CR CRH
#endif
#define DIO87 87
#define DIO87_PORT DOUT40_PORT
#define DIO87_BIT DOUT40_BIT
#define DIO87_APB2EN DOUT40_APB2EN
#define DIO87_GPIO DOUT40_GPIO
#define DIO87_CR DOUT40_CR
#define DIO87_CROFF DOUT40_CROFF
#endif
#if (defined(DOUT41_PORT) && defined(DOUT41_BIT))
#define DOUT41 88
#define DOUT41_APB2EN (__rccapb2gpioen__(DOUT41_PORT))
#define DOUT41_GPIO (__gpio__(DOUT41_PORT))
#if (DOUT41_BIT < 8)
#define DOUT41_CROFF DOUT41_BIT
#define DOUT41_CR CRL
#else
#define DOUT41_CROFF (DOUT41_BIT & 0x07)
#define DOUT41_CR CRH
#endif
#define DIO88 88
#define DIO88_PORT DOUT41_PORT
#define DIO88_BIT DOUT41_BIT
#define DIO88_APB2EN DOUT41_APB2EN
#define DIO88_GPIO DOUT41_GPIO
#define DIO88_CR DOUT41_CR
#define DIO88_CROFF DOUT41_CROFF
#endif
#if (defined(DOUT42_PORT) && defined(DOUT42_BIT))
#define DOUT42 89
#define DOUT42_APB2EN (__rccapb2gpioen__(DOUT42_PORT))
#define DOUT42_GPIO (__gpio__(DOUT42_PORT))
#if (DOUT42_BIT < 8)
#define DOUT42_CROFF DOUT42_BIT
#define DOUT42_CR CRL
#else
#define DOUT42_CROFF (DOUT42_BIT & 0x07)
#define DOUT42_CR CRH
#endif
#define DIO89 89
#define DIO89_PORT DOUT42_PORT
#define DIO89_BIT DOUT42_BIT
#define DIO89_APB2EN DOUT42_APB2EN
#define DIO89_GPIO DOUT42_GPIO
#define DIO89_CR DOUT42_CR
#define DIO89_CROFF DOUT42_CROFF
#endif
#if (defined(DOUT43_PORT) && defined(DOUT43_BIT))
#define DOUT43 90
#define DOUT43_APB2EN (__rccapb2gpioen__(DOUT43_PORT))
#define DOUT43_GPIO (__gpio__(DOUT43_PORT))
#if (DOUT43_BIT < 8)
#define DOUT43_CROFF DOUT43_BIT
#define DOUT43_CR CRL
#else
#define DOUT43_CROFF (DOUT43_BIT & 0x07)
#define DOUT43_CR CRH
#endif
#define DIO90 90
#define DIO90_PORT DOUT43_PORT
#define DIO90_BIT DOUT43_BIT
#define DIO90_APB2EN DOUT43_APB2EN
#define DIO90_GPIO DOUT43_GPIO
#define DIO90_CR DOUT43_CR
#define DIO90_CROFF DOUT43_CROFF
#endif
#if (defined(DOUT44_PORT) && defined(DOUT44_BIT))
#define DOUT44 91
#define DOUT44_APB2EN (__rccapb2gpioen__(DOUT44_PORT))
#define DOUT44_GPIO (__gpio__(DOUT44_PORT))
#if (DOUT44_BIT < 8)
#define DOUT44_CROFF DOUT44_BIT
#define DOUT44_CR CRL
#else
#define DOUT44_CROFF (DOUT44_BIT & 0x07)
#define DOUT44_CR CRH
#endif
#define DIO91 91
#define DIO91_PORT DOUT44_PORT
#define DIO91_BIT DOUT44_BIT
#define DIO91_APB2EN DOUT44_APB2EN
#define DIO91_GPIO DOUT44_GPIO
#define DIO91_CR DOUT44_CR
#define DIO91_CROFF DOUT44_CROFF
#endif
#if (defined(DOUT45_PORT) && defined(DOUT45_BIT))
#define DOUT45 92
#define DOUT45_APB2EN (__rccapb2gpioen__(DOUT45_PORT))
#define DOUT45_GPIO (__gpio__(DOUT45_PORT))
#if (DOUT45_BIT < 8)
#define DOUT45_CROFF DOUT45_BIT
#define DOUT45_CR CRL
#else
#define DOUT45_CROFF (DOUT45_BIT & 0x07)
#define DOUT45_CR CRH
#endif
#define DIO92 92
#define DIO92_PORT DOUT45_PORT
#define DIO92_BIT DOUT45_BIT
#define DIO92_APB2EN DOUT45_APB2EN
#define DIO92_GPIO DOUT45_GPIO
#define DIO92_CR DOUT45_CR
#define DIO92_CROFF DOUT45_CROFF
#endif
#if (defined(DOUT46_PORT) && defined(DOUT46_BIT))
#define DOUT46 93
#define DOUT46_APB2EN (__rccapb2gpioen__(DOUT46_PORT))
#define DOUT46_GPIO (__gpio__(DOUT46_PORT))
#if (DOUT46_BIT < 8)
#define DOUT46_CROFF DOUT46_BIT
#define DOUT46_CR CRL
#else
#define DOUT46_CROFF (DOUT46_BIT & 0x07)
#define DOUT46_CR CRH
#endif
#define DIO93 93
#define DIO93_PORT DOUT46_PORT
#define DIO93_BIT DOUT46_BIT
#define DIO93_APB2EN DOUT46_APB2EN
#define DIO93_GPIO DOUT46_GPIO
#define DIO93_CR DOUT46_CR
#define DIO93_CROFF DOUT46_CROFF
#endif
#if (defined(DOUT47_PORT) && defined(DOUT47_BIT))
#define DOUT47 94
#define DOUT47_APB2EN (__rccapb2gpioen__(DOUT47_PORT))
#define DOUT47_GPIO (__gpio__(DOUT47_PORT))
#if (DOUT47_BIT < 8)
#define DOUT47_CROFF DOUT47_BIT
#define DOUT47_CR CRL
#else
#define DOUT47_CROFF (DOUT47_BIT & 0x07)
#define DOUT47_CR CRH
#endif
#define DIO94 94
#define DIO94_PORT DOUT47_PORT
#define DIO94_BIT DOUT47_BIT
#define DIO94_APB2EN DOUT47_APB2EN
#define DIO94_GPIO DOUT47_GPIO
#define DIO94_CR DOUT47_CR
#define DIO94_CROFF DOUT47_CROFF
#endif
#if (defined(DOUT48_PORT) && defined(DOUT48_BIT))
#define DOUT48 95
#define DOUT48_APB2EN (__rccapb2gpioen__(DOUT48_PORT))
#define DOUT48_GPIO (__gpio__(DOUT48_PORT))
#if (DOUT48_BIT < 8)
#define DOUT48_CROFF DOUT48_BIT
#define DOUT48_CR CRL
#else
#define DOUT48_CROFF (DOUT48_BIT & 0x07)
#define DOUT48_CR CRH
#endif
#define DIO95 95
#define DIO95_PORT DOUT48_PORT
#define DIO95_BIT DOUT48_BIT
#define DIO95_APB2EN DOUT48_APB2EN
#define DIO95_GPIO DOUT48_GPIO
#define DIO95_CR DOUT48_CR
#define DIO95_CROFF DOUT48_CROFF
#endif
#if (defined(DOUT49_PORT) && defined(DOUT49_BIT))
#define DOUT49 96
#define DOUT49_APB2EN (__rccapb2gpioen__(DOUT49_PORT))
#define DOUT49_GPIO (__gpio__(DOUT49_PORT))
#if (DOUT49_BIT < 8)
#define DOUT49_CROFF DOUT49_BIT
#define DOUT49_CR CRL
#else
#define DOUT49_CROFF (DOUT49_BIT & 0x07)
#define DOUT49_CR CRH
#endif
#define DIO96 96
#define DIO96_PORT DOUT49_PORT
#define DIO96_BIT DOUT49_BIT
#define DIO96_APB2EN DOUT49_APB2EN
#define DIO96_GPIO DOUT49_GPIO
#define DIO96_CR DOUT49_CR
#define DIO96_CROFF DOUT49_CROFF
#endif
#if (defined(LIMIT_X_PORT) && defined(LIMIT_X_BIT))
#define LIMIT_X 100
#define LIMIT_X_APB2EN (__rccapb2gpioen__(LIMIT_X_PORT))
#define LIMIT_X_GPIO (__gpio__(LIMIT_X_PORT))
#if (LIMIT_X_BIT < 8)
#define LIMIT_X_CROFF LIMIT_X_BIT
#define LIMIT_X_CR CRL
#else
#define LIMIT_X_CROFF (LIMIT_X_BIT & 0x07)
#define LIMIT_X_CR CRH
#endif
#define DIO100 100
#define DIO100_PORT LIMIT_X_PORT
#define DIO100_BIT LIMIT_X_BIT
#define DIO100_APB2EN LIMIT_X_APB2EN
#define DIO100_GPIO LIMIT_X_GPIO
#define DIO100_CR LIMIT_X_CR
#define DIO100_CROFF LIMIT_X_CROFF
#endif
#if (defined(LIMIT_Y_PORT) && defined(LIMIT_Y_BIT))
#define LIMIT_Y 101
#define LIMIT_Y_APB2EN (__rccapb2gpioen__(LIMIT_Y_PORT))
#define LIMIT_Y_GPIO (__gpio__(LIMIT_Y_PORT))
#if (LIMIT_Y_BIT < 8)
#define LIMIT_Y_CROFF LIMIT_Y_BIT
#define LIMIT_Y_CR CRL
#else
#define LIMIT_Y_CROFF (LIMIT_Y_BIT & 0x07)
#define LIMIT_Y_CR CRH
#endif
#define DIO101 101
#define DIO101_PORT LIMIT_Y_PORT
#define DIO101_BIT LIMIT_Y_BIT
#define DIO101_APB2EN LIMIT_Y_APB2EN
#define DIO101_GPIO LIMIT_Y_GPIO
#define DIO101_CR LIMIT_Y_CR
#define DIO101_CROFF LIMIT_Y_CROFF
#endif
#if (defined(LIMIT_Z_PORT) && defined(LIMIT_Z_BIT))
#define LIMIT_Z 102
#define LIMIT_Z_APB2EN (__rccapb2gpioen__(LIMIT_Z_PORT))
#define LIMIT_Z_GPIO (__gpio__(LIMIT_Z_PORT))
#if (LIMIT_Z_BIT < 8)
#define LIMIT_Z_CROFF LIMIT_Z_BIT
#define LIMIT_Z_CR CRL
#else
#define LIMIT_Z_CROFF (LIMIT_Z_BIT & 0x07)
#define LIMIT_Z_CR CRH
#endif
#define DIO102 102
#define DIO102_PORT LIMIT_Z_PORT
#define DIO102_BIT LIMIT_Z_BIT
#define DIO102_APB2EN LIMIT_Z_APB2EN
#define DIO102_GPIO LIMIT_Z_GPIO
#define DIO102_CR LIMIT_Z_CR
#define DIO102_CROFF LIMIT_Z_CROFF
#endif
#if (defined(LIMIT_X2_PORT) && defined(LIMIT_X2_BIT))
#define LIMIT_X2 103
#define LIMIT_X2_APB2EN (__rccapb2gpioen__(LIMIT_X2_PORT))
#define LIMIT_X2_GPIO (__gpio__(LIMIT_X2_PORT))
#if (LIMIT_X2_BIT < 8)
#define LIMIT_X2_CROFF LIMIT_X2_BIT
#define LIMIT_X2_CR CRL
#else
#define LIMIT_X2_CROFF (LIMIT_X2_BIT & 0x07)
#define LIMIT_X2_CR CRH
#endif
#define DIO103 103
#define DIO103_PORT LIMIT_X2_PORT
#define DIO103_BIT LIMIT_X2_BIT
#define DIO103_APB2EN LIMIT_X2_APB2EN
#define DIO103_GPIO LIMIT_X2_GPIO
#define DIO103_CR LIMIT_X2_CR
#define DIO103_CROFF LIMIT_X2_CROFF
#endif
#if (defined(LIMIT_Y2_PORT) && defined(LIMIT_Y2_BIT))
#define LIMIT_Y2 104
#define LIMIT_Y2_APB2EN (__rccapb2gpioen__(LIMIT_Y2_PORT))
#define LIMIT_Y2_GPIO (__gpio__(LIMIT_Y2_PORT))
#if (LIMIT_Y2_BIT < 8)
#define LIMIT_Y2_CROFF LIMIT_Y2_BIT
#define LIMIT_Y2_CR CRL
#else
#define LIMIT_Y2_CROFF (LIMIT_Y2_BIT & 0x07)
#define LIMIT_Y2_CR CRH
#endif
#define DIO104 104
#define DIO104_PORT LIMIT_Y2_PORT
#define DIO104_BIT LIMIT_Y2_BIT
#define DIO104_APB2EN LIMIT_Y2_APB2EN
#define DIO104_GPIO LIMIT_Y2_GPIO
#define DIO104_CR LIMIT_Y2_CR
#define DIO104_CROFF LIMIT_Y2_CROFF
#endif
#if (defined(LIMIT_Z2_PORT) && defined(LIMIT_Z2_BIT))
#define LIMIT_Z2 105
#define LIMIT_Z2_APB2EN (__rccapb2gpioen__(LIMIT_Z2_PORT))
#define LIMIT_Z2_GPIO (__gpio__(LIMIT_Z2_PORT))
#if (LIMIT_Z2_BIT < 8)
#define LIMIT_Z2_CROFF LIMIT_Z2_BIT
#define LIMIT_Z2_CR CRL
#else
#define LIMIT_Z2_CROFF (LIMIT_Z2_BIT & 0x07)
#define LIMIT_Z2_CR CRH
#endif
#define DIO105 105
#define DIO105_PORT LIMIT_Z2_PORT
#define DIO105_BIT LIMIT_Z2_BIT
#define DIO105_APB2EN LIMIT_Z2_APB2EN
#define DIO105_GPIO LIMIT_Z2_GPIO
#define DIO105_CR LIMIT_Z2_CR
#define DIO105_CROFF LIMIT_Z2_CROFF
#endif
#if (defined(LIMIT_A_PORT) && defined(LIMIT_A_BIT))
#define LIMIT_A 106
#define LIMIT_A_APB2EN (__rccapb2gpioen__(LIMIT_A_PORT))
#define LIMIT_A_GPIO (__gpio__(LIMIT_A_PORT))
#if (LIMIT_A_BIT < 8)
#define LIMIT_A_CROFF LIMIT_A_BIT
#define LIMIT_A_CR CRL
#else
#define LIMIT_A_CROFF (LIMIT_A_BIT & 0x07)
#define LIMIT_A_CR CRH
#endif
#define DIO106 106
#define DIO106_PORT LIMIT_A_PORT
#define DIO106_BIT LIMIT_A_BIT
#define DIO106_APB2EN LIMIT_A_APB2EN
#define DIO106_GPIO LIMIT_A_GPIO
#define DIO106_CR LIMIT_A_CR
#define DIO106_CROFF LIMIT_A_CROFF
#endif
#if (defined(LIMIT_B_PORT) && defined(LIMIT_B_BIT))
#define LIMIT_B 107
#define LIMIT_B_APB2EN (__rccapb2gpioen__(LIMIT_B_PORT))
#define LIMIT_B_GPIO (__gpio__(LIMIT_B_PORT))
#if (LIMIT_B_BIT < 8)
#define LIMIT_B_CROFF LIMIT_B_BIT
#define LIMIT_B_CR CRL
#else
#define LIMIT_B_CROFF (LIMIT_B_BIT & 0x07)
#define LIMIT_B_CR CRH
#endif
#define DIO107 107
#define DIO107_PORT LIMIT_B_PORT
#define DIO107_BIT LIMIT_B_BIT
#define DIO107_APB2EN LIMIT_B_APB2EN
#define DIO107_GPIO LIMIT_B_GPIO
#define DIO107_CR LIMIT_B_CR
#define DIO107_CROFF LIMIT_B_CROFF
#endif
#if (defined(LIMIT_C_PORT) && defined(LIMIT_C_BIT))
#define LIMIT_C 108
#define LIMIT_C_APB2EN (__rccapb2gpioen__(LIMIT_C_PORT))
#define LIMIT_C_GPIO (__gpio__(LIMIT_C_PORT))
#if (LIMIT_C_BIT < 8)
#define LIMIT_C_CROFF LIMIT_C_BIT
#define LIMIT_C_CR CRL
#else
#define LIMIT_C_CROFF (LIMIT_C_BIT & 0x07)
#define LIMIT_C_CR CRH
#endif
#define DIO108 108
#define DIO108_PORT LIMIT_C_PORT
#define DIO108_BIT LIMIT_C_BIT
#define DIO108_APB2EN LIMIT_C_APB2EN
#define DIO108_GPIO LIMIT_C_GPIO
#define DIO108_CR LIMIT_C_CR
#define DIO108_CROFF LIMIT_C_CROFF
#endif
#if (defined(PROBE_PORT) && defined(PROBE_BIT))
#define PROBE 109
#define PROBE_APB2EN (__rccapb2gpioen__(PROBE_PORT))
#define PROBE_GPIO (__gpio__(PROBE_PORT))
#if (PROBE_BIT < 8)
#define PROBE_CROFF PROBE_BIT
#define PROBE_CR CRL
#else
#define PROBE_CROFF (PROBE_BIT & 0x07)
#define PROBE_CR CRH
#endif
#define DIO109 109
#define DIO109_PORT PROBE_PORT
#define DIO109_BIT PROBE_BIT
#define DIO109_APB2EN PROBE_APB2EN
#define DIO109_GPIO PROBE_GPIO
#define DIO109_CR PROBE_CR
#define DIO109_CROFF PROBE_CROFF
#endif
#if (defined(ESTOP_PORT) && defined(ESTOP_BIT))
#define ESTOP 110
#define ESTOP_APB2EN (__rccapb2gpioen__(ESTOP_PORT))
#define ESTOP_GPIO (__gpio__(ESTOP_PORT))
#if (ESTOP_BIT < 8)
#define ESTOP_CROFF ESTOP_BIT
#define ESTOP_CR CRL
#else
#define ESTOP_CROFF (ESTOP_BIT & 0x07)
#define ESTOP_CR CRH
#endif
#define DIO110 110
#define DIO110_PORT ESTOP_PORT
#define DIO110_BIT ESTOP_BIT
#define DIO110_APB2EN ESTOP_APB2EN
#define DIO110_GPIO ESTOP_GPIO
#define DIO110_CR ESTOP_CR
#define DIO110_CROFF ESTOP_CROFF
#endif
#if (defined(SAFETY_DOOR_PORT) && defined(SAFETY_DOOR_BIT))
#define SAFETY_DOOR 111
#define SAFETY_DOOR_APB2EN (__rccapb2gpioen__(SAFETY_DOOR_PORT))
#define SAFETY_DOOR_GPIO (__gpio__(SAFETY_DOOR_PORT))
#if (SAFETY_DOOR_BIT < 8)
#define SAFETY_DOOR_CROFF SAFETY_DOOR_BIT
#define SAFETY_DOOR_CR CRL
#else
#define SAFETY_DOOR_CROFF (SAFETY_DOOR_BIT & 0x07)
#define SAFETY_DOOR_CR CRH
#endif
#define DIO111 111
#define DIO111_PORT SAFETY_DOOR_PORT
#define DIO111_BIT SAFETY_DOOR_BIT
#define DIO111_APB2EN SAFETY_DOOR_APB2EN
#define DIO111_GPIO SAFETY_DOOR_GPIO
#define DIO111_CR SAFETY_DOOR_CR
#define DIO111_CROFF SAFETY_DOOR_CROFF
#endif
#if (defined(FHOLD_PORT) && defined(FHOLD_BIT))
#define FHOLD 112
#define FHOLD_APB2EN (__rccapb2gpioen__(FHOLD_PORT))
#define FHOLD_GPIO (__gpio__(FHOLD_PORT))
#if (FHOLD_BIT < 8)
#define FHOLD_CROFF FHOLD_BIT
#define FHOLD_CR CRL
#else
#define FHOLD_CROFF (FHOLD_BIT & 0x07)
#define FHOLD_CR CRH
#endif
#define DIO112 112
#define DIO112_PORT FHOLD_PORT
#define DIO112_BIT FHOLD_BIT
#define DIO112_APB2EN FHOLD_APB2EN
#define DIO112_GPIO FHOLD_GPIO
#define DIO112_CR FHOLD_CR
#define DIO112_CROFF FHOLD_CROFF
#endif
#if (defined(CS_RES_PORT) && defined(CS_RES_BIT))
#define CS_RES 113
#define CS_RES_APB2EN (__rccapb2gpioen__(CS_RES_PORT))
#define CS_RES_GPIO (__gpio__(CS_RES_PORT))
#if (CS_RES_BIT < 8)
#define CS_RES_CROFF CS_RES_BIT
#define CS_RES_CR CRL
#else
#define CS_RES_CROFF (CS_RES_BIT & 0x07)
#define CS_RES_CR CRH
#endif
#define DIO113 113
#define DIO113_PORT CS_RES_PORT
#define DIO113_BIT CS_RES_BIT
#define DIO113_APB2EN CS_RES_APB2EN
#define DIO113_GPIO CS_RES_GPIO
#define DIO113_CR CS_RES_CR
#define DIO113_CROFF CS_RES_CROFF
#endif
#if (defined(ANALOG0_PORT) && defined(ANALOG0_BIT))
#define ANALOG0 114
#define ANALOG0_APB2EN (__rccapb2gpioen__(ANALOG0_PORT))
#define ANALOG0_GPIO (__gpio__(ANALOG0_PORT))
#if (ANALOG0_BIT < 8)
#define ANALOG0_CROFF ANALOG0_BIT
#define ANALOG0_CR CRL
#else
#define ANALOG0_CROFF (ANALOG0_BIT & 0x07)
#define ANALOG0_CR CRH
#endif
#define DIO114 114
#define DIO114_PORT ANALOG0_PORT
#define DIO114_BIT ANALOG0_BIT
#define DIO114_APB2EN ANALOG0_APB2EN
#define DIO114_GPIO ANALOG0_GPIO
#define DIO114_CR ANALOG0_CR
#define DIO114_CROFF ANALOG0_CROFF
#endif
#if (defined(ANALOG1_PORT) && defined(ANALOG1_BIT))
#define ANALOG1 115
#define ANALOG1_APB2EN (__rccapb2gpioen__(ANALOG1_PORT))
#define ANALOG1_GPIO (__gpio__(ANALOG1_PORT))
#if (ANALOG1_BIT < 8)
#define ANALOG1_CROFF ANALOG1_BIT
#define ANALOG1_CR CRL
#else
#define ANALOG1_CROFF (ANALOG1_BIT & 0x07)
#define ANALOG1_CR CRH
#endif
#define DIO115 115
#define DIO115_PORT ANALOG1_PORT
#define DIO115_BIT ANALOG1_BIT
#define DIO115_APB2EN ANALOG1_APB2EN
#define DIO115_GPIO ANALOG1_GPIO
#define DIO115_CR ANALOG1_CR
#define DIO115_CROFF ANALOG1_CROFF
#endif
#if (defined(ANALOG2_PORT) && defined(ANALOG2_BIT))
#define ANALOG2 116
#define ANALOG2_APB2EN (__rccapb2gpioen__(ANALOG2_PORT))
#define ANALOG2_GPIO (__gpio__(ANALOG2_PORT))
#if (ANALOG2_BIT < 8)
#define ANALOG2_CROFF ANALOG2_BIT
#define ANALOG2_CR CRL
#else
#define ANALOG2_CROFF (ANALOG2_BIT & 0x07)
#define ANALOG2_CR CRH
#endif
#define DIO116 116
#define DIO116_PORT ANALOG2_PORT
#define DIO116_BIT ANALOG2_BIT
#define DIO116_APB2EN ANALOG2_APB2EN
#define DIO116_GPIO ANALOG2_GPIO
#define DIO116_CR ANALOG2_CR
#define DIO116_CROFF ANALOG2_CROFF
#endif
#if (defined(ANALOG3_PORT) && defined(ANALOG3_BIT))
#define ANALOG3 117
#define ANALOG3_APB2EN (__rccapb2gpioen__(ANALOG3_PORT))
#define ANALOG3_GPIO (__gpio__(ANALOG3_PORT))
#if (ANALOG3_BIT < 8)
#define ANALOG3_CROFF ANALOG3_BIT
#define ANALOG3_CR CRL
#else
#define ANALOG3_CROFF (ANALOG3_BIT & 0x07)
#define ANALOG3_CR CRH
#endif
#define DIO117 117
#define DIO117_PORT ANALOG3_PORT
#define DIO117_BIT ANALOG3_BIT
#define DIO117_APB2EN ANALOG3_APB2EN
#define DIO117_GPIO ANALOG3_GPIO
#define DIO117_CR ANALOG3_CR
#define DIO117_CROFF ANALOG3_CROFF
#endif
#if (defined(ANALOG4_PORT) && defined(ANALOG4_BIT))
#define ANALOG4 118
#define ANALOG4_APB2EN (__rccapb2gpioen__(ANALOG4_PORT))
#define ANALOG4_GPIO (__gpio__(ANALOG4_PORT))
#if (ANALOG4_BIT < 8)
#define ANALOG4_CROFF ANALOG4_BIT
#define ANALOG4_CR CRL
#else
#define ANALOG4_CROFF (ANALOG4_BIT & 0x07)
#define ANALOG4_CR CRH
#endif
#define DIO118 118
#define DIO118_PORT ANALOG4_PORT
#define DIO118_BIT ANALOG4_BIT
#define DIO118_APB2EN ANALOG4_APB2EN
#define DIO118_GPIO ANALOG4_GPIO
#define DIO118_CR ANALOG4_CR
#define DIO118_CROFF ANALOG4_CROFF
#endif
#if (defined(ANALOG5_PORT) && defined(ANALOG5_BIT))
#define ANALOG5 119
#define ANALOG5_APB2EN (__rccapb2gpioen__(ANALOG5_PORT))
#define ANALOG5_GPIO (__gpio__(ANALOG5_PORT))
#if (ANALOG5_BIT < 8)
#define ANALOG5_CROFF ANALOG5_BIT
#define ANALOG5_CR CRL
#else
#define ANALOG5_CROFF (ANALOG5_BIT & 0x07)
#define ANALOG5_CR CRH
#endif
#define DIO119 119
#define DIO119_PORT ANALOG5_PORT
#define DIO119_BIT ANALOG5_BIT
#define DIO119_APB2EN ANALOG5_APB2EN
#define DIO119_GPIO ANALOG5_GPIO
#define DIO119_CR ANALOG5_CR
#define DIO119_CROFF ANALOG5_CROFF
#endif
#if (defined(ANALOG6_PORT) && defined(ANALOG6_BIT))
#define ANALOG6 120
#define ANALOG6_APB2EN (__rccapb2gpioen__(ANALOG6_PORT))
#define ANALOG6_GPIO (__gpio__(ANALOG6_PORT))
#if (ANALOG6_BIT < 8)
#define ANALOG6_CROFF ANALOG6_BIT
#define ANALOG6_CR CRL
#else
#define ANALOG6_CROFF (ANALOG6_BIT & 0x07)
#define ANALOG6_CR CRH
#endif
#define DIO120 120
#define DIO120_PORT ANALOG6_PORT
#define DIO120_BIT ANALOG6_BIT
#define DIO120_APB2EN ANALOG6_APB2EN
#define DIO120_GPIO ANALOG6_GPIO
#define DIO120_CR ANALOG6_CR
#define DIO120_CROFF ANALOG6_CROFF
#endif
#if (defined(ANALOG7_PORT) && defined(ANALOG7_BIT))
#define ANALOG7 121
#define ANALOG7_APB2EN (__rccapb2gpioen__(ANALOG7_PORT))
#define ANALOG7_GPIO (__gpio__(ANALOG7_PORT))
#if (ANALOG7_BIT < 8)
#define ANALOG7_CROFF ANALOG7_BIT
#define ANALOG7_CR CRL
#else
#define ANALOG7_CROFF (ANALOG7_BIT & 0x07)
#define ANALOG7_CR CRH
#endif
#define DIO121 121
#define DIO121_PORT ANALOG7_PORT
#define DIO121_BIT ANALOG7_BIT
#define DIO121_APB2EN ANALOG7_APB2EN
#define DIO121_GPIO ANALOG7_GPIO
#define DIO121_CR ANALOG7_CR
#define DIO121_CROFF ANALOG7_CROFF
#endif
#if (defined(ANALOG8_PORT) && defined(ANALOG8_BIT))
#define ANALOG8 122
#define ANALOG8_APB2EN (__rccapb2gpioen__(ANALOG8_PORT))
#define ANALOG8_GPIO (__gpio__(ANALOG8_PORT))
#if (ANALOG8_BIT < 8)
#define ANALOG8_CROFF ANALOG8_BIT
#define ANALOG8_CR CRL
#else
#define ANALOG8_CROFF (ANALOG8_BIT & 0x07)
#define ANALOG8_CR CRH
#endif
#define DIO122 122
#define DIO122_PORT ANALOG8_PORT
#define DIO122_BIT ANALOG8_BIT
#define DIO122_APB2EN ANALOG8_APB2EN
#define DIO122_GPIO ANALOG8_GPIO
#define DIO122_CR ANALOG8_CR
#define DIO122_CROFF ANALOG8_CROFF
#endif
#if (defined(ANALOG9_PORT) && defined(ANALOG9_BIT))
#define ANALOG9 123
#define ANALOG9_APB2EN (__rccapb2gpioen__(ANALOG9_PORT))
#define ANALOG9_GPIO (__gpio__(ANALOG9_PORT))
#if (ANALOG9_BIT < 8)
#define ANALOG9_CROFF ANALOG9_BIT
#define ANALOG9_CR CRL
#else
#define ANALOG9_CROFF (ANALOG9_BIT & 0x07)
#define ANALOG9_CR CRH
#endif
#define DIO123 123
#define DIO123_PORT ANALOG9_PORT
#define DIO123_BIT ANALOG9_BIT
#define DIO123_APB2EN ANALOG9_APB2EN
#define DIO123_GPIO ANALOG9_GPIO
#define DIO123_CR ANALOG9_CR
#define DIO123_CROFF ANALOG9_CROFF
#endif
#if (defined(ANALOG10_PORT) && defined(ANALOG10_BIT))
#define ANALOG10 124
#define ANALOG10_APB2EN (__rccapb2gpioen__(ANALOG10_PORT))
#define ANALOG10_GPIO (__gpio__(ANALOG10_PORT))
#if (ANALOG10_BIT < 8)
#define ANALOG10_CROFF ANALOG10_BIT
#define ANALOG10_CR CRL
#else
#define ANALOG10_CROFF (ANALOG10_BIT & 0x07)
#define ANALOG10_CR CRH
#endif
#define DIO124 124
#define DIO124_PORT ANALOG10_PORT
#define DIO124_BIT ANALOG10_BIT
#define DIO124_APB2EN ANALOG10_APB2EN
#define DIO124_GPIO ANALOG10_GPIO
#define DIO124_CR ANALOG10_CR
#define DIO124_CROFF ANALOG10_CROFF
#endif
#if (defined(ANALOG11_PORT) && defined(ANALOG11_BIT))
#define ANALOG11 125
#define ANALOG11_APB2EN (__rccapb2gpioen__(ANALOG11_PORT))
#define ANALOG11_GPIO (__gpio__(ANALOG11_PORT))
#if (ANALOG11_BIT < 8)
#define ANALOG11_CROFF ANALOG11_BIT
#define ANALOG11_CR CRL
#else
#define ANALOG11_CROFF (ANALOG11_BIT & 0x07)
#define ANALOG11_CR CRH
#endif
#define DIO125 125
#define DIO125_PORT ANALOG11_PORT
#define DIO125_BIT ANALOG11_BIT
#define DIO125_APB2EN ANALOG11_APB2EN
#define DIO125_GPIO ANALOG11_GPIO
#define DIO125_CR ANALOG11_CR
#define DIO125_CROFF ANALOG11_CROFF
#endif
#if (defined(ANALOG12_PORT) && defined(ANALOG12_BIT))
#define ANALOG12 126
#define ANALOG12_APB2EN (__rccapb2gpioen__(ANALOG12_PORT))
#define ANALOG12_GPIO (__gpio__(ANALOG12_PORT))
#if (ANALOG12_BIT < 8)
#define ANALOG12_CROFF ANALOG12_BIT
#define ANALOG12_CR CRL
#else
#define ANALOG12_CROFF (ANALOG12_BIT & 0x07)
#define ANALOG12_CR CRH
#endif
#define DIO126 126
#define DIO126_PORT ANALOG12_PORT
#define DIO126_BIT ANALOG12_BIT
#define DIO126_APB2EN ANALOG12_APB2EN
#define DIO126_GPIO ANALOG12_GPIO
#define DIO126_CR ANALOG12_CR
#define DIO126_CROFF ANALOG12_CROFF
#endif
#if (defined(ANALOG13_PORT) && defined(ANALOG13_BIT))
#define ANALOG13 127
#define ANALOG13_APB2EN (__rccapb2gpioen__(ANALOG13_PORT))
#define ANALOG13_GPIO (__gpio__(ANALOG13_PORT))
#if (ANALOG13_BIT < 8)
#define ANALOG13_CROFF ANALOG13_BIT
#define ANALOG13_CR CRL
#else
#define ANALOG13_CROFF (ANALOG13_BIT & 0x07)
#define ANALOG13_CR CRH
#endif
#define DIO127 127
#define DIO127_PORT ANALOG13_PORT
#define DIO127_BIT ANALOG13_BIT
#define DIO127_APB2EN ANALOG13_APB2EN
#define DIO127_GPIO ANALOG13_GPIO
#define DIO127_CR ANALOG13_CR
#define DIO127_CROFF ANALOG13_CROFF
#endif
#if (defined(ANALOG14_PORT) && defined(ANALOG14_BIT))
#define ANALOG14 128
#define ANALOG14_APB2EN (__rccapb2gpioen__(ANALOG14_PORT))
#define ANALOG14_GPIO (__gpio__(ANALOG14_PORT))
#if (ANALOG14_BIT < 8)
#define ANALOG14_CROFF ANALOG14_BIT
#define ANALOG14_CR CRL
#else
#define ANALOG14_CROFF (ANALOG14_BIT & 0x07)
#define ANALOG14_CR CRH
#endif
#define DIO128 128
#define DIO128_PORT ANALOG14_PORT
#define DIO128_BIT ANALOG14_BIT
#define DIO128_APB2EN ANALOG14_APB2EN
#define DIO128_GPIO ANALOG14_GPIO
#define DIO128_CR ANALOG14_CR
#define DIO128_CROFF ANALOG14_CROFF
#endif
#if (defined(ANALOG15_PORT) && defined(ANALOG15_BIT))
#define ANALOG15 129
#define ANALOG15_APB2EN (__rccapb2gpioen__(ANALOG15_PORT))
#define ANALOG15_GPIO (__gpio__(ANALOG15_PORT))
#if (ANALOG15_BIT < 8)
#define ANALOG15_CROFF ANALOG15_BIT
#define ANALOG15_CR CRL
#else
#define ANALOG15_CROFF (ANALOG15_BIT & 0x07)
#define ANALOG15_CR CRH
#endif
#define DIO129 129
#define DIO129_PORT ANALOG15_PORT
#define DIO129_BIT ANALOG15_BIT
#define DIO129_APB2EN ANALOG15_APB2EN
#define DIO129_GPIO ANALOG15_GPIO
#define DIO129_CR ANALOG15_CR
#define DIO129_CROFF ANALOG15_CROFF
#endif
#if (defined(DIN0_PORT) && defined(DIN0_BIT))
#define DIN0 130
#define DIN0_APB2EN (__rccapb2gpioen__(DIN0_PORT))
#define DIN0_GPIO (__gpio__(DIN0_PORT))
#if (DIN0_BIT < 8)
#define DIN0_CROFF DIN0_BIT
#define DIN0_CR CRL
#else
#define DIN0_CROFF (DIN0_BIT & 0x07)
#define DIN0_CR CRH
#endif
#define DIO130 130
#define DIO130_PORT DIN0_PORT
#define DIO130_BIT DIN0_BIT
#define DIO130_APB2EN DIN0_APB2EN
#define DIO130_GPIO DIN0_GPIO
#define DIO130_CR DIN0_CR
#define DIO130_CROFF DIN0_CROFF
#endif
#if (defined(DIN1_PORT) && defined(DIN1_BIT))
#define DIN1 131
#define DIN1_APB2EN (__rccapb2gpioen__(DIN1_PORT))
#define DIN1_GPIO (__gpio__(DIN1_PORT))
#if (DIN1_BIT < 8)
#define DIN1_CROFF DIN1_BIT
#define DIN1_CR CRL
#else
#define DIN1_CROFF (DIN1_BIT & 0x07)
#define DIN1_CR CRH
#endif
#define DIO131 131
#define DIO131_PORT DIN1_PORT
#define DIO131_BIT DIN1_BIT
#define DIO131_APB2EN DIN1_APB2EN
#define DIO131_GPIO DIN1_GPIO
#define DIO131_CR DIN1_CR
#define DIO131_CROFF DIN1_CROFF
#endif
#if (defined(DIN2_PORT) && defined(DIN2_BIT))
#define DIN2 132
#define DIN2_APB2EN (__rccapb2gpioen__(DIN2_PORT))
#define DIN2_GPIO (__gpio__(DIN2_PORT))
#if (DIN2_BIT < 8)
#define DIN2_CROFF DIN2_BIT
#define DIN2_CR CRL
#else
