Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f1x/mcumap_stm32f1x.h
#define DIN2_CROFF (DIN2_BIT & 0x07)
#define DIN2_CR CRH
#endif
#define DIO132 132
#define DIO132_PORT DIN2_PORT
#define DIO132_BIT DIN2_BIT
#define DIO132_APB2EN DIN2_APB2EN
#define DIO132_GPIO DIN2_GPIO
#define DIO132_CR DIN2_CR
#define DIO132_CROFF DIN2_CROFF
#endif
#if (defined(DIN3_PORT) && defined(DIN3_BIT))
#define DIN3 133
#define DIN3_APB2EN (__rccapb2gpioen__(DIN3_PORT))
#define DIN3_GPIO (__gpio__(DIN3_PORT))
#if (DIN3_BIT < 8)
#define DIN3_CROFF DIN3_BIT
#define DIN3_CR CRL
#else
#define DIN3_CROFF (DIN3_BIT & 0x07)
#define DIN3_CR CRH
#endif
#define DIO133 133
#define DIO133_PORT DIN3_PORT
#define DIO133_BIT DIN3_BIT
#define DIO133_APB2EN DIN3_APB2EN
#define DIO133_GPIO DIN3_GPIO
#define DIO133_CR DIN3_CR
#define DIO133_CROFF DIN3_CROFF
#endif
#if (defined(DIN4_PORT) && defined(DIN4_BIT))
#define DIN4 134
#define DIN4_APB2EN (__rccapb2gpioen__(DIN4_PORT))
#define DIN4_GPIO (__gpio__(DIN4_PORT))
#if (DIN4_BIT < 8)
#define DIN4_CROFF DIN4_BIT
#define DIN4_CR CRL
#else
#define DIN4_CROFF (DIN4_BIT & 0x07)
#define DIN4_CR CRH
#endif
#define DIO134 134
#define DIO134_PORT DIN4_PORT
#define DIO134_BIT DIN4_BIT
#define DIO134_APB2EN DIN4_APB2EN
#define DIO134_GPIO DIN4_GPIO
#define DIO134_CR DIN4_CR
#define DIO134_CROFF DIN4_CROFF
#endif
#if (defined(DIN5_PORT) && defined(DIN5_BIT))
#define DIN5 135
#define DIN5_APB2EN (__rccapb2gpioen__(DIN5_PORT))
#define DIN5_GPIO (__gpio__(DIN5_PORT))
#if (DIN5_BIT < 8)
#define DIN5_CROFF DIN5_BIT
#define DIN5_CR CRL
#else
#define DIN5_CROFF (DIN5_BIT & 0x07)
#define DIN5_CR CRH
#endif
#define DIO135 135
#define DIO135_PORT DIN5_PORT
#define DIO135_BIT DIN5_BIT
#define DIO135_APB2EN DIN5_APB2EN
#define DIO135_GPIO DIN5_GPIO
#define DIO135_CR DIN5_CR
#define DIO135_CROFF DIN5_CROFF
#endif
#if (defined(DIN6_PORT) && defined(DIN6_BIT))
#define DIN6 136
#define DIN6_APB2EN (__rccapb2gpioen__(DIN6_PORT))
#define DIN6_GPIO (__gpio__(DIN6_PORT))
#if (DIN6_BIT < 8)
#define DIN6_CROFF DIN6_BIT
#define DIN6_CR CRL
#else
#define DIN6_CROFF (DIN6_BIT & 0x07)
#define DIN6_CR CRH
#endif
#define DIO136 136
#define DIO136_PORT DIN6_PORT
#define DIO136_BIT DIN6_BIT
#define DIO136_APB2EN DIN6_APB2EN
#define DIO136_GPIO DIN6_GPIO
#define DIO136_CR DIN6_CR
#define DIO136_CROFF DIN6_CROFF
#endif
#if (defined(DIN7_PORT) && defined(DIN7_BIT))
#define DIN7 137
#define DIN7_APB2EN (__rccapb2gpioen__(DIN7_PORT))
#define DIN7_GPIO (__gpio__(DIN7_PORT))
#if (DIN7_BIT < 8)
#define DIN7_CROFF DIN7_BIT
#define DIN7_CR CRL
#else
#define DIN7_CROFF (DIN7_BIT & 0x07)
#define DIN7_CR CRH
#endif
#define DIO137 137
#define DIO137_PORT DIN7_PORT
#define DIO137_BIT DIN7_BIT
#define DIO137_APB2EN DIN7_APB2EN
#define DIO137_GPIO DIN7_GPIO
#define DIO137_CR DIN7_CR
#define DIO137_CROFF DIN7_CROFF
#endif
#if (defined(DIN8_PORT) && defined(DIN8_BIT))
#define DIN8 138
#define DIN8_APB2EN (__rccapb2gpioen__(DIN8_PORT))
#define DIN8_GPIO (__gpio__(DIN8_PORT))
#if (DIN8_BIT < 8)
#define DIN8_CROFF DIN8_BIT
#define DIN8_CR CRL
#else
#define DIN8_CROFF (DIN8_BIT & 0x07)
#define DIN8_CR CRH
#endif
#define DIO138 138
#define DIO138_PORT DIN8_PORT
#define DIO138_BIT DIN8_BIT
#define DIO138_APB2EN DIN8_APB2EN
#define DIO138_GPIO DIN8_GPIO
#define DIO138_CR DIN8_CR
#define DIO138_CROFF DIN8_CROFF
#endif
#if (defined(DIN9_PORT) && defined(DIN9_BIT))
#define DIN9 139
#define DIN9_APB2EN (__rccapb2gpioen__(DIN9_PORT))
#define DIN9_GPIO (__gpio__(DIN9_PORT))
#if (DIN9_BIT < 8)
#define DIN9_CROFF DIN9_BIT
#define DIN9_CR CRL
#else
#define DIN9_CROFF (DIN9_BIT & 0x07)
#define DIN9_CR CRH
#endif
#define DIO139 139
#define DIO139_PORT DIN9_PORT
#define DIO139_BIT DIN9_BIT
#define DIO139_APB2EN DIN9_APB2EN
#define DIO139_GPIO DIN9_GPIO
#define DIO139_CR DIN9_CR
#define DIO139_CROFF DIN9_CROFF
#endif
#if (defined(DIN10_PORT) && defined(DIN10_BIT))
#define DIN10 140
#define DIN10_APB2EN (__rccapb2gpioen__(DIN10_PORT))
#define DIN10_GPIO (__gpio__(DIN10_PORT))
#if (DIN10_BIT < 8)
#define DIN10_CROFF DIN10_BIT
#define DIN10_CR CRL
#else
#define DIN10_CROFF (DIN10_BIT & 0x07)
#define DIN10_CR CRH
#endif
#define DIO140 140
#define DIO140_PORT DIN10_PORT
#define DIO140_BIT DIN10_BIT
#define DIO140_APB2EN DIN10_APB2EN
#define DIO140_GPIO DIN10_GPIO
#define DIO140_CR DIN10_CR
#define DIO140_CROFF DIN10_CROFF
#endif
#if (defined(DIN11_PORT) && defined(DIN11_BIT))
#define DIN11 141
#define DIN11_APB2EN (__rccapb2gpioen__(DIN11_PORT))
#define DIN11_GPIO (__gpio__(DIN11_PORT))
#if (DIN11_BIT < 8)
#define DIN11_CROFF DIN11_BIT
#define DIN11_CR CRL
#else
#define DIN11_CROFF (DIN11_BIT & 0x07)
#define DIN11_CR CRH
#endif
#define DIO141 141
#define DIO141_PORT DIN11_PORT
#define DIO141_BIT DIN11_BIT
#define DIO141_APB2EN DIN11_APB2EN
#define DIO141_GPIO DIN11_GPIO
#define DIO141_CR DIN11_CR
#define DIO141_CROFF DIN11_CROFF
#endif
#if (defined(DIN12_PORT) && defined(DIN12_BIT))
#define DIN12 142
#define DIN12_APB2EN (__rccapb2gpioen__(DIN12_PORT))
#define DIN12_GPIO (__gpio__(DIN12_PORT))
#if (DIN12_BIT < 8)
#define DIN12_CROFF DIN12_BIT
#define DIN12_CR CRL
#else
#define DIN12_CROFF (DIN12_BIT & 0x07)
#define DIN12_CR CRH
#endif
#define DIO142 142
#define DIO142_PORT DIN12_PORT
#define DIO142_BIT DIN12_BIT
#define DIO142_APB2EN DIN12_APB2EN
#define DIO142_GPIO DIN12_GPIO
#define DIO142_CR DIN12_CR
#define DIO142_CROFF DIN12_CROFF
#endif
#if (defined(DIN13_PORT) && defined(DIN13_BIT))
#define DIN13 143
#define DIN13_APB2EN (__rccapb2gpioen__(DIN13_PORT))
#define DIN13_GPIO (__gpio__(DIN13_PORT))
#if (DIN13_BIT < 8)
#define DIN13_CROFF DIN13_BIT
#define DIN13_CR CRL
#else
#define DIN13_CROFF (DIN13_BIT & 0x07)
#define DIN13_CR CRH
#endif
#define DIO143 143
#define DIO143_PORT DIN13_PORT
#define DIO143_BIT DIN13_BIT
#define DIO143_APB2EN DIN13_APB2EN
#define DIO143_GPIO DIN13_GPIO
#define DIO143_CR DIN13_CR
#define DIO143_CROFF DIN13_CROFF
#endif
#if (defined(DIN14_PORT) && defined(DIN14_BIT))
#define DIN14 144
#define DIN14_APB2EN (__rccapb2gpioen__(DIN14_PORT))
#define DIN14_GPIO (__gpio__(DIN14_PORT))
#if (DIN14_BIT < 8)
#define DIN14_CROFF DIN14_BIT
#define DIN14_CR CRL
#else
#define DIN14_CROFF (DIN14_BIT & 0x07)
#define DIN14_CR CRH
#endif
#define DIO144 144
#define DIO144_PORT DIN14_PORT
#define DIO144_BIT DIN14_BIT
#define DIO144_APB2EN DIN14_APB2EN
#define DIO144_GPIO DIN14_GPIO
#define DIO144_CR DIN14_CR
#define DIO144_CROFF DIN14_CROFF
#endif
#if (defined(DIN15_PORT) && defined(DIN15_BIT))
#define DIN15 145
#define DIN15_APB2EN (__rccapb2gpioen__(DIN15_PORT))
#define DIN15_GPIO (__gpio__(DIN15_PORT))
#if (DIN15_BIT < 8)
#define DIN15_CROFF DIN15_BIT
#define DIN15_CR CRL
#else
#define DIN15_CROFF (DIN15_BIT & 0x07)
#define DIN15_CR CRH
#endif
#define DIO145 145
#define DIO145_PORT DIN15_PORT
#define DIO145_BIT DIN15_BIT
#define DIO145_APB2EN DIN15_APB2EN
#define DIO145_GPIO DIN15_GPIO
#define DIO145_CR DIN15_CR
#define DIO145_CROFF DIN15_CROFF
#endif
#if (defined(DIN16_PORT) && defined(DIN16_BIT))
#define DIN16 146
#define DIN16_APB2EN (__rccapb2gpioen__(DIN16_PORT))
#define DIN16_GPIO (__gpio__(DIN16_PORT))
#if (DIN16_BIT < 8)
#define DIN16_CROFF DIN16_BIT
#define DIN16_CR CRL
#else
#define DIN16_CROFF (DIN16_BIT & 0x07)
#define DIN16_CR CRH
#endif
#define DIO146 146
#define DIO146_PORT DIN16_PORT
#define DIO146_BIT DIN16_BIT
#define DIO146_APB2EN DIN16_APB2EN
#define DIO146_GPIO DIN16_GPIO
#define DIO146_CR DIN16_CR
#define DIO146_CROFF DIN16_CROFF
#endif
#if (defined(DIN17_PORT) && defined(DIN17_BIT))
#define DIN17 147
#define DIN17_APB2EN (__rccapb2gpioen__(DIN17_PORT))
#define DIN17_GPIO (__gpio__(DIN17_PORT))
#if (DIN17_BIT < 8)
#define DIN17_CROFF DIN17_BIT
#define DIN17_CR CRL
#else
#define DIN17_CROFF (DIN17_BIT & 0x07)
#define DIN17_CR CRH
#endif
#define DIO147 147
#define DIO147_PORT DIN17_PORT
#define DIO147_BIT DIN17_BIT
#define DIO147_APB2EN DIN17_APB2EN
#define DIO147_GPIO DIN17_GPIO
#define DIO147_CR DIN17_CR
#define DIO147_CROFF DIN17_CROFF
#endif
#if (defined(DIN18_PORT) && defined(DIN18_BIT))
#define DIN18 148
#define DIN18_APB2EN (__rccapb2gpioen__(DIN18_PORT))
#define DIN18_GPIO (__gpio__(DIN18_PORT))
#if (DIN18_BIT < 8)
#define DIN18_CROFF DIN18_BIT
#define DIN18_CR CRL
#else
#define DIN18_CROFF (DIN18_BIT & 0x07)
#define DIN18_CR CRH
#endif
#define DIO148 148
#define DIO148_PORT DIN18_PORT
#define DIO148_BIT DIN18_BIT
#define DIO148_APB2EN DIN18_APB2EN
#define DIO148_GPIO DIN18_GPIO
#define DIO148_CR DIN18_CR
#define DIO148_CROFF DIN18_CROFF
#endif
#if (defined(DIN19_PORT) && defined(DIN19_BIT))
#define DIN19 149
#define DIN19_APB2EN (__rccapb2gpioen__(DIN19_PORT))
#define DIN19_GPIO (__gpio__(DIN19_PORT))
#if (DIN19_BIT < 8)
#define DIN19_CROFF DIN19_BIT
#define DIN19_CR CRL
#else
#define DIN19_CROFF (DIN19_BIT & 0x07)
#define DIN19_CR CRH
#endif
#define DIO149 149
#define DIO149_PORT DIN19_PORT
#define DIO149_BIT DIN19_BIT
#define DIO149_APB2EN DIN19_APB2EN
#define DIO149_GPIO DIN19_GPIO
#define DIO149_CR DIN19_CR
#define DIO149_CROFF DIN19_CROFF
#endif
#if (defined(DIN20_PORT) && defined(DIN20_BIT))
#define DIN20 150
#define DIN20_APB2EN (__rccapb2gpioen__(DIN20_PORT))
#define DIN20_GPIO (__gpio__(DIN20_PORT))
#if (DIN20_BIT < 8)
#define DIN20_CROFF DIN20_BIT
#define DIN20_CR CRL
#else
#define DIN20_CROFF (DIN20_BIT & 0x07)
#define DIN20_CR CRH
#endif
#define DIO150 150
#define DIO150_PORT DIN20_PORT
#define DIO150_BIT DIN20_BIT
#define DIO150_APB2EN DIN20_APB2EN
#define DIO150_GPIO DIN20_GPIO
#define DIO150_CR DIN20_CR
#define DIO150_CROFF DIN20_CROFF
#endif
#if (defined(DIN21_PORT) && defined(DIN21_BIT))
#define DIN21 151
#define DIN21_APB2EN (__rccapb2gpioen__(DIN21_PORT))
#define DIN21_GPIO (__gpio__(DIN21_PORT))
#if (DIN21_BIT < 8)
#define DIN21_CROFF DIN21_BIT
#define DIN21_CR CRL
#else
#define DIN21_CROFF (DIN21_BIT & 0x07)
#define DIN21_CR CRH
#endif
#define DIO151 151
#define DIO151_PORT DIN21_PORT
#define DIO151_BIT DIN21_BIT
#define DIO151_APB2EN DIN21_APB2EN
#define DIO151_GPIO DIN21_GPIO
#define DIO151_CR DIN21_CR
#define DIO151_CROFF DIN21_CROFF
#endif
#if (defined(DIN22_PORT) && defined(DIN22_BIT))
#define DIN22 152
#define DIN22_APB2EN (__rccapb2gpioen__(DIN22_PORT))
#define DIN22_GPIO (__gpio__(DIN22_PORT))
#if (DIN22_BIT < 8)
#define DIN22_CROFF DIN22_BIT
#define DIN22_CR CRL
#else
#define DIN22_CROFF (DIN22_BIT & 0x07)
#define DIN22_CR CRH
#endif
#define DIO152 152
#define DIO152_PORT DIN22_PORT
#define DIO152_BIT DIN22_BIT
#define DIO152_APB2EN DIN22_APB2EN
#define DIO152_GPIO DIN22_GPIO
#define DIO152_CR DIN22_CR
#define DIO152_CROFF DIN22_CROFF
#endif
#if (defined(DIN23_PORT) && defined(DIN23_BIT))
#define DIN23 153
#define DIN23_APB2EN (__rccapb2gpioen__(DIN23_PORT))
#define DIN23_GPIO (__gpio__(DIN23_PORT))
#if (DIN23_BIT < 8)
#define DIN23_CROFF DIN23_BIT
#define DIN23_CR CRL
#else
#define DIN23_CROFF (DIN23_BIT & 0x07)
#define DIN23_CR CRH
#endif
#define DIO153 153
#define DIO153_PORT DIN23_PORT
#define DIO153_BIT DIN23_BIT
#define DIO153_APB2EN DIN23_APB2EN
#define DIO153_GPIO DIN23_GPIO
#define DIO153_CR DIN23_CR
#define DIO153_CROFF DIN23_CROFF
#endif
#if (defined(DIN24_PORT) && defined(DIN24_BIT))
#define DIN24 154
#define DIN24_APB2EN (__rccapb2gpioen__(DIN24_PORT))
#define DIN24_GPIO (__gpio__(DIN24_PORT))
#if (DIN24_BIT < 8)
#define DIN24_CROFF DIN24_BIT
#define DIN24_CR CRL
#else
#define DIN24_CROFF (DIN24_BIT & 0x07)
#define DIN24_CR CRH
#endif
#define DIO154 154
#define DIO154_PORT DIN24_PORT
#define DIO154_BIT DIN24_BIT
#define DIO154_APB2EN DIN24_APB2EN
#define DIO154_GPIO DIN24_GPIO
#define DIO154_CR DIN24_CR
#define DIO154_CROFF DIN24_CROFF
#endif
#if (defined(DIN25_PORT) && defined(DIN25_BIT))
#define DIN25 155
#define DIN25_APB2EN (__rccapb2gpioen__(DIN25_PORT))
#define DIN25_GPIO (__gpio__(DIN25_PORT))
#if (DIN25_BIT < 8)
#define DIN25_CROFF DIN25_BIT
#define DIN25_CR CRL
#else
#define DIN25_CROFF (DIN25_BIT & 0x07)
#define DIN25_CR CRH
#endif
#define DIO155 155
#define DIO155_PORT DIN25_PORT
#define DIO155_BIT DIN25_BIT
#define DIO155_APB2EN DIN25_APB2EN
#define DIO155_GPIO DIN25_GPIO
#define DIO155_CR DIN25_CR
#define DIO155_CROFF DIN25_CROFF
#endif
#if (defined(DIN26_PORT) && defined(DIN26_BIT))
#define DIN26 156
#define DIN26_APB2EN (__rccapb2gpioen__(DIN26_PORT))
#define DIN26_GPIO (__gpio__(DIN26_PORT))
#if (DIN26_BIT < 8)
#define DIN26_CROFF DIN26_BIT
#define DIN26_CR CRL
#else
#define DIN26_CROFF (DIN26_BIT & 0x07)
#define DIN26_CR CRH
#endif
#define DIO156 156
#define DIO156_PORT DIN26_PORT
#define DIO156_BIT DIN26_BIT
#define DIO156_APB2EN DIN26_APB2EN
#define DIO156_GPIO DIN26_GPIO
#define DIO156_CR DIN26_CR
#define DIO156_CROFF DIN26_CROFF
#endif
#if (defined(DIN27_PORT) && defined(DIN27_BIT))
#define DIN27 157
#define DIN27_APB2EN (__rccapb2gpioen__(DIN27_PORT))
#define DIN27_GPIO (__gpio__(DIN27_PORT))
#if (DIN27_BIT < 8)
#define DIN27_CROFF DIN27_BIT
#define DIN27_CR CRL
#else
#define DIN27_CROFF (DIN27_BIT & 0x07)
#define DIN27_CR CRH
#endif
#define DIO157 157
#define DIO157_PORT DIN27_PORT
#define DIO157_BIT DIN27_BIT
#define DIO157_APB2EN DIN27_APB2EN
#define DIO157_GPIO DIN27_GPIO
#define DIO157_CR DIN27_CR
#define DIO157_CROFF DIN27_CROFF
#endif
#if (defined(DIN28_PORT) && defined(DIN28_BIT))
#define DIN28 158
#define DIN28_APB2EN (__rccapb2gpioen__(DIN28_PORT))
#define DIN28_GPIO (__gpio__(DIN28_PORT))
#if (DIN28_BIT < 8)
#define DIN28_CROFF DIN28_BIT
#define DIN28_CR CRL
#else
#define DIN28_CROFF (DIN28_BIT & 0x07)
#define DIN28_CR CRH
#endif
#define DIO158 158
#define DIO158_PORT DIN28_PORT
#define DIO158_BIT DIN28_BIT
#define DIO158_APB2EN DIN28_APB2EN
#define DIO158_GPIO DIN28_GPIO
#define DIO158_CR DIN28_CR
#define DIO158_CROFF DIN28_CROFF
#endif
#if (defined(DIN29_PORT) && defined(DIN29_BIT))
#define DIN29 159
#define DIN29_APB2EN (__rccapb2gpioen__(DIN29_PORT))
#define DIN29_GPIO (__gpio__(DIN29_PORT))
#if (DIN29_BIT < 8)
#define DIN29_CROFF DIN29_BIT
#define DIN29_CR CRL
#else
#define DIN29_CROFF (DIN29_BIT & 0x07)
#define DIN29_CR CRH
#endif
#define DIO159 159
#define DIO159_PORT DIN29_PORT
#define DIO159_BIT DIN29_BIT
#define DIO159_APB2EN DIN29_APB2EN
#define DIO159_GPIO DIN29_GPIO
#define DIO159_CR DIN29_CR
#define DIO159_CROFF DIN29_CROFF
#endif
#if (defined(DIN30_PORT) && defined(DIN30_BIT))
#define DIN30 160
#define DIN30_APB2EN (__rccapb2gpioen__(DIN30_PORT))
#define DIN30_GPIO (__gpio__(DIN30_PORT))
#if (DIN30_BIT < 8)
#define DIN30_CROFF DIN30_BIT
#define DIN30_CR CRL
#else
#define DIN30_CROFF (DIN30_BIT & 0x07)
#define DIN30_CR CRH
#endif
#define DIO160 160
#define DIO160_PORT DIN30_PORT
#define DIO160_BIT DIN30_BIT
#define DIO160_APB2EN DIN30_APB2EN
#define DIO160_GPIO DIN30_GPIO
#define DIO160_CR DIN30_CR
#define DIO160_CROFF DIN30_CROFF
#endif
#if (defined(DIN31_PORT) && defined(DIN31_BIT))
#define DIN31 161
#define DIN31_APB2EN (__rccapb2gpioen__(DIN31_PORT))
#define DIN31_GPIO (__gpio__(DIN31_PORT))
#if (DIN31_BIT < 8)
#define DIN31_CROFF DIN31_BIT
#define DIN31_CR CRL
#else
#define DIN31_CROFF (DIN31_BIT & 0x07)
#define DIN31_CR CRH
#endif
#define DIO161 161
#define DIO161_PORT DIN31_PORT
#define DIO161_BIT DIN31_BIT
#define DIO161_APB2EN DIN31_APB2EN
#define DIO161_GPIO DIN31_GPIO
#define DIO161_CR DIN31_CR
#define DIO161_CROFF DIN31_CROFF
#endif
#if (defined(DIN32_PORT) && defined(DIN32_BIT))
#define DIN32 162
#define DIN32_APB2EN (__rccapb2gpioen__(DIN32_PORT))
#define DIN32_GPIO (__gpio__(DIN32_PORT))
#if (DIN32_BIT < 8)
#define DIN32_CROFF DIN32_BIT
#define DIN32_CR CRL
#else
#define DIN32_CROFF (DIN32_BIT & 0x07)
#define DIN32_CR CRH
#endif
#define DIO162 162
#define DIO162_PORT DIN32_PORT
#define DIO162_BIT DIN32_BIT
#define DIO162_APB2EN DIN32_APB2EN
#define DIO162_GPIO DIN32_GPIO
#define DIO162_CR DIN32_CR
#define DIO162_CROFF DIN32_CROFF
#endif
#if (defined(DIN33_PORT) && defined(DIN33_BIT))
#define DIN33 163
#define DIN33_APB2EN (__rccapb2gpioen__(DIN33_PORT))
#define DIN33_GPIO (__gpio__(DIN33_PORT))
#if (DIN33_BIT < 8)
#define DIN33_CROFF DIN33_BIT
#define DIN33_CR CRL
#else
#define DIN33_CROFF (DIN33_BIT & 0x07)
#define DIN33_CR CRH
#endif
#define DIO163 163
#define DIO163_PORT DIN33_PORT
#define DIO163_BIT DIN33_BIT
#define DIO163_APB2EN DIN33_APB2EN
#define DIO163_GPIO DIN33_GPIO
#define DIO163_CR DIN33_CR
#define DIO163_CROFF DIN33_CROFF
#endif
#if (defined(DIN34_PORT) && defined(DIN34_BIT))
#define DIN34 164
#define DIN34_APB2EN (__rccapb2gpioen__(DIN34_PORT))
#define DIN34_GPIO (__gpio__(DIN34_PORT))
#if (DIN34_BIT < 8)
#define DIN34_CROFF DIN34_BIT
#define DIN34_CR CRL
#else
#define DIN34_CROFF (DIN34_BIT & 0x07)
#define DIN34_CR CRH
#endif
#define DIO164 164
#define DIO164_PORT DIN34_PORT
#define DIO164_BIT DIN34_BIT
#define DIO164_APB2EN DIN34_APB2EN
#define DIO164_GPIO DIN34_GPIO
#define DIO164_CR DIN34_CR
#define DIO164_CROFF DIN34_CROFF
#endif
#if (defined(DIN35_PORT) && defined(DIN35_BIT))
#define DIN35 165
#define DIN35_APB2EN (__rccapb2gpioen__(DIN35_PORT))
#define DIN35_GPIO (__gpio__(DIN35_PORT))
#if (DIN35_BIT < 8)
#define DIN35_CROFF DIN35_BIT
#define DIN35_CR CRL
#else
#define DIN35_CROFF (DIN35_BIT & 0x07)
#define DIN35_CR CRH
#endif
#define DIO165 165
#define DIO165_PORT DIN35_PORT
#define DIO165_BIT DIN35_BIT
#define DIO165_APB2EN DIN35_APB2EN
#define DIO165_GPIO DIN35_GPIO
#define DIO165_CR DIN35_CR
#define DIO165_CROFF DIN35_CROFF
#endif
#if (defined(DIN36_PORT) && defined(DIN36_BIT))
#define DIN36 166
#define DIN36_APB2EN (__rccapb2gpioen__(DIN36_PORT))
#define DIN36_GPIO (__gpio__(DIN36_PORT))
#if (DIN36_BIT < 8)
#define DIN36_CROFF DIN36_BIT
#define DIN36_CR CRL
#else
#define DIN36_CROFF (DIN36_BIT & 0x07)
#define DIN36_CR CRH
#endif
#define DIO166 166
#define DIO166_PORT DIN36_PORT
#define DIO166_BIT DIN36_BIT
#define DIO166_APB2EN DIN36_APB2EN
#define DIO166_GPIO DIN36_GPIO
#define DIO166_CR DIN36_CR
#define DIO166_CROFF DIN36_CROFF
#endif
#if (defined(DIN37_PORT) && defined(DIN37_BIT))
#define DIN37 167
#define DIN37_APB2EN (__rccapb2gpioen__(DIN37_PORT))
#define DIN37_GPIO (__gpio__(DIN37_PORT))
#if (DIN37_BIT < 8)
#define DIN37_CROFF DIN37_BIT
#define DIN37_CR CRL
#else
#define DIN37_CROFF (DIN37_BIT & 0x07)
#define DIN37_CR CRH
#endif
#define DIO167 167
#define DIO167_PORT DIN37_PORT
#define DIO167_BIT DIN37_BIT
#define DIO167_APB2EN DIN37_APB2EN
#define DIO167_GPIO DIN37_GPIO
#define DIO167_CR DIN37_CR
#define DIO167_CROFF DIN37_CROFF
#endif
#if (defined(DIN38_PORT) && defined(DIN38_BIT))
#define DIN38 168
#define DIN38_APB2EN (__rccapb2gpioen__(DIN38_PORT))
#define DIN38_GPIO (__gpio__(DIN38_PORT))
#if (DIN38_BIT < 8)
#define DIN38_CROFF DIN38_BIT
#define DIN38_CR CRL
#else
#define DIN38_CROFF (DIN38_BIT & 0x07)
#define DIN38_CR CRH
#endif
#define DIO168 168
#define DIO168_PORT DIN38_PORT
#define DIO168_BIT DIN38_BIT
#define DIO168_APB2EN DIN38_APB2EN
#define DIO168_GPIO DIN38_GPIO
#define DIO168_CR DIN38_CR
#define DIO168_CROFF DIN38_CROFF
#endif
#if (defined(DIN39_PORT) && defined(DIN39_BIT))
#define DIN39 169
#define DIN39_APB2EN (__rccapb2gpioen__(DIN39_PORT))
#define DIN39_GPIO (__gpio__(DIN39_PORT))
#if (DIN39_BIT < 8)
#define DIN39_CROFF DIN39_BIT
#define DIN39_CR CRL
#else
#define DIN39_CROFF (DIN39_BIT & 0x07)
#define DIN39_CR CRH
#endif
#define DIO169 169
#define DIO169_PORT DIN39_PORT
#define DIO169_BIT DIN39_BIT
#define DIO169_APB2EN DIN39_APB2EN
#define DIO169_GPIO DIN39_GPIO
#define DIO169_CR DIN39_CR
#define DIO169_CROFF DIN39_CROFF
#endif
#if (defined(DIN40_PORT) && defined(DIN40_BIT))
#define DIN40 170
#define DIN40_APB2EN (__rccapb2gpioen__(DIN40_PORT))
#define DIN40_GPIO (__gpio__(DIN40_PORT))
#if (DIN40_BIT < 8)
#define DIN40_CROFF DIN40_BIT
#define DIN40_CR CRL
#else
#define DIN40_CROFF (DIN40_BIT & 0x07)
#define DIN40_CR CRH
#endif
#define DIO170 170
#define DIO170_PORT DIN40_PORT
#define DIO170_BIT DIN40_BIT
#define DIO170_APB2EN DIN40_APB2EN
#define DIO170_GPIO DIN40_GPIO
#define DIO170_CR DIN40_CR
#define DIO170_CROFF DIN40_CROFF
#endif
#if (defined(DIN41_PORT) && defined(DIN41_BIT))
#define DIN41 171
#define DIN41_APB2EN (__rccapb2gpioen__(DIN41_PORT))
#define DIN41_GPIO (__gpio__(DIN41_PORT))
#if (DIN41_BIT < 8)
#define DIN41_CROFF DIN41_BIT
#define DIN41_CR CRL
#else
#define DIN41_CROFF (DIN41_BIT & 0x07)
#define DIN41_CR CRH
#endif
#define DIO171 171
#define DIO171_PORT DIN41_PORT
#define DIO171_BIT DIN41_BIT
#define DIO171_APB2EN DIN41_APB2EN
#define DIO171_GPIO DIN41_GPIO
#define DIO171_CR DIN41_CR
#define DIO171_CROFF DIN41_CROFF
#endif
#if (defined(DIN42_PORT) && defined(DIN42_BIT))
#define DIN42 172
#define DIN42_APB2EN (__rccapb2gpioen__(DIN42_PORT))
#define DIN42_GPIO (__gpio__(DIN42_PORT))
#if (DIN42_BIT < 8)
#define DIN42_CROFF DIN42_BIT
#define DIN42_CR CRL
#else
#define DIN42_CROFF (DIN42_BIT & 0x07)
#define DIN42_CR CRH
#endif
#define DIO172 172
#define DIO172_PORT DIN42_PORT
#define DIO172_BIT DIN42_BIT
#define DIO172_APB2EN DIN42_APB2EN
#define DIO172_GPIO DIN42_GPIO
#define DIO172_CR DIN42_CR
#define DIO172_CROFF DIN42_CROFF
#endif
#if (defined(DIN43_PORT) && defined(DIN43_BIT))
#define DIN43 173
#define DIN43_APB2EN (__rccapb2gpioen__(DIN43_PORT))
#define DIN43_GPIO (__gpio__(DIN43_PORT))
#if (DIN43_BIT < 8)
#define DIN43_CROFF DIN43_BIT
#define DIN43_CR CRL
#else
#define DIN43_CROFF (DIN43_BIT & 0x07)
#define DIN43_CR CRH
#endif
#define DIO173 173
#define DIO173_PORT DIN43_PORT
#define DIO173_BIT DIN43_BIT
#define DIO173_APB2EN DIN43_APB2EN
#define DIO173_GPIO DIN43_GPIO
#define DIO173_CR DIN43_CR
#define DIO173_CROFF DIN43_CROFF
#endif
#if (defined(DIN44_PORT) && defined(DIN44_BIT))
#define DIN44 174
#define DIN44_APB2EN (__rccapb2gpioen__(DIN44_PORT))
#define DIN44_GPIO (__gpio__(DIN44_PORT))
#if (DIN44_BIT < 8)
#define DIN44_CROFF DIN44_BIT
#define DIN44_CR CRL
#else
#define DIN44_CROFF (DIN44_BIT & 0x07)
#define DIN44_CR CRH
#endif
#define DIO174 174
#define DIO174_PORT DIN44_PORT
#define DIO174_BIT DIN44_BIT
#define DIO174_APB2EN DIN44_APB2EN
#define DIO174_GPIO DIN44_GPIO
#define DIO174_CR DIN44_CR
#define DIO174_CROFF DIN44_CROFF
#endif
#if (defined(DIN45_PORT) && defined(DIN45_BIT))
#define DIN45 175
#define DIN45_APB2EN (__rccapb2gpioen__(DIN45_PORT))
#define DIN45_GPIO (__gpio__(DIN45_PORT))
#if (DIN45_BIT < 8)
#define DIN45_CROFF DIN45_BIT
#define DIN45_CR CRL
#else
#define DIN45_CROFF (DIN45_BIT & 0x07)
#define DIN45_CR CRH
#endif
#define DIO175 175
#define DIO175_PORT DIN45_PORT
#define DIO175_BIT DIN45_BIT
#define DIO175_APB2EN DIN45_APB2EN
#define DIO175_GPIO DIN45_GPIO
#define DIO175_CR DIN45_CR
#define DIO175_CROFF DIN45_CROFF
#endif
#if (defined(DIN46_PORT) && defined(DIN46_BIT))
#define DIN46 176
#define DIN46_APB2EN (__rccapb2gpioen__(DIN46_PORT))
#define DIN46_GPIO (__gpio__(DIN46_PORT))
#if (DIN46_BIT < 8)
#define DIN46_CROFF DIN46_BIT
#define DIN46_CR CRL
#else
#define DIN46_CROFF (DIN46_BIT & 0x07)
#define DIN46_CR CRH
#endif
#define DIO176 176
#define DIO176_PORT DIN46_PORT
#define DIO176_BIT DIN46_BIT
#define DIO176_APB2EN DIN46_APB2EN
#define DIO176_GPIO DIN46_GPIO
#define DIO176_CR DIN46_CR
#define DIO176_CROFF DIN46_CROFF
#endif
#if (defined(DIN47_PORT) && defined(DIN47_BIT))
#define DIN47 177
#define DIN47_APB2EN (__rccapb2gpioen__(DIN47_PORT))
#define DIN47_GPIO (__gpio__(DIN47_PORT))
#if (DIN47_BIT < 8)
#define DIN47_CROFF DIN47_BIT
#define DIN47_CR CRL
#else
#define DIN47_CROFF (DIN47_BIT & 0x07)
#define DIN47_CR CRH
#endif
#define DIO177 177
#define DIO177_PORT DIN47_PORT
#define DIO177_BIT DIN47_BIT
#define DIO177_APB2EN DIN47_APB2EN
#define DIO177_GPIO DIN47_GPIO
#define DIO177_CR DIN47_CR
#define DIO177_CROFF DIN47_CROFF
#endif
#if (defined(DIN48_PORT) && defined(DIN48_BIT))
#define DIN48 178
#define DIN48_APB2EN (__rccapb2gpioen__(DIN48_PORT))
#define DIN48_GPIO (__gpio__(DIN48_PORT))
#if (DIN48_BIT < 8)
#define DIN48_CROFF DIN48_BIT
#define DIN48_CR CRL
#else
#define DIN48_CROFF (DIN48_BIT & 0x07)
#define DIN48_CR CRH
#endif
#define DIO178 178
#define DIO178_PORT DIN48_PORT
#define DIO178_BIT DIN48_BIT
#define DIO178_APB2EN DIN48_APB2EN
#define DIO178_GPIO DIN48_GPIO
#define DIO178_CR DIN48_CR
#define DIO178_CROFF DIN48_CROFF
#endif
#if (defined(DIN49_PORT) && defined(DIN49_BIT))
#define DIN49 179
