Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f1x/mcumap_stm32f1x.h
#define DIN49_APB2EN (__rccapb2gpioen__(DIN49_PORT))
#define DIN49_GPIO (__gpio__(DIN49_PORT))
#if (DIN49_BIT < 8)
#define DIN49_CROFF DIN49_BIT
#define DIN49_CR CRL
#else
#define DIN49_CROFF (DIN49_BIT & 0x07)
#define DIN49_CR CRH
#endif
#define DIO179 179
#define DIO179_PORT DIN49_PORT
#define DIO179_BIT DIN49_BIT
#define DIO179_APB2EN DIN49_APB2EN
#define DIO179_GPIO DIN49_GPIO
#define DIO179_CR DIN49_CR
#define DIO179_CROFF DIN49_CROFF
#endif
#if (defined(TX_PORT) && defined(TX_BIT))
#define TX 200
#define TX_APB2EN (__rccapb2gpioen__(TX_PORT))
#define TX_GPIO (__gpio__(TX_PORT))
#if (TX_BIT < 8)
#define TX_CROFF TX_BIT
#define TX_CR CRL
#else
#define TX_CROFF (TX_BIT & 0x07)
#define TX_CR CRH
#endif
#define DIO200 200
#define DIO200_PORT TX_PORT
#define DIO200_BIT TX_BIT
#define DIO200_APB2EN TX_APB2EN
#define DIO200_GPIO TX_GPIO
#define DIO200_CR TX_CR
#define DIO200_CROFF TX_CROFF
#endif
#if (defined(RX_PORT) && defined(RX_BIT))
#define RX 201
#define RX_APB2EN (__rccapb2gpioen__(RX_PORT))
#define RX_GPIO (__gpio__(RX_PORT))
#if (RX_BIT < 8)
#define RX_CROFF RX_BIT
#define RX_CR CRL
#else
#define RX_CROFF (RX_BIT & 0x07)
#define RX_CR CRH
#endif
#define DIO201 201
#define DIO201_PORT RX_PORT
#define DIO201_BIT RX_BIT
#define DIO201_APB2EN RX_APB2EN
#define DIO201_GPIO RX_GPIO
#define DIO201_CR RX_CR
#define DIO201_CROFF RX_CROFF
#endif
#if (defined(USB_DM_PORT) && defined(USB_DM_BIT))
#define USB_DM 202
#define USB_DM_APB2EN (__rccapb2gpioen__(USB_DM_PORT))
#define USB_DM_GPIO (__gpio__(USB_DM_PORT))
#if (USB_DM_BIT < 8)
#define USB_DM_CROFF USB_DM_BIT
#define USB_DM_CR CRL
#else
#define USB_DM_CROFF (USB_DM_BIT & 0x07)
#define USB_DM_CR CRH
#endif
#define DIO202 202
#define DIO202_PORT USB_DM_PORT
#define DIO202_BIT USB_DM_BIT
#define DIO202_APB2EN USB_DM_APB2EN
#define DIO202_GPIO USB_DM_GPIO
#define DIO202_CR USB_DM_CR
#define DIO202_CROFF USB_DM_CROFF
#endif
#if (defined(USB_DP_PORT) && defined(USB_DP_BIT))
#define USB_DP 203
#define USB_DP_APB2EN (__rccapb2gpioen__(USB_DP_PORT))
#define USB_DP_GPIO (__gpio__(USB_DP_PORT))
#if (USB_DP_BIT < 8)
#define USB_DP_CROFF USB_DP_BIT
#define USB_DP_CR CRL
#else
#define USB_DP_CROFF (USB_DP_BIT & 0x07)
#define USB_DP_CR CRH
#endif
#define DIO203 203
#define DIO203_PORT USB_DP_PORT
#define DIO203_BIT USB_DP_BIT
#define DIO203_APB2EN USB_DP_APB2EN
#define DIO203_GPIO USB_DP_GPIO
#define DIO203_CR USB_DP_CR
#define DIO203_CROFF USB_DP_CROFF
#endif
#if (defined(SPI_CLK_PORT) && defined(SPI_CLK_BIT))
#define SPI_CLK 204
#define SPI_CLK_APB2EN (__rccapb2gpioen__(SPI_CLK_PORT))
#define SPI_CLK_GPIO (__gpio__(SPI_CLK_PORT))
#if (SPI_CLK_BIT < 8)
#define SPI_CLK_CROFF SPI_CLK_BIT
#define SPI_CLK_CR CRL
#else
#define SPI_CLK_CROFF (SPI_CLK_BIT & 0x07)
#define SPI_CLK_CR CRH
#endif
#define DIO204 204
#define DIO204_PORT SPI_CLK_PORT
#define DIO204_BIT SPI_CLK_BIT
#define DIO204_APB2EN SPI_CLK_APB2EN
#define DIO204_GPIO SPI_CLK_GPIO
#define DIO204_CR SPI_CLK_CR
#define DIO204_CROFF SPI_CLK_CROFF
#endif
#if (defined(SPI_SDI_PORT) && defined(SPI_SDI_BIT))
#define SPI_SDI 205
#define SPI_SDI_APB2EN (__rccapb2gpioen__(SPI_SDI_PORT))
#define SPI_SDI_GPIO (__gpio__(SPI_SDI_PORT))
#if (SPI_SDI_BIT < 8)
#define SPI_SDI_CROFF SPI_SDI_BIT
#define SPI_SDI_CR CRL
#else
#define SPI_SDI_CROFF (SPI_SDI_BIT & 0x07)
#define SPI_SDI_CR CRH
#endif
#define DIO205 205
#define DIO205_PORT SPI_SDI_PORT
#define DIO205_BIT SPI_SDI_BIT
#define DIO205_APB2EN SPI_SDI_APB2EN
#define DIO205_GPIO SPI_SDI_GPIO
#define DIO205_CR SPI_SDI_CR
#define DIO205_CROFF SPI_SDI_CROFF
#endif
#if (defined(SPI_SDO_PORT) && defined(SPI_SDO_BIT))
#define SPI_SDO 206
#define SPI_SDO_APB2EN (__rccapb2gpioen__(SPI_SDO_PORT))
#define SPI_SDO_GPIO (__gpio__(SPI_SDO_PORT))
#if (SPI_SDO_BIT < 8)
#define SPI_SDO_CROFF SPI_SDO_BIT
#define SPI_SDO_CR CRL
#else
#define SPI_SDO_CROFF (SPI_SDO_BIT & 0x07)
#define SPI_SDO_CR CRH
#endif
#define DIO206 206
#define DIO206_PORT SPI_SDO_PORT
#define DIO206_BIT SPI_SDO_BIT
#define DIO206_APB2EN SPI_SDO_APB2EN
#define DIO206_GPIO SPI_SDO_GPIO
#define DIO206_CR SPI_SDO_CR
#define DIO206_CROFF SPI_SDO_CROFF
#endif
#if (defined(SPI_CS_PORT) && defined(SPI_CS_BIT))
#define SPI_CS 207
#define SPI_CS_APB2EN (__rccapb2gpioen__(SPI_CS_PORT))
#define SPI_CS_GPIO (__gpio__(SPI_CS_PORT))
#if (SPI_CS_BIT < 8)
#define SPI_CS_CROFF SPI_CS_BIT
#define SPI_CS_CR CRL
#else
#define SPI_CS_CROFF (SPI_CS_BIT & 0x07)
#define SPI_CS_CR CRH
#endif
#define DIO207 207
#define DIO207_PORT SPI_CS_PORT
#define DIO207_BIT SPI_CS_BIT
#define DIO207_APB2EN SPI_CS_APB2EN
#define DIO207_GPIO SPI_CS_GPIO
#define DIO207_CR SPI_CS_CR
#define DIO207_CROFF SPI_CS_CROFF
#endif
#if (defined(I2C_CLK_PORT) && defined(I2C_CLK_BIT))
#define I2C_CLK 208
#define I2C_CLK_APB2EN (__rccapb2gpioen__(I2C_CLK_PORT))
#define I2C_CLK_GPIO (__gpio__(I2C_CLK_PORT))
#if (I2C_CLK_BIT < 8)
#define I2C_CLK_CROFF I2C_CLK_BIT
#define I2C_CLK_CR CRL
#else
#define I2C_CLK_CROFF (I2C_CLK_BIT & 0x07)
#define I2C_CLK_CR CRH
#endif
#define DIO208 208
#define DIO208_PORT I2C_CLK_PORT
#define DIO208_BIT I2C_CLK_BIT
#define DIO208_APB2EN I2C_CLK_APB2EN
#define DIO208_GPIO I2C_CLK_GPIO
#define DIO208_CR I2C_CLK_CR
#define DIO208_CROFF I2C_CLK_CROFF
#endif
#if (defined(I2C_DATA_PORT) && defined(I2C_DATA_BIT))
#define I2C_DATA 209
#define I2C_DATA_APB2EN (__rccapb2gpioen__(I2C_DATA_PORT))
#define I2C_DATA_GPIO (__gpio__(I2C_DATA_PORT))
#if (I2C_DATA_BIT < 8)
#define I2C_DATA_CROFF I2C_DATA_BIT
#define I2C_DATA_CR CRL
#else
#define I2C_DATA_CROFF (I2C_DATA_BIT & 0x07)
#define I2C_DATA_CR CRH
#endif
#define DIO209 209
#define DIO209_PORT I2C_DATA_PORT
#define DIO209_BIT I2C_DATA_BIT
#define DIO209_APB2EN I2C_DATA_APB2EN
#define DIO209_GPIO I2C_DATA_GPIO
#define DIO209_CR I2C_DATA_CR
#define DIO209_CROFF I2C_DATA_CROFF
#endif
#if (defined(TX2_PORT) && defined(TX2_BIT))
#define TX2 210
#define TX2_APB2EN (__rccapb2gpioen__(TX2_PORT))
#define TX2_GPIO (__gpio__(TX2_PORT))
#if (TX2_BIT < 8)
#define TX2_CROFF TX2_BIT
#define TX2_CR CRL
#else
#define TX2_CROFF (TX2_BIT & 0x07)
#define TX2_CR CRH
#endif
#define DIO210 210
#define DIO210_PORT TX2_PORT
#define DIO210_BIT TX2_BIT
#define DIO210_APB2EN TX2_APB2EN
#define DIO210_GPIO TX2_GPIO
#define DIO210_CR TX2_CR
#define DIO210_CROFF TX2_CROFF
#endif
#if (defined(RX2_PORT) && defined(RX2_BIT))
#define RX2 211
#define RX2_APB2EN (__rccapb2gpioen__(RX2_PORT))
#define RX2_GPIO (__gpio__(RX2_PORT))
#if (RX2_BIT < 8)
#define RX2_CROFF RX2_BIT
#define RX2_CR CRL
#else
#define RX2_CROFF (RX2_BIT & 0x07)
#define RX2_CR CRH
#endif
#define DIO211 211
#define DIO211_PORT RX2_PORT
#define DIO211_BIT RX2_BIT
#define DIO211_APB2EN RX2_APB2EN
#define DIO211_GPIO RX2_GPIO
#define DIO211_CR RX2_CR
#define DIO211_CROFF RX2_CROFF
#endif
#if (defined(SPI2_CLK_PORT) && defined(SPI2_CLK_BIT))
#define SPI2_CLK 212
#define SPI2_CLK_APB2EN (__rccapb2gpioen__(SPI2_CLK_PORT))
#define SPI2_CLK_GPIO (__gpio__(SPI2_CLK_PORT))
#if (SPI2_CLK_BIT < 8)
#define SPI2_CLK_CROFF SPI2_CLK_BIT
#define SPI2_CLK_CR CRL
#else
#define SPI2_CLK_CROFF (SPI2_CLK_BIT & 0x07)
#define SPI2_CLK_CR CRH
#endif
#define DIO212 212
#define DIO212_PORT SPI2_CLK_PORT
#define DIO212_BIT SPI2_CLK_BIT
#define DIO212_APB2EN SPI2_CLK_APB2EN
#define DIO212_GPIO SPI2_CLK_GPIO
#define DIO212_CR SPI2_CLK_CR
#define DIO212_CROFF SPI2_CLK_CROFF
#endif
#if (defined(SPI2_SDI_PORT) && defined(SPI2_SDI_BIT))
#define SPI2_SDI 213
#define SPI2_SDI_APB2EN (__rccapb2gpioen__(SPI2_SDI_PORT))
#define SPI2_SDI_GPIO (__gpio__(SPI2_SDI_PORT))
#if (SPI2_SDI_BIT < 8)
#define SPI2_SDI_CROFF SPI2_SDI_BIT
#define SPI2_SDI_CR CRL
#else
#define SPI2_SDI_CROFF (SPI2_SDI_BIT & 0x07)
#define SPI2_SDI_CR CRH
#endif
#define DIO213 213
#define DIO213_PORT SPI2_SDI_PORT
#define DIO213_BIT SPI2_SDI_BIT
#define DIO213_APB2EN SPI2_SDI_APB2EN
#define DIO213_GPIO SPI2_SDI_GPIO
#define DIO213_CR SPI2_SDI_CR
#define DIO213_CROFF SPI2_SDI_CROFF
#endif
#if (defined(SPI2_SDO_PORT) && defined(SPI2_SDO_BIT))
#define SPI2_SDO 214
#define SPI2_SDO_APB2EN (__rccapb2gpioen__(SPI2_SDO_PORT))
#define SPI2_SDO_GPIO (__gpio__(SPI2_SDO_PORT))
#if (SPI2_SDO_BIT < 8)
#define SPI2_SDO_CROFF SPI2_SDO_BIT
#define SPI2_SDO_CR CRL
#else
#define SPI2_SDO_CROFF (SPI2_SDO_BIT & 0x07)
#define SPI2_SDO_CR CRH
#endif
#define DIO214 214
#define DIO214_PORT SPI2_SDO_PORT
#define DIO214_BIT SPI2_SDO_BIT
#define DIO214_APB2EN SPI2_SDO_APB2EN
#define DIO214_GPIO SPI2_SDO_GPIO
#define DIO214_CR SPI2_SDO_CR
#define DIO214_CROFF SPI2_SDO_CROFF
#endif
#if (defined(SPI2_CS_PORT) && defined(SPI2_CS_BIT))
#define SPI2_CS 215
#define SPI2_CS_APB2EN (__rccapb2gpioen__(SPI2_CS_PORT))
#define SPI2_CS_GPIO (__gpio__(SPI2_CS_PORT))
#if (SPI2_CS_BIT < 8)
#define SPI2_CS_CROFF SPI2_CS_BIT
#define SPI2_CS_CR CRL
#else
#define SPI2_CS_CROFF (SPI2_CS_BIT & 0x07)
#define SPI2_CS_CR CRH
#endif
#define DIO215 215
#define DIO215_PORT SPI2_CS_PORT
#define DIO215_BIT SPI2_CS_BIT
#define DIO215_APB2EN SPI2_CS_APB2EN
#define DIO215_GPIO SPI2_CS_GPIO
#define DIO215_CR SPI2_CS_CR
#define DIO215_CROFF SPI2_CS_CROFF
#endif

#if (defined(TX) && defined(RX))
#define MCU_HAS_UART
#endif
#if (defined(TX2) && defined(RX2))
#define MCU_HAS_UART2
#endif
#if (defined(USB_DP) && defined(USB_DM))
#define MCU_HAS_USB
extern uint32_t tud_cdc_n_write_available(uint8_t itf);
extern uint32_t tud_cdc_n_available(uint8_t itf);
extern bool tud_cdc_n_connected(uint8_t itf);
#define usb_tx_available()                                                     \
  (tud_cdc_n_write_available(0) || !tud_cdc_n_connected(0))
#define usb_rx_available() tud_cdc_n_available(0)
#endif

/**********************************************
 *	ISR on change inputs
 **********************************************/
#define EXTINT_A 0
#define EXTINT_B 1
#define EXTINT_C 2
#define EXTINT_D 3
#define EXTINT_E 4
#define EXTINT_F 5
#define EXTINT_G 6
#define _EXTINT(X) EXTINT_##X
#define EXTINT(X) _EXTINT(X)

#define EXTIRQ_0 EXTI0_IRQn
#define EXTIRQ_1 EXTI1_IRQn
#define EXTIRQ_2 EXTI2_IRQn
#define EXTIRQ_3 EXTI3_IRQn
#define EXTIRQ_4 EXTI4_IRQn
#define EXTIRQ_5 EXTI9_5_IRQn
#define EXTIRQ_6 EXTI9_5_IRQn
#define EXTIRQ_7 EXTI9_5_IRQn
#define EXTIRQ_8 EXTI9_5_IRQn
#define EXTIRQ_9 EXTI9_5_IRQn
#define EXTIRQ_10 EXTI15_10_IRQn
#define EXTIRQ_11 EXTI15_10_IRQn
#define EXTIRQ_12 EXTI15_10_IRQn
#define EXTIRQ_13 EXTI15_10_IRQn
#define EXTIRQ_14 EXTI15_10_IRQn
#define EXTIRQ_15 EXTI15_10_IRQn
#define _EXTIRQ(X) EXTIRQ_##X
#define EXTIRQ(X) _EXTIRQ(X)

