Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f1x/mcumap_stm32f1x.h
#if (defined(PWM13_CHANNEL) && defined(PWM13_TIMER) && defined(PWM13))
#if (PWM13_TIMER == 1 || (PWM13_TIMER >= 8 & PWM13_TIMER <= 11))
#define PWM13_ENREG RCC->APB2ENR
#define PWM13_CLOCK HAL_RCC_GetPCLK2Freq()
#define PWM13_APBEN __helper__(RCC_APB2ENR_TIM, PWM13_TIMER, EN)
#else
#define PWM13_ENREG RCC->APB1ENR
#define PWM13_CLOCK HAL_RCC_GetPCLK1Freq()
#define PWM13_APBEN __helper__(RCC_APB1ENR_TIM, PWM13_TIMER, EN)
#endif
#define PWM13_TIMREG (__tim__(PWM13_TIMER))
#ifndef PWM13_FREQ
#define PWM13_FREQ 1000
#endif
#if (PWM13_CHANNEL & 0x01)
#define PWM13_MODE 0x0064
#else
#define PWM13_MODE 0x6400
#endif
#if (PWM13_CHANNEL > 2)
#define PWM13_CCMREG CCMR2
#else
#define PWM13_CCMREG CCMR1
#endif
#if (PWM13_TIMER == 1)
#define PWM13_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM13_TIMER == 8)
#define PWM13_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM13_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#define PWM13_CCR __ccr__(PWM13_CHANNEL)
#define DIO38_TIMER PWM13_TIMER
#define DIO38_CHANNEL PWM13_CHANNEL
#define DIO38_ENREG PWM13_ENREG
#define DIO38_APBEN PWM13_APBEN
#define DIO38_TIMREG PWM13_TIMREG
#define DIO38_APBEN PWM13_APBEN
#define DIO38_FREQ PWM13_FREQ
#define DIO38_MODE PWM13_MODE
#define DIO38_CCMREG PWM13_CCMREG
#define DIO38_CCR PWM13_CCR
#define DIO38_ENOUTPUT PWM13_ENOUTPUT
#define DIO38_CLOCK PWM13_CLOCK
#endif
#if (defined(PWM14_CHANNEL) && defined(PWM14_TIMER) && defined(PWM14))
#if (PWM14_TIMER == 1 || (PWM14_TIMER >= 8 & PWM14_TIMER <= 11))
#define PWM14_ENREG RCC->APB2ENR
#define PWM14_CLOCK HAL_RCC_GetPCLK2Freq()
#define PWM14_APBEN __helper__(RCC_APB2ENR_TIM, PWM14_TIMER, EN)
#else
#define PWM14_ENREG RCC->APB1ENR
#define PWM14_CLOCK HAL_RCC_GetPCLK1Freq()
#define PWM14_APBEN __helper__(RCC_APB1ENR_TIM, PWM14_TIMER, EN)
#endif
#define PWM14_TIMREG (__tim__(PWM14_TIMER))
#ifndef PWM14_FREQ
#define PWM14_FREQ 1000
#endif
#if (PWM14_CHANNEL & 0x01)
#define PWM14_MODE 0x0064
#else
#define PWM14_MODE 0x6400
#endif
#if (PWM14_CHANNEL > 2)
#define PWM14_CCMREG CCMR2
#else
#define PWM14_CCMREG CCMR1
#endif
#if (PWM14_TIMER == 1)
#define PWM14_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM14_TIMER == 8)
#define PWM14_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM14_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#define PWM14_CCR __ccr__(PWM14_CHANNEL)
#define DIO39_TIMER PWM14_TIMER
#define DIO39_CHANNEL PWM14_CHANNEL
#define DIO39_ENREG PWM14_ENREG
#define DIO39_APBEN PWM14_APBEN
#define DIO39_TIMREG PWM14_TIMREG
#define DIO39_APBEN PWM14_APBEN
#define DIO39_FREQ PWM14_FREQ
#define DIO39_MODE PWM14_MODE
#define DIO39_CCMREG PWM14_CCMREG
#define DIO39_CCR PWM14_CCR
#define DIO39_ENOUTPUT PWM14_ENOUTPUT
#define DIO39_CLOCK PWM14_CLOCK
#endif
#if (defined(PWM15_CHANNEL) && defined(PWM15_TIMER) && defined(PWM15))
#if (PWM15_TIMER == 1 || (PWM15_TIMER >= 8 & PWM15_TIMER <= 11))
#define PWM15_ENREG RCC->APB2ENR
#define PWM15_CLOCK HAL_RCC_GetPCLK2Freq()
#define PWM15_APBEN __helper__(RCC_APB2ENR_TIM, PWM15_TIMER, EN)
#else
#define PWM15_ENREG RCC->APB1ENR
#define PWM15_CLOCK HAL_RCC_GetPCLK1Freq()
#define PWM15_APBEN __helper__(RCC_APB1ENR_TIM, PWM15_TIMER, EN)
#endif
#define PWM15_TIMREG (__tim__(PWM15_TIMER))
#ifndef PWM15_FREQ
#define PWM15_FREQ 1000
#endif
#if (PWM15_CHANNEL & 0x01)
#define PWM15_MODE 0x0064
#else
#define PWM15_MODE 0x6400
#endif
#if (PWM15_CHANNEL > 2)
#define PWM15_CCMREG CCMR2
#else
#define PWM15_CCMREG CCMR1
#endif
#if (PWM15_TIMER == 1)
#define PWM15_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM15_TIMER == 8)
#define PWM15_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM15_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#define PWM15_CCR __ccr__(PWM15_CHANNEL)
#define DIO40_TIMER PWM15_TIMER
#define DIO40_CHANNEL PWM15_CHANNEL
#define DIO40_ENREG PWM15_ENREG
#define DIO40_APBEN PWM15_APBEN
#define DIO40_TIMREG PWM15_TIMREG
#define DIO40_APBEN PWM15_APBEN
#define DIO40_FREQ PWM15_FREQ
#define DIO40_MODE PWM15_MODE
#define DIO40_CCMREG PWM15_CCMREG
#define DIO40_CCR PWM15_CCR
#define DIO40_ENOUTPUT PWM15_ENOUTPUT
#define DIO40_CLOCK PWM15_CLOCK
#endif

/**********************************************
 *	Analog pins
 **********************************************/
#ifdef ANALOG0
#ifndef ANALOG0_CHANNEL
#define ANALOG0_CHANNEL -1
#endif
#define DIO114_CHANNEL ANALOG0_CHANNEL
#endif
#ifdef ANALOG1
#ifndef ANALOG1_CHANNEL
#define ANALOG1_CHANNEL -1
#endif
#define DIO115_CHANNEL ANALOG1_CHANNEL
#endif
#ifdef ANALOG2
#ifndef ANALOG2_CHANNEL
#define ANALOG2_CHANNEL -1
#endif
#define DIO116_CHANNEL ANALOG2_CHANNEL
#endif
#ifdef ANALOG3
#ifndef ANALOG3_CHANNEL
#define ANALOG3_CHANNEL -1
#endif
#define DIO117_CHANNEL ANALOG3_CHANNEL
#endif
#ifdef ANALOG4
#ifndef ANALOG4_CHANNEL
#define ANALOG4_CHANNEL -1
#endif
#define DIO118_CHANNEL ANALOG4_CHANNEL
#endif
#ifdef ANALOG5
#ifndef ANALOG5_CHANNEL
#define ANALOG5_CHANNEL -1
#endif
#define DIO119_CHANNEL ANALOG5_CHANNEL
#endif
#ifdef ANALOG6
#ifndef ANALOG6_CHANNEL
#define ANALOG6_CHANNEL -1
#endif
#define DIO120_CHANNEL ANALOG6_CHANNEL
#endif
#ifdef ANALOG7
#ifndef ANALOG7_CHANNEL
#define ANALOG7_CHANNEL -1
#endif
#define DIO121_CHANNEL ANALOG7_CHANNEL
#endif
#ifdef ANALOG8
#ifndef ANALOG8_CHANNEL
#define ANALOG8_CHANNEL -1
#endif
#define DIO122_CHANNEL ANALOG8_CHANNEL
#endif
#ifdef ANALOG9
#ifndef ANALOG9_CHANNEL
#define ANALOG9_CHANNEL -1
#endif
#define DIO123_CHANNEL ANALOG9_CHANNEL
#endif
#ifdef ANALOG10
#ifndef ANALOG10_CHANNEL
#define ANALOG10_CHANNEL -1
#endif
#define DIO124_CHANNEL ANALOG10_CHANNEL
#endif
#ifdef ANALOG11
#ifndef ANALOG11_CHANNEL
#define ANALOG11_CHANNEL -1
#endif
#define DIO125_CHANNEL ANALOG11_CHANNEL
#endif
#ifdef ANALOG12
#ifndef ANALOG12_CHANNEL
#define ANALOG12_CHANNEL -1
#endif
#define DIO126_CHANNEL ANALOG12_CHANNEL
#endif
#ifdef ANALOG13
#ifndef ANALOG13_CHANNEL
#define ANALOG13_CHANNEL -1
#endif
#define DIO127_CHANNEL ANALOG13_CHANNEL
#endif
#ifdef ANALOG14
#ifndef ANALOG14_CHANNEL
#define ANALOG14_CHANNEL -1
#endif
#define DIO128_CHANNEL ANALOG14_CHANNEL
#endif
#ifdef ANALOG15
#ifndef ANALOG15_CHANNEL
#define ANALOG15_CHANNEL -1
#endif
#define DIO129_CHANNEL ANALOG15_CHANNEL
#endif

// COM registers
#ifdef MCU_HAS_UART
#ifndef UART_PORT
#define UART_PORT 1
#endif
// this MCU does not work well with both TX and RX interrupt
// this forces the sync TX method to fix communication
#if (UART_PORT < 4)
#define COM_UART __usart__(UART_PORT)
#define COM_IRQ __helper__(USART, UART_PORT, _IRQn)
#define MCU_SERIAL_ISR __helper__(USART, UART_PORT, _IRQHandler)
#define COM_OUTREG (COM_UART)->DR
#define COM_INREG (COM_UART)->DR
#if (UART_PORT == 1)
#define COM_APB APB2ENR
#define COM_APBEN __helper__(RCC_APB2ENR_USART, UART_PORT, EN)
#else
#define COM_APB APB1ENR
#define COM_APBEN __helper__(RCC_APB1ENR_USART, UART_PORT, EN)
#endif
#else
#define COM_UART __uart__(UART_PORT)
#define COM_IRQ __helper__(UART, UART_PORT, _IRQn)
#define MCU_SERIAL_ISR __helper__(UART, UART_PORT, _IRQHandler)
#define COM_APB APB1ENR
#define COM_APBEN __helper__(RCC_APB1ENR_, COM_UART, EN)
#define COM_OUTREG (COM_UART)->DR
#define COM_INREG (COM_UART)->DR
#endif

#define UART_TX_PIN __iopin__(TX_PORT, TX_BIT)
#define UART_RX_PIN __iopin__(RX_PORT, RX_BIT)

// remmaping and pin checking
//  USART	TX	RX	APB	APB2ENR	REMAP
//  1	A9	A10	APB2ENR	RCC_APB2ENR_USART1EN	0
//  1	B6	B7	APB2ENR	RCC_APB2ENR_USART1EN	1
//  2	A2	A3	APB1ENR	RCC_APB1ENR_USART2EN	0
//  2	D5	D6	APB1ENR	RCC_APB1ENR_USART2EN	1
//  3	B10	B11	APB1ENR	RCC_APB1ENR_USART3EN	0
//  3	C10	C11	APB1ENR	RCC_APB1ENR_USART3EN	1
//  3	D8	D9	APB1ENR	RCC_APB1ENR_USART3EN	3
//  4	C10	C11	APB1ENR	RCC_APB1ENR_UART4EN	x
//  5	C12	D2	APB1ENR	RCC_APB1ENR_UART5EN	x
#if (UART_PORT == 1)
#define UART_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define UART_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#if ((UART_PORT == 1) && (UART_TX_PIN == A9) && (UART_RX_PIN == A10))
#elif ((UART_PORT == 1) && (UART_TX_PIN == B6) && (UART_RX_PIN == B7))
#define COM_REMAP AFIO_MAPR_USART1_REMAP
#elif ((UART_PORT == 2) && (UART_TX_PIN == A2) && (UART_RX_PIN == A3))
#elif ((UART_PORT == 2) && (UART_TX_PIN == D5) && (UART_RX_PIN == D6))
#define COM_REMAP AFIO_MAPR_USART2_REMAP
#elif ((UART_PORT == 3) && (UART_TX_PIN == B10) && (UART_RX_PIN == B11))
#elif ((UART_PORT == 3) && (UART_TX_PIN == C10) && (UART_RX_PIN == C11))
#define COM_REMAP AFIO_MAPR_USART3_REMAP_PARTIALREMAP
#elif ((UART_PORT == 3) && (UART_TX_PIN == D8) && (UART_RX_PIN == D9))
#define COM_REMAP AFIO_MAPR_USART3_REMAP_FULLREMAP
#elif ((UART_PORT == 4) && (UART_TX_PIN == C10) && (UART_RX_PIN == C11))
#elif ((UART_PORT == 5) && (UART_TX_PIN == C12) && (UART_RX_PIN == D2))
#else
#error "USART/UART pin configuration not supported"
#endif
#endif

#ifdef MCU_HAS_UART2
#ifndef BAUDRATE2
#define BAUDRATE2 BAUDRATE
#endif
#ifndef UART2_PORT
#define UART2_PORT 1
#endif
// this MCU does not work well with both TX and RX interrupt
// this forces the sync TX method to fix communication
#if (UART2_PORT < 4)
#define COM2_UART __usart__(UART2_PORT)
#define COM2_IRQ __helper__(USART, UART2_PORT, _IRQn)
#define MCU_SERIAL2_ISR __helper__(USART, UART2_PORT, _IRQHandler)
#define COM2_OUTREG (COM2_UART)->DR
#define COM2_INREG (COM2_UART)->DR
#if (UART2_PORT == 1)
#define COM2_APB APB2ENR
#define COM2_APBEN __helper__(RCC_APB2ENR_USART, UART2_PORT, EN)
#else
#define COM2_APB APB1ENR
#define COM2_APBEN __helper__(RCC_APB1ENR_USART, UART2_PORT, EN)
#endif
#else
#define COM2_UART __uart__(UART2_PORT)
#define COM2_IRQ __helper__(UART, UART2_PORT, _IRQn)
#define MCU_SERIAL2_ISR __helper__(UART, UART2_PORT, _IRQHandler)
#define COM2_APB APB1ENR
#define COM2_APBEN __helper__(RCC_APB1ENR_, COM2_UART, EN)
#define COM2_OUTREG (COM2_UART)->DR
#define COM2_INREG (COM2_UART)->DR
#endif

#define UART2_TX_PIN __iopin__(TX2_PORT, TX2_BIT)
#define UART2_RX_PIN __iopin__(RX2_PORT, RX2_BIT)

// remmaping and pin checking
//  USART	TX	RX	APB	APB2ENR	REMAP
//  1	A9	A10	APB2ENR	RCC_APB2ENR_USART1EN	0
//  1	B6	B7	APB2ENR	RCC_APB2ENR_USART1EN	1
//  2	A2	A3	APB1ENR	RCC_APB1ENR_USART2EN	0
//  2	D5	D6	APB1ENR	RCC_APB1ENR_USART2EN	1
//  3	B10	B11	APB1ENR	RCC_APB1ENR_USART3EN	0
//  3	C10	C11	APB1ENR	RCC_APB1ENR_USART3EN	1
//  3	D8	D9	APB1ENR	RCC_APB1ENR_USART3EN	3
//  4	C10	C11	APB1ENR	RCC_APB1ENR_UART4EN	x
//  5	C12	D2	APB1ENR	RCC_APB1ENR_UART5EN	x
#if (UART2_PORT == 1)
#define UART2_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define UART2_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#if ((UART2_PORT == 1) && (UART2_TX_PIN == A9) && (UART2_RX_PIN == A10))
#elif ((UART2_PORT == 1) && (UART2_TX_PIN == B6) && (UART2_RX_PIN == B7))
#define COM2_REMAP AFIO_MAPR_USART1_REMAP
#elif ((UART2_PORT == 2) && (UART2_TX_PIN == A2) && (UART2_RX_PIN == A3))
#elif ((UART2_PORT == 2) && (UART2_TX_PIN == D5) && (UART2_RX_PIN == D6))
#define COM2_REMAP AFIO_MAPR_USART2_REMAP
#elif ((UART2_PORT == 3) && (UART2_TX_PIN == B10) && (UART2_RX_PIN == B11))
#elif ((UART2_PORT == 3) && (UART2_TX_PIN == C10) && (UART2_RX_PIN == C11))
#define COM2_REMAP AFIO_MAPR_USART3_REMAP_PARTIALREMAP
#elif ((UART2_PORT == 3) && (UART2_TX_PIN == D8) && (UART2_RX_PIN == D9))
#define COM2_REMAP AFIO_MAPR_USART3_REMAP_FULLREMAP
#elif ((UART2_PORT == 4) && (UART2_TX_PIN == C10) && (UART2_RX_PIN == C11))
#elif ((UART2_PORT == 5) && (UART2_TX_PIN == C12) && (UART2_RX_PIN == D2))
#else
#error "USART/UART2 pin configuration not supported"
#endif
#endif

#if (defined(SPI_CLK) && defined(SPI_SDO) && defined(SPI_SDI))
#define MCU_HAS_SPI
#define SPI_CLK_PIN __iopin__(SPI_CLK_PORT, SPI_CLK_BIT)
#define SPI_SDO_PIN __iopin__(SPI_SDO_PORT, SPI_SDO_BIT)
#define SPI_SDI_PIN __iopin__(SPI_SDI_PORT, SPI_SDI_BIT)
#ifndef SPI_PORT
#define SPI_PORT 1
#endif
#ifndef SPI_MODE
#define SPI_MODE 0
#endif
#ifndef SPI_FREQ
#define SPI_FREQ 1000000UL
#endif
// remmaping and pin checking
//  SPI	CLK	SDI	SDO	REMAP
//  1	A5	A6	A7	0
//  1	B3	B4	B5	1
//  2	B13	B14	B15	NOREMAP
//  3	B3	B4	B5	0
//  3	C10	C11	C12	1
#if ((SPI_PORT == 1) && (SPI_CLK_PIN == A5) && (SPI_SDI_PIN == A6) &&          \
     (SPI_SDO_PIN == A7))
#elif ((SPI_PORT == 1) && (SPI_CLK_PIN == B3) && (SPI_SDI_PIN == B4) &&        \
       (SPI_SDO_PIN == B5))
#define SPI_REMAP AFIO_MAPR_SPI1_REMAP
#elif ((SPI_PORT == 2) && (SPI_CLK_PIN == B13) && (SPI_SDI_PIN == B14) &&      \
       (SPI_SDO_PIN == B15))
#elif ((SPI_PORT == 3) && (SPI_CLK_PIN == B3) && (SPI_SDI_PIN == B4) &&        \
       (SPI_SDO_PIN == B5))
#elif ((SPI_PORT == 3) && (SPI_CLK_PIN == C10) && (SPI_SDI_PIN == C11) &&      \
       (SPI_SDO_PIN == C12))
#define SPI_REMAP AFIO_MAPR_SPI3_REMAP
#else
#error "SPI pin configuration not supported"
#endif

#define SPI_REG __helper__(SPI, SPI_PORT, )
#if (SPI_PORT == 1)
#define SPI_ENREG RCC->APB2ENR
#define SPI_ENVAL RCC_APB2ENR_SPI1EN
#define SPI_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define SPI_ENREG RCC->APB1ENR
#define SPI_ENVAL __helper__(RCC_APB1ENR_SPI, SPI_PORT, EN)
#define SPI_CLOCK HAL_RCC_GetPCLK1Freq()
#endif

#if (SPI_PORT == 1)
#define SPI_DMA_CONTROLLER_NUM 1
#define SPI_DMA_TX_CHANNEL_NUM 3
#define SPI_DMA_RX_CHANNEL_NUM 2
#define SPI_DMA_TX_IFR_POS 8
#define SPI_DMA_RX_IFR_POS 4
#elif (SPI_PORT == 2)
#define SPI_DMA_CONTROLLER_NUM 1
#define SPI_DMA_TX_CHANNEL_NUM 5
#define SPI_DMA_RX_CHANNEL_NUM 4
#define SPI_DMA_TX_IFR_POS 16
#define SPI_DMA_RX_IFR_POS 12
#elif (SPI_PORT == 3)
#define SPI_DMA_CONTROLLER_NUM 2
#define SPI_DMA_TX_CHANNEL_NUM 2
#define SPI_DMA_RX_CHANNEL_NUM 1
#define SPI_DMA_TX_IFR_POS 4
#define SPI_DMA_RX_IFR_POS 0
#endif

