Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f1x/mcumap_stm32f1x.h
#define SPI_DMA_CONTROLLER __helper__(DMA, SPI_DMA_CONTROLLER_NUM, )
#define SPI_DMA_EN __helper__(RCC_AHBENR_DMA, SPI_DMA_CONTROLLER_NUM, EN)

#define SPI_DMA_TX_CHANNEL                                                     \
  __helper__(__helper__(DMA, SPI_DMA_CONTROLLER_NUM, _Channel),                \
             SPI_DMA_TX_CHANNEL_NUM, )
#define SPI_DMA_RX_CHANNEL                                                     \
  __helper__(__helper__(DMA, SPI_DMA_CONTROLLER_NUM, _Channel),                \
             SPI_DMA_RX_CHANNEL_NUM, )

#define SPI_DMA_TX_IFCR_MASK (0b1111 << SPI_DMA_TX_IFR_POS)
#define SPI_DMA_RX_IFCR_MASK (0b1111 << SPI_DMA_RX_IFR_POS)

#define SPI_IRQ __helper__(SPI, SPI_PORT, _IRQn)
#define SPI_ISR __helper__(SPI, SPI_PORT, _IRQHandler)

#endif

#if (defined(SPI2_CLK) && defined(SPI2_SDO) && defined(SPI2_SDI))
#define MCU_HAS_SPI2
#define SPI2_CLK_PIN __iopin__(SPI2_CLK_PORT, SPI2_CLK_BIT)
#define SPI2_SDO_PIN __iopin__(SPI2_SDO_PORT, SPI2_SDO_BIT)
#define SPI2_SDI_PIN __iopin__(SPI2_SDI_PORT, SPI2_SDI_BIT)
#ifndef SPI2_PORT
#define SPI2_PORT 1
#endif
#ifndef SPI2_MODE
#define SPI2_MODE 0
#endif
#ifndef SPI2_FREQ
#define SPI2_FREQ 1000000UL
#endif
// remmaping and pin checking
//  SPI2	CLK	SDI	SDO	REMAP
//  1	A5	A6	A7	0
//  1	B3	B4	B5	1
//  2	B13	B14	B15	NOREMAP
//  3	B3	B4	B5	0
//  3	C10	C11	C12	1
#if ((SPI2_PORT == 1) && (SPI2_CLK_PIN == A5) && (SPI2_SDI_PIN == A6) &&       \
     (SPI2_SDO_PIN == A7))
#elif ((SPI2_PORT == 1) && (SPI2_CLK_PIN == B3) && (SPI2_SDI_PIN == B4) &&     \
       (SPI2_SDO_PIN == B5))
#define SPI2_REMAP AFIO_MAPR_SPI1_REMAP
#elif ((SPI2_PORT == 2) && (SPI2_CLK_PIN == B13) && (SPI2_SDI_PIN == B14) &&   \
       (SPI2_SDO_PIN == B15))
#elif ((SPI2_PORT == 3) && (SPI2_CLK_PIN == B3) && (SPI2_SDI_PIN == B4) &&     \
       (SPI2_SDO_PIN == B5))
#elif ((SPI2_PORT == 3) && (SPI2_CLK_PIN == C10) && (SPI2_SDI_PIN == C11) &&   \
       (SPI2_SDO_PIN == C12))
#define SPI2_REMAP AFIO_MAPR_SPI3_REMAP
#else
#error "SPI2 pin configuration not supported"
#endif

#define SPI2_REG __helper__(SPI, SPI2_PORT, )
#if (SPI2_PORT == 1)
#define SPI2_ENREG RCC->APB2ENR
#define SPI2_ENVAL RCC_APB2ENR_SPI1EN
#define SPI2_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define SPI2_ENREG RCC->APB1ENR
#define SPI2_ENVAL __helper__(RCC_APB1ENR_SPI, SPI2_PORT, EN)
#define SPI2_CLOCK HAL_RCC_GetPCLK1Freq()
#endif

#if (SPI2_PORT == 1)
#define SPI2_DMA_CONTROLLER_NUM 1
#define SPI2_DMA_TX_CHANNEL_NUM 3
#define SPI2_DMA_RX_CHANNEL_NUM 2
#define SPI2_DMA_TX_IFR_POS 8
#define SPI2_DMA_RX_IFR_POS 4
#elif (SPI2_PORT == 2)
#define SPI2_DMA_CONTROLLER_NUM 1
#define SPI2_DMA_TX_CHANNEL_NUM 5
#define SPI2_DMA_RX_CHANNEL_NUM 4
#define SPI2_DMA_TX_IFR_POS 16
#define SPI2_DMA_RX_IFR_POS 12
#elif (SPI2_PORT == 3)
#define SPI2_DMA_CONTROLLER_NUM 2
#define SPI2_DMA_TX_CHANNEL_NUM 2
#define SPI2_DMA_RX_CHANNEL_NUM 1
#define SPI2_DMA_TX_IFR_POS 4
#define SPI2_DMA_RX_IFR_POS 0
#endif

#define SPI2_DMA_CONTROLLER __helper__(DMA, SPI2_DMA_CONTROLLER_NUM, )
#define SPI2_DMA_EN __helper__(RCC_AHBENR_DMA, SPI2_DMA_CONTROLLER_NUM, EN)

#define SPI2_DMA_TX_CHANNEL                                                    \
  __helper__(__helper__(DMA, SPI2_DMA_CONTROLLER_NUM, _Channel),               \
             SPI2_DMA_TX_CHANNEL_NUM, )
#define SPI2_DMA_RX_CHANNEL                                                    \
  __helper__(__helper__(DMA, SPI2_DMA_CONTROLLER_NUM, _Channel),               \
             SPI2_DMA_RX_CHANNEL_NUM, )

#define SPI2_DMA_TX_IFCR_MASK (0b1111 << SPI2_DMA_TX_IFR_POS)
#define SPI2_DMA_RX_IFCR_MASK (0b1111 << SPI2_DMA_RX_IFR_POS)

#define SPI2_IRQ __helper__(SPI, SPI2_PORT, _IRQn)
#define SPI2_ISR __helper__(SPI, SPI2_PORT, _IRQHandler)

#endif

// I2C
#if (defined(I2C_CLK) && defined(I2C_DATA))
#define MCU_HAS_I2C
#define MCU_SUPPORTS_I2C_SLAVE
#ifndef I2C_ADDRESS
#define I2C_ADDRESS 0
#endif

#define I2C_CLK_PIN __iopin__(I2C_CLK_PORT, I2C_CLK_BIT)
#define I2C_DATA_PIN __iopin__(I2C_DATA_PORT, I2C_DATA_BIT)
#ifndef I2C_PORT
#define I2C_PORT 1
#endif
#define I2C_IRQ __helper__(I2C, I2C_PORT, _EV_IRQn)
#define I2C_ISR __helper__(I2C, I2C_PORT, _EV_IRQHandler)

#define I2C_APBEN __helper__(RCC_APB1ENR_I2C, I2C_PORT, EN)
#define I2C_REG __helper__(I2C, I2C_PORT, )
#define I2C_SPEEDRANGE (HAL_RCC_GetPCLK1Freq() / 1000000UL)

#if ((I2C_PORT == 1) && (I2C_CLK_PIN == B6) && (I2C_DATA_PIN == B7))
#elif ((I2C_PORT == 1) && (I2C_CLK_PIN == B8) && (I2C_DATA_PIN == B9))
#define I2C_REMAP AFIO_MAPR_I2C1_REMAP
#elif ((I2C_PORT == 2) && (I2C_CLK_PIN == B10) && (I2C_DATA_PIN == B11))
#else
#error "I2C pin configuration not supported"
#endif

#ifndef I2C_FREQ
#define I2C_FREQ 400000UL
#endif

#endif

// Timer registers
#ifndef ITP_TIMER
#define ITP_TIMER 2
#endif
#if (ITP_TIMER == 1 || ITP_TIMER == 8)
#define MCU_ITP_ISR __helper__(TIM, ITP_TIMER, _UP_IRQHandler)
#define MCU_ITP_IRQ __helper__(TIM, ITP_TIMER, _UP_IRQn)
#elif (ITP_TIMER == 9)
#define MCU_ITP_ISR TIM1_BRK_TIM9_IRQHandler
#define MCU_ITP_IRQ TIM1_BRK_TIM9_IRQn
#elif (ITP_TIMER == 10)
#define MCU_ITP_ISR TIM1_UP_TIM10_IRQHandler
#define MCU_ITP_IRQ TIM1_UP_TIM10_IRQn
#elif (ITP_TIMER == 11)
#define MCU_ITP_ISR TIM1_TRG_COM_TIM11_IRQHandler
#define MCU_ITP_IRQ TIM1_TRG_COM_TIM11_IRQn
#elif (ITP_TIMER == 12)
#define MCU_ITP_ISR TIM8_BRK_TIM12_IRQHandler
#define MCU_ITP_IRQ TIM8_BRK_TIM12_IRQn
#elif (ITP_TIMER == 13)
#define MCU_ITP_ISR TIM8_UP_TIM13_IRQHandler
#define MCU_ITP_IRQ TIM8_UP_TIM13_IRQn
#elif (ITP_TIMER == 14)
#define MCU_ITP_ISR TIM8_TRG_COM_TIM14_IRQHandler
#define MCU_ITP_IRQ TIM8_TRG_COM_TIM14_IRQn
#else
#define MCU_ITP_ISR __helper__(TIM, ITP_TIMER, _IRQHandler)
#define MCU_ITP_IRQ __helper__(TIM, ITP_TIMER, _IRQn)
#endif
#define ITP_TIMER_REG __helper__(TIM, ITP_TIMER, )
#if (ITP_TIMER == 1 || (ITP_TIMER >= 8 & ITP_TIMER <= 11))
#define ITP_TIMER_ENREG APB2ENR
#define ITP_TIMER_RESETREG APB1RSTR
#define ITP_TIMER_APB __helper__(RCC_APB2ENR_TIM, ITP_TIMER, EN)
#define ITP_TIMER_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define ITP_TIMER_ENREG APB1ENR
#define ITP_TIMER_RESETREG APB1RSTR
#define ITP_TIMER_APB __helper__(RCC_APB1ENR_TIM, ITP_TIMER, EN)
#define ITP_TIMER_CLOCK HAL_RCC_GetPCLK1Freq()
#endif

#ifndef SERVO_TIMER
#define SERVO_TIMER 3
#endif
#if (SERVO_TIMER == 1 || SERVO_TIMER == 8)
#define MCU_SERVO_ISR __helper__(TIM, SERVO_TIMER, _UP_IRQHandler)
#define MCU_SERVO_IRQ __helper__(TIM, SERVO_TIMER, _UP_IRQn)
#elif (SERVO_TIMER == 9)
#define MCU_SERVO_ISR TIM1_BRK_TIM9_IRQHandler
#define MCU_SERVO_IRQ TIM1_BRK_TIM9_IRQn
#elif (SERVO_TIMER == 10)
#define MCU_SERVO_ISR TIM1_UP_TIM10_IRQHandler
#define MCU_SERVO_IRQ TIM1_UP_TIM10_IRQn
#elif (SERVO_TIMER == 11)
#define MCU_SERVO_ISR TIM1_TRG_COM_TIM11_IRQHandler
#define MCU_SERVO_IRQ TIM1_TRG_COM_TIM11_IRQn
#elif (SERVO_TIMER == 12)
#define MCU_SERVO_ISR TIM8_BRK_TIM12_IRQHandler
#define MCU_SERVO_IRQ TIM8_BRK_TIM12_IRQn
#elif (SERVO_TIMER == 13)
#define MCU_SERVO_ISR TIM8_UP_TIM13_IRQHandler
#define MCU_SERVO_IRQ TIM8_UP_TIM13_IRQn
#elif (SERVO_TIMER == 14)
#define MCU_SERVO_ISR TIM8_TRG_COM_TIM14_IRQHandler
#define MCU_SERVO_IRQ TIM8_TRG_COM_TIM14_IRQn
#else
#define MCU_SERVO_ISR __helper__(TIM, SERVO_TIMER, _IRQHandler)
#define MCU_SERVO_IRQ __helper__(TIM, SERVO_TIMER, _IRQn)
#endif
#define SERVO_TIMER_REG __helper__(TIM, SERVO_TIMER, )
#if (SERVO_TIMER == 1 || (SERVO_TIMER >= 8 & SERVO_TIMER <= 11))
#define SERVO_TIMER_ENREG APB2ENR
#define SERVO_TIMER_RESETREG APB1RSTR
#define SERVO_TIMER_APB __helper__(RCC_APB2ENR_TIM, SERVO_TIMER, EN)
#define SERVO_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define SERVO_TIMER_ENREG APB1ENR
#define SERVO_TIMER_RESETREG APB1RSTR
#define SERVO_TIMER_APB __helper__(RCC_APB1ENR_TIM, SERVO_TIMER, EN)
#define SERVO_CLOCK HAL_RCC_GetPCLK1Freq()
#endif

