Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f1x/mcumap_stm32f1x.h
#ifdef ONESHOT_TIMER
#define MCU_HAS_ONESHOT_TIMER
#if (ONESHOT_TIMER == 1 || ONESHOT_TIMER == 8)
#define MCU_ONESHOT_ISR __helper__(TIM, ONESHOT_TIMER, _UP_IRQHandler)
#define MCU_ONESHOT_IRQ __helper__(TIM, ONESHOT_TIMER, _UP_IRQn)
#elif (ONESHOT_TIMER == 9)
#define MCU_ONESHOT_ISR TIM1_BRK_TIM9_IRQHandler
#define MCU_ONESHOT_IRQ TIM1_BRK_TIM9_IRQn
#elif (ONESHOT_TIMER == 10)
#define MCU_ONESHOT_ISR TIM1_UP_TIM10_IRQHandler
#define MCU_ONESHOT_IRQ TIM1_UP_TIM10_IRQn
#elif (ONESHOT_TIMER == 11)
#define MCU_ONESHOT_ISR TIM1_TRG_COM_TIM11_IRQHandler
#define MCU_ONESHOT_IRQ TIM1_TRG_COM_TIM11_IRQn
#elif (ONESHOT_TIMER == 12)
#define MCU_ONESHOT_ISR TIM8_BRK_TIM12_IRQHandler
#define MCU_ONESHOT_IRQ TIM8_BRK_TIM12_IRQn
#elif (ONESHOT_TIMER == 13)
#define MCU_ONESHOT_ISR TIM8_UP_TIM13_IRQHandler
#define MCU_ONESHOT_IRQ TIM8_UP_TIM13_IRQn
#elif (ONESHOT_TIMER == 14)
#define MCU_ONESHOT_ISR TIM8_TRG_COM_TIM14_IRQHandler
#define MCU_ONESHOT_IRQ TIM8_TRG_COM_TIM14_IRQn
#else
#define MCU_ONESHOT_ISR __helper__(TIM, ONESHOT_TIMER, _IRQHandler)
#define MCU_ONESHOT_IRQ __helper__(TIM, ONESHOT_TIMER, _IRQn)
#endif
#define ONESHOT_TIMER_REG __helper__(TIM, ONESHOT_TIMER, )
#if (ONESHOT_TIMER == 1 || (ONESHOT_TIMER >= 8 & ONESHOT_TIMER <= 11))
#define ONESHOT_TIMER_ENREG APB2ENR
#define ONESHOT_TIMER_RESETREG APB1RSTR
#define ONESHOT_TIMER_APB __helper__(RCC_APB2ENR_TIM, ONESHOT_TIMER, EN)
#define ONESHOT_TIMER_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define ONESHOT_TIMER_ENREG APB1ENR
#define ONESHOT_TIMER_RESETREG APB1RSTR
#define ONESHOT_TIMER_APB __helper__(RCC_APB1ENR_TIM, ONESHOT_TIMER, EN)
#define ONESHOT_TIMER_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#endif

#ifndef __indirect__
#define __indirect__ex__(X, Y) DIO##X##_##Y
#define __indirect__(X, Y) __indirect__ex__(X, Y)
#endif

#ifndef BYTE_OPS
#define BYTE_OPS
// Set bit y in byte x
#define SETBIT(x, y) ((x) |= (1 << (y)))
// Clear bit y in byte x
#define CLEARBIT(x, y) ((x) &= ~(1 << (y)))
// Check bit y in byte x
#define CHECKBIT(x, y) ((x) & (1 << (y)))
// Toggle bit y in byte x
#define TOGGLEBIT(x, y) ((x) ^= (1 << (y)))
// Set byte y in byte x
#define SETFLAG(x, y) ((x) |= (y))
// Clear byte y in byte x
#define CLEARFLAG(x, y) ((x) &= ~(y))
// Check byte y in byte x
#define CHECKFLAG(x, y) ((x) & (y))
// Toggle byte y in byte x
#define TOGGLEFLAG(x, y) ((x) ^= (y))
#endif

#define mcu_config_input(diopin)                                               \
  {                                                                            \
    RCC->APB2ENR |= __indirect__(diopin, APB2EN);                              \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) &=                    \
        ~(GPIO_RESET << (__indirect__(diopin, CROFF) << 2U));                  \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) |=                    \
        (GPIO_IN_FLOAT << (__indirect__(diopin, CROFF) << 2U));                \
  }

#define mcu_config_output(diopin)                                              \
  {                                                                            \
    RCC->APB2ENR |= __indirect__(diopin, APB2EN);                              \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) &=                    \
        ~(GPIO_RESET << (__indirect__(diopin, CROFF) << 2U));                  \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) |=                    \
        (GPIO_OUT_PP_50MHZ << (__indirect__(diopin, CROFF) << 2U));            \
  }

#define mcu_config_output_af(diopin, mode)                                     \
  {                                                                            \
    RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;                                        \
    RCC->APB2ENR |= __indirect__(diopin, APB2EN);                              \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) &=                    \
        ~(GPIO_RESET << (__indirect__(diopin, CROFF) << 2U));                  \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) |=                    \
        (mode << (__indirect__(diopin, CROFF) << 2U));                         \
  }

#define mcu_config_input_af(diopin)                                            \
  {                                                                            \
    RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;                                        \
    RCC->APB2ENR |= __indirect__(diopin, APB2EN);                              \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) &=                    \
        ~(GPIO_RESET << (__indirect__(diopin, CROFF) << 2U));                  \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) |=                    \
        (GPIO_IN_FLOAT << (__indirect__(diopin, CROFF) << 2U));                \
  }

#define mcu_config_pullup(diopin)                                              \
  {                                                                            \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) &=                    \
        ~(GPIO_RESET << (__indirect__(diopin, CROFF) << 2U));                  \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) |=                    \
        (GPIO_IN_PUP << (__indirect__(diopin, CROFF) << 2U));                  \
    __indirect__(diopin, GPIO)->BSRR = (1U << __indirect__(diopin, BIT));      \
  }

#define mcu_config_pwm(diopin, freq)                                           \
  {                                                                            \
    RCC->APB2ENR |= 0x1U;                                                      \
    __indirect__(diopin, ENREG) |= __indirect__(diopin, APBEN);                \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) &=                    \
        ~(GPIO_RESET << ((__indirect__(diopin, CROFF)) << 2U));                \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) |=                    \
        (GPIO_OUTALT_PP_50MHZ << ((__indirect__(diopin, CROFF)) << 2U));       \
    __indirect__(diopin, TIMREG)->CR1 = 0;                                     \
    __indirect__(diopin, TIMREG)->PSC =                                        \
        (uint16_t)(__indirect__(diopin, CLOCK) / 1000000UL) - 1;               \
    __indirect__(diopin, TIMREG)->ARR = (uint16_t)(1000000UL / freq);          \
    __indirect__(diopin, TIMREG)->__indirect__(diopin, CCR) = 0;               \
    __indirect__(diopin, TIMREG)->__indirect__(diopin, CCMREG) =               \
        __indirect__(diopin, MODE);                                            \
    __indirect__(diopin, TIMREG)->CCER |=                                      \
        (1U << ((__indirect__(diopin, CHANNEL) - 1) << 2));                    \
    __indirect__(diopin, TIMREG)->BDTR |= (1 << 15);                           \
    __indirect__(diopin, TIMREG)->CR1 |= 0x01U;                                \
    __indirect__(diopin, ENOUTPUT);                                            \
  }

#define mcu_config_input_isr(diopin)                                           \
  {                                                                            \
    RCC->APB2ENR |= 0x1U;                                                      \
    AFIO->EXTICR[(__indirect__(diopin, EXTIREG))] &=                           \
        ~(0xF << (((__indirect__(diopin, BIT)) & 0x03) << 2));                 \
    AFIO->EXTICR[(__indirect__(diopin, EXTIREG))] |=                           \
        (__indirect__(diopin, EXTIVAL));                                       \
    SETBIT(EXTI->RTSR, __indirect__(diopin, BIT));                             \
    SETBIT(EXTI->FTSR, __indirect__(diopin, BIT));                             \
    SETBIT(EXTI->IMR, __indirect__(diopin, BIT));                              \
    NVIC_SetPriority(__indirect__(diopin, IRQ), NVIC_INPUT_IRQ_Pri);           \
    NVIC_ClearPendingIRQ(__indirect__(diopin, IRQ));                           \
    NVIC_EnableIRQ(__indirect__(diopin, IRQ));                                 \
  }

#define mcu_config_analog(diopin)                                              \
  {                                                                            \
    RCC->CFGR &= ~(RCC_CFGR_ADCPRE);                                           \
    RCC->CFGR |= RCC_CFGR_ADCPRE_DIV8;                                         \
    RCC->APB2ENR |=                                                            \
        (RCC_APB2ENR_ADC1EN | __indirect__(diopin, APB2EN) | 0x1U);            \
    ADC1->SQR1 = 1; /*one conversion*/                                         \
    ADC1->SMPR1 = 0x00ffffff & 0x36DB6DB6;                                     \
    ADC1->SMPR2 = 0x36DB6DB6;                                                  \
    ADC1->CR2 &= ~ADC_CR2_CONT; /*single conversion mode*/                     \
    __indirect__(diopin, GPIO)->__indirect__(diopin, CR) &=                    \
        ~(GPIO_RESET << ((__indirect__(diopin, CROFF)) << 2U));                \
    ADC1->CR2 |= ADC_CR2_ADON;   /*enable adc*/                                \
    ADC1->CR2 |= ADC_CR2_RSTCAL; /*reset calibration*/                         \
    while (ADC1->CR2 & ADC_CR2_RSTCAL)                                         \
      ;                                                                        \
    ADC1->CR2 |= ADC_CR2_CAL; /*start calibration*/                            \
    while (ADC1->CR2 & ADC_CR2_CAL)                                            \
      ;                                                                        \
    ADC1->CR2 |= (ADC_CR2_EXTSEL |                                             \
                  ADC_CR2_EXTTRIG); /*external start trigger software*/        \
  }

#define mcu_get_input(diopin)                                                  \
  (CHECKBIT(__indirect__(diopin, GPIO)->IDR, __indirect__(diopin, BIT)))
#define mcu_get_output(diopin)                                                 \
  (CHECKBIT(__indirect__(diopin, GPIO)->ODR, __indirect__(diopin, BIT)))
#define mcu_set_output(diopin)                                                 \
  (__indirect__(diopin, GPIO)->BSRR = (1U << __indirect__(diopin, BIT)))
#define mcu_clear_output(diopin)                                               \
  (__indirect__(diopin, GPIO)->BRR = (1U << __indirect__(diopin, BIT)))
#define mcu_toggle_output(diopin)                                              \
  (TOGGLEBIT(__indirect__(diopin, GPIO)->ODR, __indirect__(diopin, BIT)))
#define mcu_set_pwm(diopin, pwmvalue)                                          \
  {                                                                            \
    __indirect__(diopin, TIMREG)->__indirect__(diopin, CCR) =                  \
        (uint16_t)((((uint32_t)__indirect__(diopin, TIMREG)->ARR) *            \
                    pwmvalue) /                                                \
                   255);                                                       \
  }
#define mcu_get_pwm(diopin)                                                    \
  ((uint8_t)((((uint32_t)__indirect__(diopin, TIMREG)                          \
                   ->__indirect__(diopin, CCR)) *                              \
              255) /                                                           \
             ((uint32_t)__indirect__(diopin, TIMREG)->ARR)))

