Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f1x/mcumap_stm32f1x.h
#define mcu_get_analog(diopin)                                                 \
  ({                                                                           \
    ADC1->SQR3 = __indirect__(diopin, CHANNEL);                                \
    ADC1->CR2 |= ADC_CR2_SWSTART;                                              \
    ADC1->CR2 &= ~ADC_CR2_SWSTART;                                             \
    while (!(ADC1->SR & ADC_SR_EOS))                                           \
      ;                                                                        \
    ADC1->SR &= ~ADC_SR_EOS;                                                   \
    (0x3FF & (ADC1->DR >> 2));                                                 \
  })

#if defined(PROBE) && defined(PROBE_ISR)
#define mcu_enable_probe_isr() SETBIT(EXTI->IMR, PROBE_BIT)
#define mcu_disable_probe_isr() CLEARBIT(EXTI->IMR, PROBE_BIT)
#else
#define mcu_enable_probe_isr()
#define mcu_disable_probe_isr()
#endif

#define mcu_enable_global_isr __enable_irq
#define mcu_disable_global_isr __disable_irq
#define mcu_get_global_isr() (__get_PRIMASK() == 0u)
#define mcu_in_isr_context() (__get_IPSR() != 0)
#define mcu_free_micros()                                                      \
  ((uint32_t)((((SysTick->LOAD + 1) - SysTick->VAL) * 1000UL) /                \
              (SysTick->LOAD + 1)))

#define GPIO_RESET 0xfU
#define GPIO_OUT_PP_50MHZ 0x3U
#define GPIO_OUTALT_PP_50MHZ 0xbU
#define GPIO_OUTALT_OD_50MHZ 0xfU
#define GPIO_IN_FLOAT 0x4U
#define GPIO_IN_PUP 0x8U
#define GPIO_IN_ANALOG 0 // not needed after reseting bits

#ifdef MCU_HAS_ONESHOT_TIMER

/**
 * starts the timeout. Once hit the the respective callback is called
 * */
#define mcu_start_timeout()                                                    \
  ({                                                                           \
    ONESHOT_TIMER_REG->SR = 0;                                                 \
    ONESHOT_TIMER_REG->CNT = 0;                                                \
    ONESHOT_TIMER_REG->DIER |= 1;                                              \
    ONESHOT_TIMER_REG->CR1 |= 1;                                               \
  })
#endif

#ifdef __cplusplus
}
#endif

#endif
